#ifndef D_COM_D_COM_INF_GAME_H
#define D_COM_D_COM_INF_GAME_H

#include "JSystem/JUtility/TColor.h"
#include "d/d_attention.h"
#include "d/d_bg_s.h"
#include "d/d_cc_s.h"
#include "d/d_detect.h"
#include "d/d_drawlist.h"
#include "d/d_event.h"
#include "d/d_event_manager.h"
#include "d/d_map.h"
#include "d/d_particle.h"
#include "d/d_resorce.h"
#include "d/d_save.h"
#include "d/d_stage.h"
#include "d/d_vibration.h"
#include "d/d_wood.h"
#include "d/d_demo.h"
#include "d/d_timer.h"
#include "SSystem/SComponent/c_data_tbl.h"

class JKRArchive;
class JKRAramBlock;
class JKRExpHeap;
class dPa_control_c;
class dDemo_manager_c;
class dMagma_packet_c;
class dGrass_packet_c;
class dTree_packet_c;
class dFlower_packet_c;
class Packet_c;
class daPy_py_c;
class daPy_lk_c;
class daPy_npc_c;
class daShip_c;
class daAgb_c;
class dTimer_c;
class camera_class;
class J2DOrthoGraph;
class dDemo_actor_c;

enum ALWAYS_RES_FILE_ID { // IDs and indexes are synced
    /* BCK */
    ALWAYS_BCK_FA=0xC,
    ALWAYS_BCK_OBM_SYOUGEKISW=0xD,
    ALWAYS_BCK_START=0xE,
    ALWAYS_BCK_VBELL=0xF,
    ALWAYS_BCK_VBOKL=0x10,
    ALWAYS_BCK_VCHUL=0x11,
    ALWAYS_BCK_VDOKL=0x12,
    ALWAYS_BCK_VESAL=0x13,
    ALWAYS_BCK_VHANL=0x14,
    ALWAYS_BCK_VHAPL=0x15,
    ALWAYS_BCK_W_PILLAR_A=0x16,
    ALWAYS_BCK_YJ_DELETE=0x17,
    ALWAYS_BCK_YJ_IN=0x18,
    ALWAYS_BCK_YJ_LOOP=0x19,
    ALWAYS_BCK_YJ_OUT=0x1A,
    ALWAYS_BCK_YJ_SCALE=0x1B,
    
    /* BDL */
    ALWAYS_BDL_ARROWITEM=0x1E,
    ALWAYS_BDL_FA=0x1F,

    ALWAYS_BDL_OBM_KOISI1=0x21,
    ALWAYS_BDL_OBM_KOISI2=0x22,
    ALWAYS_BDL_OBM_KOTUBO1=0x23,
    ALWAYS_BDL_OBM_OOTUBO1=0x24,
    ALWAYS_BDL_VBELL=0x25,
    ALWAYS_BDL_VBOKL=0x26,
    ALWAYS_BDL_VDOKL=0x27,
    ALWAYS_BDL_VESAL=0x28,
    ALWAYS_BDL_VHAPL=0x29,
    ALWAYS_BDL_VHRTL=0x2A,
    ALWAYS_BDL_VKEYL=0x2B,
    
    /* BDLM */
    ALWAYS_BDL_IB=0x2E,
    ALWAYS_BDL_MPA_SIMI=0x2F,
    ALWAYS_BDL_MPI_KOISHI=0x30,
    ALWAYS_BDL_MPM_TUBO=0x31,
    ALWAYS_BDL_MPODA=0x32,
    ALWAYS_BDL_MPODB=0x33,
    ALWAYS_BDL_NH=0x34,
    ALWAYS_BDL_OBM_SYOUGEKISW=0x35,
    ALWAYS_BDL_VCHUL=0x36,
    ALWAYS_BDL_VHANL=0x37,
    ALWAYS_BDL_VHKAL=0x38,
    ALWAYS_BDL_VHUTL=0x39,
    ALWAYS_BDL_VLUPL=0x3A,
    ALWAYS_BDL_W_PILLAR_A=0x3B,
    ALWAYS_BDL_YA=0x3C,
    ALWAYS_BDL_YAZIRUSHI_01=0x3D,
    ALWAYS_BDL_YTHDR00=0x3E,
    
    /* BMTM */
    ALWAYS_BMT_ICE=0x41,
    
    /* BPK */
    ALWAYS_BPK_YJ_DELETE=0x44,
    ALWAYS_BPK_YJ_IN=0x45,
    ALWAYS_BPK_YJ_LOOP=0x46,
    ALWAYS_BPK_YJ_OUT=0x47,
    ALWAYS_BPK_YJ_SCALE=0x48,
    
    /* BRK */
    ALWAYS_BRK_IB_01=0x4B,
    ALWAYS_BRK_IB_02=0x4C,
    ALWAYS_BRK_MPA_SIMI=0x4D,
    ALWAYS_BRK_TNH=0x4E,
    ALWAYS_BRK_VCHUL=0x4F,
    ALWAYS_BRK_VHANL=0x50,
    ALWAYS_BRK_VLUPL=0x51,
    ALWAYS_BRK_YTHDR00=0x52,
    
    /* BTK */
    ALWAYS_BTK_EFA_USONAMI_01=0x55,
    ALWAYS_BTK_IB=0x56,
    ALWAYS_BTK_ICE=0x57,
    ALWAYS_BTK_OBM_SYOUGEKISW=0x58,
    ALWAYS_BTK_VBELL=0x59,
    ALWAYS_BTK_VHANL=0x5A,
    ALWAYS_BTK_VHKAL=0x5B,
    ALWAYS_BTK_VHUTL=0x5C,
    ALWAYS_BTK_VLUPL=0x5D,
    ALWAYS_BTK_W_PILLAR_A=0x5E,
    ALWAYS_BTK_YA=0x5F,
    ALWAYS_BTK_YTHDR00=0x60,
    
    /* BTP */
    ALWAYS_BTP_MPA_SIMI=0x63,
    ALWAYS_BTP_MPI_KIBAKO_TARU=0x64,
    ALWAYS_BTP_MPI_KINOHAHEN=0x65,
    ALWAYS_BTP_MPI_KOISHI=0x66,
    ALWAYS_BTP_MPM_TUBO=0x67,
    
    /* DAT */
    ALWAYS_BIN_ITEM_TABLE=0x6A,
    
    /* TEX */
    ALWAYS_BTI_AK_HOUSHI00=0x6D,
    ALWAYS_BTI_AK_SMOKE01=0x6E,
    ALWAYS_BTI_B_SEA_TEX0AND2=0x6F,
    ALWAYS_BTI_B_WYURAYURA_TEX1=0x70,
    ALWAYS_I4_BALL128B=0x71,
    ALWAYS_BTI_BLACK_WHITE_2=0x72,
    ALWAYS_BTI_CAMERA_FREE=0x73,
    ALWAYS_BTI_CAMERA_SELF=0x74,
    ALWAYS_BTI_F_SHIPICON=0x75,
    ALWAYS_CI4_MAP08G=0x76,
    ALWAYS_CI4_MAP16G=0x77,
    ALWAYS_BTI_MAP_BLACK_CI8=0x78,
    ALWAYS_BTI_MAP_CHECK16_CI4=0x79,
    ALWAYS_BTI_MAP_FRAME1=0x7A,
    ALWAYS_BTI_MAP_FRAME2=0x7B,
    ALWAYS_BTI_MAP_FRAME3=0x7C,
    ALWAYS_BTI_MAP_FRAME4=0x7D,
    ALWAYS_BTI_ROPE=0x7E,
    ALWAYS_BTI_SHMREF=0x7F,
    ALWAYS_BTI_TREASUREBOX=0x80,
    ALWAYS_I8_TX_SNOW01=0x81,
    ALWAYS_BTI_TXA_LENS_32HALF=0x82,
    ALWAYS_BTI_TXA_MOYA_A_64=0x83,
    ALWAYS_BTI_TXA_MOYA_B_64=0x84,
    ALWAYS_BTI_TXA_RING_A_32HAFE=0x85,
    ALWAYS_BTI_TXA_TAIYO=0x86,
    ALWAYS_BTI_TXA_TUKI_AS=0x87,
    ALWAYS_BTI_TXA_TUKI_BS=0x88,
    ALWAYS_BTI_TXA_TUKI_CS=0x89,
    ALWAYS_BTI_TXA_TUKI_DS=0x8A,
    ALWAYS_BTI_TXA_USONAMI_256_64MIP=0x8B,
    ALWAYS_BTI_TXA_USONAMI_M_256_64MIP=0x8C,
    ALWAYS_BTI_TXM_ROPE1=0x8D,
    ALWAYS_BTI_UMIPT=0x8E,
};

class __d_timer_info_c {
public:
    __d_timer_info_c() {
        mTimerMode = -1;
        mTimerLimitTimeMs = 0;
        mTimerNowTimeMs = 0;
        mTimerPtr = NULL;
    }

    /* 0x00 */ dTimer_c* mTimerPtr;
    /* 0x04 */ s32 mTimerNowTimeMs;
    /* 0x08 */ s32 mTimerLimitTimeMs;
    /* 0x0C */ s32 mTimerMode;
    /* 0x10 */ u16 mTimerType;
};

class dADM_CharTbl : public cDT {
public:
    /* 0x28 */ s32 mIndex_ARG;
    /* 0x2C */ s32 mIndex_N_ITEM0;
    /* 0x30 */ s32 mIndex_N_ITEM1;
    /* 0x34 */ s32 mIndex_N_ITEM2;
    /* 0x38 */ s32 mIndex_N_ITEM3;
    /* 0x3C */ s32 mIndex_N_ITEM4;
    /* 0x40 */ s32 mIndex_N_ITEM5;
    /* 0x44 */ s32 mIndex_N_ITEM6;
    /* 0x48 */ s32 mIndex_N_ITEM7;
    /* 0x4C */ s32 mIndex_N_ITEM8;
    /* 0x50 */ s32 mIndex_N_ITEM9;
    /* 0x54 */ s32 mIndex_N_ITEM10;
    /* 0x58 */ s32 mIndex_N_ITEM11;
    /* 0x5C */ s32 mIndex_N_ITEM12;
    /* 0x60 */ s32 mIndex_N_ITEM13;
    /* 0x64 */ s32 mIndex_N_ITEM14;
    /* 0x68 */ s32 mIndex_N_ITEM15;
    /* 0x6C */ s32 mIndex_percent;
    /* 0x70 */ s32 mIndex_ITEM0;
    /* 0x74 */ s32 mIndex_ITEM1;
    /* 0x78 */ s32 mIndex_ITEM2;
    /* 0x7C */ s32 mIndex_ITEM3;
    /* 0x80 */ s32 mIndex_ITEM4;
    /* 0x84 */ s32 mIndex_ITEM5;
    /* 0x88 */ s32 mIndex_ITEM6;
    /* 0x8C */ s32 mIndex_ITEM7;
};
STATIC_ASSERT(sizeof(dADM_CharTbl) == 0x90);

class dADM {
public:
    /* 0x00 */ int mBlockCount;
    /* 0x04 */ void* mpData;
    /* 0x08 */ dADM_CharTbl mCharTbl;

public:
    dADM();
    void FindTag(u32, u32*, u32*);
    void SetData(void*);

    virtual ~dADM();
};

class dComIfG_camera_info_class {
public:
    dComIfG_camera_info_class() {}
    ~dComIfG_camera_info_class() {}

    /* 0x00 */ camera_class* mpCamera;
    /* 0x04 */ u8 mDlstWindowIdx;
    /* 0x05 */ u8 mCamIdx;
    /* 0x06 */ u8 field_0x06;
    /* 0x07 */ u8 field_0x07;
    /* 0x08 */ u32 mCameraAttentionStatus;
    /* 0x0C */ f32 mCameraZoomScale;
    /* 0x10 */ f32 mCameraZoomForcus;
    /* 0x14 */ u8 field_0x14[0x34 - 0x14];
};
STATIC_ASSERT(sizeof(dComIfG_camera_info_class) == 0x34);

// This is /res/ItemTable/item_table.bin
// The real name of this struct is not currently known, this is a fake name.
struct ItemTableList {
    u8 mMagic[0xA]; // "ITEM_TABLE"
    short mEntryCount; // 0x1E
    u32 mPadding;
    u8 mItemTables[0x1E][0x10];
};

class dComIfG_play_c {
public:
    dComIfG_play_c() { ct(); }

    void ct();
    void init();
    void itemInit();
    static int getLayerNo(int i_roomNo);
    void createParticle();
    void createDemo();
    void removeDemo();
    void executeEvtManager();
    dMagma_packet_c* createMagma();
    void removeMagma();
    void executeMagma();
    void drawMagma();
    dGrass_packet_c* createGrass();
    void removeGrass();
    void executeGrass();
    void drawGrass();
    dFlower_packet_c* createFlower();
    void removeFlower();
    void executeFlower();
    void drawFlower();
    dTree_packet_c* createTree();
    void removeTree();
    void executeTree();
    void drawTree();
    dWood::Packet_c* createWood();
    void removeWood();
    void executeWood();
    void drawWood();
    
    BOOL checkCameraAttentionStatus(int idx, u32 flag) {
        return mCameraInfo[idx].mCameraAttentionStatus & flag;
    }

    ~dComIfG_play_c() {}

    dStage_roomControl_c* getRoomControl() { return &mRoomCtrl; }
    dStage_stageDt_c& getStage() { return mStageData; }
    dEvt_control_c& getEvent() { return mEvtCtrl; }
    dEvent_manager_c& getEvtManager() { return mEvtManager; }
    dPa_control_c* getParticle() { return mParticle; }
    dVibration_c& getVibration() { return mVibration; }
    dAttention_c& getAttention() { return mAttention; }
    dDetect_c& getDetect() { return mDetect; }
    dDemo_manager_c* getDemo() { return mDemo; }
    camera_class* getCamera(int idx) { return mCameraInfo[idx].mpCamera; }

    dMagma_packet_c* getMagma() { return mpMagmaPacket; }
    dGrass_packet_c* getGrass() { return mpGrassPacket; }
    dTree_packet_c* getTree() { return mpTreePacket; }
    dWood::Packet_c* getWood() { return mpWoodPacket; }
    dFlower_packet_c* getFlower() { return mpFlowerPacket; }

    const char* getStartStageName() { return mCurStage.getName(); }
    s8 getStartStageRoomNo() { return mCurStage.getRoomNo(); }
    s8 getStartStageLayer() { return mCurStage.getLayer(); }
    s16 getStartStagePoint() { return mCurStage.getPoint(); }
    void setStartStageLayer(s8 layer) { mCurStage.setLayer(layer); }
    void setStartStage(dStage_startStage_c* i_startStage) { mCurStage = *i_startStage; }
    dStage_startStage_c* getStartStage() { return &mCurStage; }

    const char* getNextStageName() { return mNextStage.getName(); }
    dStage_startStage_c* getNextStartStage() { return &mNextStage; }
    s8 getNextStageRoomNo() { return mNextStage.getRoomNo(); }
    s8 getNextStageLayer() { return mNextStage.getLayer(); }
    s16 getNextStagePoint() { return mNextStage.getPoint(); }
    s8 getNextStageWipe() { return mNextStage.getWipe(); }
    bool isEnableNextStage() { return mNextStage.isEnable(); }
    void offEnableNextStage() { mNextStage.offEnable(); }
    void setNextStage(const char* i_stageName, s8 i_roomNo, s16 i_point, s8 i_layer, s8 i_wipe) {
        mNextStage.set(i_stageName, i_roomNo, i_point, i_layer, i_wipe);
    }

    u8 getNowStageNum() { return mPlacenameIndex; }
    u8 checkStageName() { return mPlacenameState; }
    void setStageNameOn(u8 idx) {
        mPlacenameIndex = idx;
        mPlacenameState = 2;
    }
    void setStageNameOff() { mPlacenameState = 1; }

    fopAc_ac_c* getPlayerPtr(int idx) { return (fopAc_ac_c*)mpPlayerPtr[idx]; }
    fopAc_ac_c* getPlayer(int idx) { return (fopAc_ac_c*)mpPlayer[idx]; }
    void setPlayer(int idx, fopAc_ac_c* player) { mpPlayer[idx] = (daPy_py_c*)player; }
    void setPlayerPtr(int idx, fopAc_ac_c* playerPtr) { mpPlayerPtr[idx] = playerPtr; }
    s8 getPlayerCameraID(int idx) { return mCurCamera[idx]; }

    int getItemRupeeCount() { return mItemRupeeCount; }
    void setItemRupeeCount(s32 count) { mItemRupeeCount += count; }
    void setMessageCountNumber(s16 num) { mMsgCountNumber = num; }

    void setLkDemoAnmArchive(JKRArchive* i_arc) { mpLkDArc = i_arc; }
    void setStatus(u16 status) { mStatus = status; }
    void onStatus(u16 status) { mStatus |= status; }
    s32 checkStatus(u16 flags) { return flags & mStatus; }

    void setShipId(u8 i_id) { mShipId = i_id; }
    void setShipRoomId(u8 i_id) { mShipRoomId = i_id; }
    u8 getShipId() { return mShipId; }
    u8 getShipRoomId() { return mShipRoomId; }

    void setAgb(fopAc_ac_c* i_agb) { mpAgb = (daAgb_c*)i_agb; }
    daAgb_c* getAgb() { return mpAgb; }

    void setIkadaShipBeforePos(Vec& i_pos) { mIkadaLinkPos = i_pos; }
    void setIkadaShipId(u8 i_id) { mIkadaShipId = i_id; }
    void setIkadaShipBeforeRoomId(u8 i_roomId) { mIkadaShipBeforeRoomId = i_roomId; }
    u8 getIkadaShipId() { return mIkadaShipId; }
    u8 getIkadaShipBeforeRoomId() { return mIkadaShipBeforeRoomId; }

    dTimer_c* getTimerPtr() { return mTimerInfo.mTimerPtr; }
    s32 getTimerMode() { return mTimerInfo.mTimerMode; }
    
    s16 getItemMagicCount() { return mItemMagicCount; }
    void setItemMagicCount(s16 magic) { mItemMagicCount += magic; }
    s16 getItemMaxMagicCount() { return mItemMaxMagicCount; }
    void setItemMaxMagicCount(s16 magic) { mItemMaxMagicCount += magic; }

    void setItemBombNumCount(s16 num) { mItemBombNumCount += num; }

    f32 getItemLifeCount() { return mItemLifeCount; }
    void setItemLifeCount(f32 num) { mItemLifeCount += num; }
    
    s16 getItemMaxLifeCount() { return mItemMaxLifeCount; }
    void setItemMaxLifeCount(s16 num) { mItemMaxLifeCount += num; }
    
    s16 getItemArrowNumCount() { return mItemArrowNumCount; }
    void setItemArrowNumCount(s16 num) { mItemArrowNumCount += num; }

    void setItemKeyNumCount(s16 num) { mItemKeyNumCount += num; }

    void setItemBeastNumCount(int i_idx, s16 num) { mItemBeastNumCounts[i_idx] += num; }

    u8 checkMesgCancelButton() { return field_0x4949; }

    void setPlayerStatus(int param_0, int i, u32 flag) { mPlayerStatus[param_0][i] |= flag; }
    void clearPlayerStatus(int param_0, int i, u32 flag) { mPlayerStatus[param_0][i] &= ~flag; }
    bool checkPlayerStatus(int param_0, int i, u32 flag) { return flag & mPlayerStatus[param_0][i]; }

    u8 getSelectItem(int idx) { return mEquippedItems[idx]; }
    void setSelectItem(int idx, u8 itemNo) { mEquippedItems[idx] = itemNo; }
    
    void setAStatus(u8 status) { mCurrButtonBAction = status; }
    void setDoStatus(u8 status) { mCurrButtonAAction = status; }
    void setRStatusForce(u8 status) { field_0x4930 = status; }

    void setCurrentGrafPort(J2DOrthoGraph* i_graf) { mCurrentGrafPort = i_graf; }
    void setCurrentWindow(dDlst_window_c* i_window) { mCurrentWindow = i_window; }
    void setCurrentView(view_class* i_view) { mCurrentView = i_view; }
    void setCurrentViewport(view_port_class* i_viewport) { mCurrentViewport = i_viewport; }

    J2DOrthoGraph* getCurrentGrafPort() { return mCurrentGrafPort; }

    JKRExpHeap * getExpHeap2D() { return mpExpHeap2D; }

    inline u8 getHeapLockFlag() { return mHeapLockFlag; }
    inline void setHeapLockFlag(u8 flag) { mHeapLockFlag = flag; }
    inline void offHeapLockFlag() { mHeapLockFlag = 0; }

    void setMsgArchive(JKRArchive * pArc) { mpMsgArchive = pArc; }
    void setDmsgArchive(JKRArchive * pArc) { mpDmsgArchive = pArc; }
    void setTmsgArchive(JKRArchive * pArc) { mpTmsgArchive = pArc; }
    JKRArchive* getTmsgArchive() { return mpTmsgArchive; }
    void setMenuArchive(JKRArchive * pArc) { mpMenuArchive = pArc; }
    void setFont0Archive(JKRArchive * pArc) { mpFont0Archive = pArc; }
    void setFont1Archive(JKRArchive * pArc) { mpFont1Archive = pArc; }
    JKRArchive* getFontArchive() { return mpFont0Archive; }
    JKRArchive* getRubyArchive() { return mpFont1Archive; }
    void setAnmArchive(JKRArchive * pArc) { mpAnmArchive = pArc; }
    void setLkDArc(JKRArchive * pArc) { mpLkDArc = pArc; }
    void setFmapArchive(JKRArchive * pArc) { mpFmapArchive = pArc; }
    void setItemResArchive(JKRArchive * pArc) { mpItemResArchive = pArc; }
    void setClctResArchive(JKRArchive * pArc) { mpClctResArchive = pArc; }
    void setFmapResArchive(JKRArchive * pArc) { mpFmapResArchive = pArc; }
    void setDmapResArchive(JKRArchive * pArc) { mpDmapResArchive = pArc; }
    void setOptResArchive(JKRArchive * pArc) { mpOptResArchive = pArc; }
    void setClothResArchive(JKRArchive * pArc) { mpClothResArchive = pArc; }
    void setSaveResArchive(JKRArchive * pArc) { mpSaveResArchive = pArc; }
    void setItemIconArchive(JKRArchive * pArc) { mpItemIconArchive = pArc; }
    void setNameResArchive(JKRArchive * pArc) { mpNameResArchive = pArc; }
    void setErrorResArchive(JKRArchive * pArc) { mpErrorResArchive = pArc; }
    void setActionIconArchive(JKRArchive * pArc) { mpActionIconArchive = pArc; }
    void setScopeResArchive(JKRArchive * pArc) { mpScopeResArchive = pArc; }
    void setCamResArchive(JKRArchive * pArc) { mpCamResArchive = pArc; }
    void setSwimResArchive(JKRArchive * pArc) { mpSwimResArchive = pArc; }
    void setWindResArchive(JKRArchive * pArc) { mpWindResArchive = pArc; }
    void setFontArchive(JKRArchive * pArc) { mpFont0Archive = pArc; }
    void setMsgDtArchive(JKRArchive * pArc) { mpEnglishTextArchive = pArc; }
#if VERSION != VERSION_JPN
    void setMsgDt2Archive(JKRArchive * pArc) { mpHyruleTextArchive = pArc; }
#endif

    void setItemTable(void * pData) { mpItemTable = (ItemTableList*)pData; }
    ItemTableList* getItemTable() { return mpItemTable; }
    void setFmapData(void * pData) { mpFmapData = pData; }

    /* 0x0000 */ dBgS mBgS;
    /* 0x1404 */ dCcS mCcS;
    /* 0x3DF8 */ dADM mADM;
    /* 0x3E94 */ dStage_startStage_c mCurStage;
    /* 0x3EA0 */ dStage_nextStage_c mNextStage;
    /* 0x3EAE */ u8 field_0x3EAE[0x3EB0 - 0x3EAE];
    /* 0x3EB0 */ dStage_stageDt_c mStageData;
    /* 0x3F34 */ dStage_roomControl_c mRoomCtrl;
    /* 0x3F38 */ dEvt_control_c mEvtCtrl;
    /* 0x402C */ dEvent_manager_c mEvtManager;
    /* 0x4568 */ dAttention_c mAttention;
    /* 0x46F8 */ u8 field_0x46F8[0x4700 - 0x46F8];
    /* 0x4700 */ dVibration_c mVibration;
    /* 0x4784 */ dDetect_c mDetect;
    /* 0x4798 */ JKRArchive* mpMsgArchive;
    /* 0x479C */ JKRArchive* mpDmsgArchive;
    /* 0x47A0 */ JKRArchive* mpTmsgArchive;
    /* 0x47A4 */ JKRArchive* mpMenuArchive;
    /* 0x47A8 */ JKRArchive* mpFont0Archive;
    /* 0x47AC */ JKRArchive* mpFont1Archive;
    /* 0x47B0 */ JKRArchive* mpAnmArchive;
    /* 0x47B4 */ JKRArchive* mpLkDArc;
    /* 0x47B8 */ JKRArchive* mpFmapArchive;
    /* 0x47BC */ JKRArchive* mpItemResArchive;
    /* 0x47C0 */ JKRArchive* mpClctResArchive;
    /* 0x47C4 */ JKRArchive* mpFmapResArchive;
    /* 0x47C8 */ JKRArchive* mpDmapResArchive;
    /* 0x47CC */ JKRArchive* mpOptResArchive;
    /* 0x47D0 */ JKRArchive* mpClothResArchive;
    /* 0x47D4 */ JKRArchive* mpSaveResArchive;
    /* 0x47D8 */ JKRArchive* mpItemIconArchive;
    /* 0x47DC */ JKRArchive* mpNameResArchive;
    /* 0x47E0 */ JKRArchive* mpErrorResArchive;
    /* 0x47E4 */ JKRArchive* mpActionIconArchive;
    /* 0x47E8 */ JKRArchive* mpScopeResArchive;
    /* 0x47EC */ JKRArchive* mpCamResArchive;
    /* 0x47F0 */ JKRArchive* mpSwimResArchive;
    /* 0x47F4 */ JKRArchive* mpWindResArchive;
    /* 0x47F8 */ JKRArchive* mpEnglishTextArchive;
#if VERSION != VERSION_JPN
    /* 0x47FC */ JKRArchive* mpHyruleTextArchive;
    /* 0x4800 */ JKRAramBlock* mAramHeap0[3];
    /* 0x480C */ JKRAramBlock* mAramHeap1[4];
    /* 0x481C */ JKRAramBlock* field_0x481c;
    /* 0x4820 */ JKRAramBlock* field_0x4820;
#else
    /* 0x47FC */ JKRAramBlock* mAramHeap0[3];
    /* 0x480C */ JKRAramBlock* mAramHeap1[4];
#endif
    /* Offsets below are for USA/PAL */

    /* 0x4824 */ dPa_control_c* mParticle;
    /* 0x4828 */ dDemo_manager_c* mDemo;
    /* 0x482C */ dMagma_packet_c* mpMagmaPacket;
    /* 0x4830 */ dGrass_packet_c* mpGrassPacket;
    /* 0x4834 */ dTree_packet_c* mpTreePacket;
    /* 0x4838 */ dWood::Packet_c* mpWoodPacket;
    /* 0x483C */ dFlower_packet_c* mpFlowerPacket;
    /* 0x4840 */ s8 mLkDArcIdx;
    /* 0x4841 */ u8 field_0x4841;
    /* 0x4842 */ u16 mStatus;
    /* 0x4844 */ dDlst_window_c mDlstWindow[1];
    /* 0x4870 */ dComIfG_camera_info_class mCameraInfo[1];
    /* 0x48A4 */ daPy_py_c* mpPlayer[1];
    /* 0x48A8 */ s8 mCurCamera[1];
    /* 0x48A9 */ u8 field_0x48A9[0x48AC - 0x48A9];
    /* 0x48AC */ fopAc_ac_c* mpPlayerPtr[3];  // 0: Link, 1: Partner, 2: Ship
    /* 0x48B8 */ f32 field_0x48b8;
    /* 0x48BC */ f32 mItemLifeCount;
    /* 0x48C0 */ int mItemRupeeCount;
    /* 0x48C4 */ int mAirMeter;
    /* 0x48C8 */ int field_0x48c8;
    /* 0x48CC */ int mNpcNameMessageID;
    /* 0x48D0 */ int mItemNameMessageID;
    /* 0x48D4 */ s16 mItemKeyNumCount;
    /* 0x48D6 */ s16 mItemMaxLifeCount;
    /* 0x48D8 */ s16 mItemMagicCount;
    /* 0x48DA */ s16 field_0x48da;
    /* 0x48DC */ s16 mItemMaxMagicCount;
    /* 0x48DE */ s16 field_0x48de;
    /* 0x48E0 */ s16 mItemArrowNumCount;
    /* 0x48E2 */ s16 field_0x48e2;
    /* 0x48E4 */ s16 mItemBombNumCount;
    /* 0x48E6 */ s16 field_0x48e6;
    /* 0x48E8 */ s16 mItemBeastNumCounts[8];
    /* 0x48F8 */ u8 field_0x48F8[0x4918 - 0x48F8];
    /* 0x4918 */ u16 mMsgCountNumber;
    /* 0x491A */ s16 field_0x491a;
    /* 0x491C */ s16 field_0x491c;
    /* 0x491E */ s16 field_0x491e;
    /* 0x4920 */ s16 field_0x4920;
    /* 0x4922 */ s16 field_0x4922;
    /* 0x4924 */ s16 mCurrHP;
    /* 0x4926 */ s16 mRupyCountDisplay;
    /* 0x4928 */ u8 field_0x4928;
    /* 0x4929 */ u8 field_0x4929;
    /* 0x492A */ u8 field_0x492a;
    /* 0x492B */ u8 mbCamOverrideFarPlane;
    /* 0x492C */ u8 field_0x492c;
    /* 0x492D */ u8 field_0x492d;
    /* 0x492E */ u8 mCurrButtonBAction;
    /* 0x492F */ u8 mCurrButtonAAction;
    /* 0x4930 */ u8 field_0x4930;
    /* 0x4931 */ u8 field_0x4931;
    /* 0x4932 */ u8 field_0x4932;
    /* 0x4933 */ u8 mEquippedItems[4];
    /* 0x4937 */ u8 field_0x4937[4];
    /* 0x493B */ u8 mMesgAnime;
    /* 0x493C */ u8 mMesgAnimeTagInfo;
    /* 0x493D */ u8 field_0x493d;
    /* 0x493E */ u8 field_0x493e;
    /* 0x493F */ u8 field_0x493f;
    /* 0x4940 */ u8 field_0x4940;
    /* 0x4941 */ u8 field_0x4941;
    /* 0x4942 */ u8 field_0x4942;
    /* 0x4943 */ u8 field_0x4943;
    /* 0x4944 */ u8 field_0x4944;
    /* 0x4945 */ u8 field_0x4945;
    /* 0x4946 */ u8 field_0x4946;
    /* 0x4947 */ u8 field_0x4947;
    /* 0x4948 */ u8 field_0x4948;
    /* 0x4949 */ u8 field_0x4949;
    /* 0x494A */ u8 field_0x494a[6];
    /* 0x4950 */ u8 mTactMode;
    /* 0x4951 */ u8 field_0x4951;
    /* 0x4952 */ u8 field_0x4952;
    /* 0x4953 */ u8 field_0x4953;
    /* 0x4954 */ u8 field_0x4954;
    /* 0x4955 */ u8 field_0x4955;
    /* 0x4956 */ u8 field_0x4956;
    /* 0x4957 */ u8 mPlacenameIndex;
    /* 0x4958 */ u8 mPlacenameState;
    /* 0x4959 */ u8 field_0x4959;
    /* 0x495A */ u8 field_0x495a;
    /* 0x495B */ u8 field_0x495b;
    /* 0x495C */ u8 field_0x495c;
    /* 0x495D */ u8 field_0x495d;
    /* 0x495E */ u8 field_0x495e;
    /* 0x495F */ u8 field_0x495f;
    /* 0x4960 */ u8 field_0x4960;
    /* 0x4961 */ u8 field_0x4961;
    /* 0x4962 */ u8 mHeapLockFlag;
    /* 0x4963 */ u8 field_0x4963;
    /* 0x4964 */ u8 mGameLanguage;
    /* 0x4965 */ u8 field_0x4965;
    /* 0x4966 */ char field_0x4966[1];
    /* 0x4967 */ u8 field_0x4967[0x4977 - 0x4967];
    /* 0x4977 */ u8 field_0x4977;
    /* 0x4978 */ u8 field_0x4978;
    /* 0x4979 */ u8 field_0x4979;
    /* 0x497A */ u8 field_0x497a;
    /* 0x497B */ u8 field_0x497B[0x497C - 0x497B];
    /* 0x497C */ JKRExpHeap* mpExpHeap2D;
    /* 0x4980 */ int mMesgCameraTagInfo;
    /* 0x4984 */ int field_0x4984;
    /* 0x4988 */ int field_0x4988[10];
    /* 0x49B0 */ u8 field_0x49B0[0x4A24 - 0x49B0];
    /* 0x4A24 */ daAgb_c* mpAgb;
    /* 0x4A28 */ u32 mPlayerStatus[2][2];
    /* 0x4A38 */ u8 field_0x4A38[0x4A3A - 0x4A38];
    /* 0x4A3A */ u8 mMiniGameType;
    /* 0x4A3B */ u8 field_0x4A3B[0x4A40 - 0x4A3B];
    /* 0x4A40 */ __d_timer_info_c mTimerInfo;
    /* 0x4A54 */ dDlst_window_c* mCurrentWindow;
    /* 0x4A58 */ view_class* mCurrentView;
    /* 0x4A5C */ view_port_class* mCurrentViewport;
    /* 0x4A60 */ J2DOrthoGraph* mCurrentGrafPort;
    /* 0x4A64 */ u8 mShipId;
    /* 0x4A65 */ u8 mShipRoomId;
    /* 0x4A66 */ u8 mIkadaShipBeforeRoomId;
    /* 0x4A67 */ u8 mIkadaShipId;
    /* 0x4A68 */ cXyz mIkadaLinkPos;
    /* 0x4A74 */ ItemTableList* mpItemTable;
    /* 0x4A78 */ void* mpFmapData;
};

class dComIfG_inf_c {
public:
    dComIfG_inf_c() { ct(); }
    ~dComIfG_inf_c() {}

    void ct();

    /* 0x00000 */ dSv_info_c save;
    /* 0x012A0 */ dComIfG_play_c play;
    /* 0x05D1C */ dDlst_list_c drawlist;
    /* 0x1BF50 */ u8 field_0x1BF50[0x1BFC0 - 0x1BF50];
    /* 0x1BFC0 */ dRes_control_c mResControl;
    /* 0x1D1C0 */ u8 field_0x1d1c0;
    /* 0x1D1C1 */ u8 field_0x1d1c1;
};

#if VERSION != VERSION_JPN
STATIC_ASSERT(sizeof(dComIfG_inf_c) == 0x1D1C8);
#endif

extern dComIfG_inf_c g_dComIfG_gameInfo;

extern JUtility::TColor g_clearColor;
extern JUtility::TColor g_blackColor;
extern JUtility::TColor g_whiteColor;
extern JUtility::TColor g_saftyWhiteColor;

/**
 * === SAVE ===
 */

u8 dComIfGs_checkGetItem(u8);

inline void dComIfGs_init() {
    g_dComIfG_gameInfo.save.init();
}

inline dSv_player_bag_item_c* dComIfGs_getpBagItem() {
    return g_dComIfG_gameInfo.save.getPlayer().getpBagItem();
}

inline u8 dComIfGs_checkReserveItem(u8 i_itemNo) {
    return dComIfGs_getpBagItem()->checkReserveItem(i_itemNo);
}

inline void dComIfGs_initZone() {
    g_dComIfG_gameInfo.save.initZone();
}

inline u32 dComIfGs_createZone(int i_roomNo) {
    return g_dComIfG_gameInfo.save.createZone(i_roomNo);
}

inline u8 dComIfGs_getSelectEquip(int param_0) {
