#ifndef D_COM_D_COM_INF_GAME_H
#define D_COM_D_COM_INF_GAME_H

#include "JSystem/JUtility/TColor.h"
#include "d/d_attention.h"
#include "d/d_bg_s.h"
#include "d/d_cc_s.h"
#include "d/d_detect.h"
#include "d/d_drawlist.h"
#include "d/d_event.h"
#include "d/d_event_manager.h"
#include "d/d_map.h"
#include "d/d_particle.h"
#include "d/d_resorce.h"
#include "d/d_save.h"
#include "d/d_stage.h"
#include "d/d_vibration.h"
#include "d/d_demo.h"
#include "d/d_timer.h"
#include "d/res/res_always.h"
#include "SSystem/SComponent/c_data_tbl.h"

class JKRArchive;
class JKRAramBlock;
class JKRExpHeap;
class dMagma_packet_c;
class dGrass_packet_c;
class dTree_packet_c;
class dFlower_packet_c;
namespace dWood { class Packet_c; };
class daPy_py_c;
class daPy_lk_c;
class daShip_c;
class daAgb_c;
class camera_class;
class J2DOrthoGraph;

enum daPy__PlayerStatus0 {
    daPyStts0_UNK1_e           = 0x00000001,
    daPyStts0_UNK10_e          = 0x00000010,
    daPyStts0_UNK100_e         = 0x00000100,
    daPyStts0_BOW_AIM_e        = 0x00001000,
    daPyStts0_SWORD_SWING_e    = 0x00008000,
    daPyStts0_SHIP_RIDE_e      = 0x00010000,
    daPyStts0_BOOMERANG_AIM_e  = 0x00080000,
    daPyStts0_SWIM_e           = 0x00100000,
    daPyStts0_TELESCOPE_LOOK_e = 0x00200000,
    daPyStts0_BOOMERANG_WAIT_e = 0x00400000,
    daPyStts0_UNK2000000_e     = 0x02000000,
    daPyStts0_CRAWL_e          = 0x08000000,
    daPyStts0_UNK20000000_e    = 0x20000000,
    daPyStts0_SPIN_ATTACK_e    = 0x40000000,
};

enum daPy__PlayerStatus1 {
    daPyStts1_WIND_WAKER_CONDUCT_e = 0x00000001,
    daPyStts1_PICTO_BOX_AIM_e      = 0x00000008,
    daPyStts1_DEKU_LEAF_FLY_e      = 0x00000020,
    daPyStts1_DEKU_LEAF_FAN_e      = 0x00000040,
    daPyStts1_SAIL_e               = 0x00000400,
    daPyStts1_UNK8000_e            = 0x00008000,
    daPyStts1_UNK40000_e           = 0x00040000,
};

class __d_timer_info_c {
public:
    __d_timer_info_c() {
        mTimerMode = -1;
        mTimerLimitTimeMs = 0;
        mTimerNowTimeMs = 0;
        mTimerPtr = NULL;
    }

    /* 0x00 */ dTimer_c* mTimerPtr;
    /* 0x04 */ int mTimerNowTimeMs;
    /* 0x08 */ int mTimerLimitTimeMs;
    /* 0x0C */ int mTimerMode;
    /* 0x10 */ u16 mWaveFrame;
};

class dADM_CharTbl : public cDT {
public:
    s32 GetNITEM0()  { return mIndex_N_ITEM0; }
    s32 GetNITEM1()  { return mIndex_N_ITEM1; }
    s32 GetNITEM2()  { return mIndex_N_ITEM2; }
    s32 GetNITEM3()  { return mIndex_N_ITEM3; }
    s32 GetNITEM4()  { return mIndex_N_ITEM4; }
    s32 GetNITEM5()  { return mIndex_N_ITEM5; }
    s32 GetNITEM6()  { return mIndex_N_ITEM6; }
    s32 GetNITEM7()  { return mIndex_N_ITEM7; }
    s32 GetNITEM8()  { return mIndex_N_ITEM8; }
    s32 GetNITEM9()  { return mIndex_N_ITEM9; }
    s32 GetNITEM10() { return mIndex_N_ITEM10; }
    s32 GetNITEM11() { return mIndex_N_ITEM11; }
    s32 GetNITEM12() { return mIndex_N_ITEM12; }
    s32 GetNITEM13() { return mIndex_N_ITEM13; }
    s32 GetNITEM14() { return mIndex_N_ITEM14; }
    s32 GetNITEM15() { return mIndex_N_ITEM15; }
    s32 GetPercent() { return mIndex_percent; }
    s32 GetITEM0() { return mIndex_ITEM0; }
    s32 GetITEM1() { return mIndex_ITEM1; }
    s32 GetITEM2() { return mIndex_ITEM2; }
    s32 GetITEM3() { return mIndex_ITEM3; }
    s32 GetITEM4() { return mIndex_ITEM4; }
    s32 GetITEM5() { return mIndex_ITEM5; }
    s32 GetITEM6() { return mIndex_ITEM6; }
    s32 GetITEM7() { return mIndex_ITEM7; }

private:
    /* 0x28 */ s32 mIndex_ARG;
    /* 0x2C */ s32 mIndex_N_ITEM0;
    /* 0x30 */ s32 mIndex_N_ITEM1;
    /* 0x34 */ s32 mIndex_N_ITEM2;
    /* 0x38 */ s32 mIndex_N_ITEM3;
    /* 0x3C */ s32 mIndex_N_ITEM4;
    /* 0x40 */ s32 mIndex_N_ITEM5;
    /* 0x44 */ s32 mIndex_N_ITEM6;
    /* 0x48 */ s32 mIndex_N_ITEM7;
    /* 0x4C */ s32 mIndex_N_ITEM8;
    /* 0x50 */ s32 mIndex_N_ITEM9;
    /* 0x54 */ s32 mIndex_N_ITEM10;
    /* 0x58 */ s32 mIndex_N_ITEM11;
    /* 0x5C */ s32 mIndex_N_ITEM12;
    /* 0x60 */ s32 mIndex_N_ITEM13;
    /* 0x64 */ s32 mIndex_N_ITEM14;
    /* 0x68 */ s32 mIndex_N_ITEM15;
    /* 0x6C */ s32 mIndex_percent;
    /* 0x70 */ s32 mIndex_ITEM0;
    /* 0x74 */ s32 mIndex_ITEM1;
    /* 0x78 */ s32 mIndex_ITEM2;
    /* 0x7C */ s32 mIndex_ITEM3;
    /* 0x80 */ s32 mIndex_ITEM4;
    /* 0x84 */ s32 mIndex_ITEM5;
    /* 0x88 */ s32 mIndex_ITEM6;
    /* 0x8C */ s32 mIndex_ITEM7;
};
STATIC_ASSERT(sizeof(dADM_CharTbl) == 0x90);

class dADM {
public:
    /* 0x00 */ int mBlockCount;
    /* 0x04 */ void* mpData;
    /* 0x08 */ dADM_CharTbl mCharTbl;

public:
    dADM();
    void FindTag(u32, u32*, u32*);
    void SetData(void*);

    virtual ~dADM();
};

class dComIfG_camera_info_class {
public:
    dComIfG_camera_info_class() {}
    ~dComIfG_camera_info_class() {}

    /* 0x00 */ camera_class* mpCamera;
    /* 0x04 */ u8 mDlstWindowIdx;
    /* 0x05 */ u8 mCamIdx;
    /* 0x06 */ s8 field_0x06;
    /* 0x07 */ u8 field_0x07;
    /* 0x08 */ u32 mCameraAttentionStatus;
    /* 0x0C */ f32 mCameraZoomScale;
    /* 0x10 */ f32 mCameraZoomForcus;
    /* 0x14 */ u8 field_0x14[0x34 - 0x14];
};
STATIC_ASSERT(sizeof(dComIfG_camera_info_class) == 0x34);

// This is /res/ItemTable/item_table.bin
// The real name of this struct is not currently known, this is a fake name.
struct ItemTableList {
    u8 mMagic[0xA]; // "ITEM_TABLE"
    short mEntryCount; // 0x1E
    u32 mPadding;
    u8 mItemTables[0x1E][0x10];
};

class dComIfG_play_c {
public:
#if VERSION == VERSION_JPN
    dComIfG_play_c();
#else
    dComIfG_play_c() { ct(); }
    void ct();
#endif

    void init();
    void itemInit();
    static int getLayerNo(int i_roomNo);
    void createParticle();
    void createDemo();
    void removeDemo();
    void executeEvtManager();
    dMagma_packet_c* createMagma();
    void removeMagma();
    void executeMagma();
    void drawMagma();
    dGrass_packet_c* createGrass();
    void removeGrass();
    void executeGrass();
    void drawGrass();
    dFlower_packet_c* createFlower();
    void removeFlower();
    void executeFlower();
    void drawFlower();
    dTree_packet_c* createTree();
    void removeTree();
    void executeTree();
    void drawTree();
    dWood::Packet_c* createWood();
    void removeWood();
    void executeWood();
    void drawWood();

    BOOL checkCameraAttentionStatus(int idx, u32 flag) {
        return mCameraInfo[idx].mCameraAttentionStatus & flag;
    }

    ~dComIfG_play_c() {}

    dStage_roomControl_c* getRoomControl() { return &mRoomCtrl; }
    dStage_stageDt_c& getStage() { return mStageData; }
    dEvt_control_c& getEvent() { return mEvtCtrl; }
    dEvent_manager_c& getEvtManager() { return mEvtManager; }
    dPa_control_c* getParticle() { return mParticle; }
    dVibration_c& getVibration() { return mVibration; }
    dAttention_c& getAttention() { return mAttention; }
    dDetect_c& getDetect() { return mDetect; }
    dDemo_manager_c* getDemo() { return mDemo; }
    camera_class* getCamera(int idx) { return mCameraInfo[idx].mpCamera; }
    f32 getCamZoomForcus(int idx) { return mCameraInfo[idx].mCameraZoomForcus; }

    dMagma_packet_c* getMagma() { return mpMagmaPacket; }
    dGrass_packet_c* getGrass() { return mpGrassPacket; }
    dTree_packet_c* getTree() { return mpTreePacket; }
    dWood::Packet_c* getWood() { return mpWoodPacket; }
    dFlower_packet_c* getFlower() { return mpFlowerPacket; }

    const char* getStartStageName() { return mCurStage.getName(); }
    s8 getStartStageRoomNo() { return mCurStage.getRoomNo(); }
    s8 getStartStageLayer() { return mCurStage.getLayer(); }
    s16 getStartStagePoint() { return mCurStage.getPoint(); }
    void setStartStageLayer(s8 layer) { mCurStage.setLayer(layer); }
    void setStartStage(dStage_startStage_c* i_startStage) { mCurStage = *i_startStage; }
    dStage_startStage_c* getStartStage() { return &mCurStage; }

    const char* getNextStageName() { return mNextStage.getName(); }
    dStage_startStage_c* getNextStartStage() { return &mNextStage; }
    s8 getNextStageRoomNo() { return mNextStage.getRoomNo(); }
    s8 getNextStageLayer() { return mNextStage.getLayer(); }
    s16 getNextStagePoint() { return mNextStage.getPoint(); }
    s8 getNextStageWipe() { return mNextStage.getWipe(); }
    bool isEnableNextStage() { return mNextStage.isEnable(); }
    void offEnableNextStage() { mNextStage.offEnable(); }
    void setNextStage(const char* i_stageName, s8 i_roomNo, s16 i_point, s8 i_layer, s8 i_wipe) {
        mNextStage.set(i_stageName, i_roomNo, i_point, i_layer, i_wipe);
    }

    u8 getNowStageNum() { return mPlacenameIndex; }
    u8 checkStageName() { return mPlacenameState; }
    void setStageNameOn(u8 idx) {
        mPlacenameIndex = idx;
        mPlacenameState = 2;
    }
    void setStageNameDelete() { mPlacenameState = 0; }
    void setStageNameOff() { mPlacenameState = 1; }

    void setGameoverStatus(u8 stts) { mGameoverStatus = stts; }

    fopAc_ac_c* getPlayerPtr(int idx) { return (fopAc_ac_c*)mpPlayerPtr[idx]; }
    fopAc_ac_c* getPlayer(int idx) { return (fopAc_ac_c*)mpPlayer[idx]; }
    void setPlayer(int idx, fopAc_ac_c* player) { mpPlayer[idx] = (daPy_py_c*)player; }
    void setPlayerPtr(int idx, fopAc_ac_c* playerPtr) { mpPlayerPtr[idx] = playerPtr; }
    s8 getPlayerCameraID(int idx) { return mCurCamera[idx]; }
    void setPlayerInfo(int idx, fopAc_ac_c* player, int cam) {
        mpPlayer[idx] = (daPy_py_c*)player;
        mCurCamera[idx] = cam;
    }
    
    int getMessageRupee() { return mMessageRupee; }

    int getItemRupeeCount() { return mItemRupeeCount; }
    void setItemRupeeCount(s32 count) { mItemRupeeCount += count; }
    void setMessageCountNumber(s16 num) { mMsgCountNumber = num; }

    void setMessageSetNumber(s16 num) { mMsgSetNumber = num; }
    s16 getMessageSetNumber() { return mMsgSetNumber; }

    s16 getMiniGameRupee() { return mMiniGameRupee; }
    void setMiniGameRupee(s16 count) { mMiniGameRupee = count; }
    void plusMiniGameRupee(s16 count) {
        if(mMiniGameRupee + count > 0) {
            mMiniGameRupee += count;
        }
        else {
            mMiniGameRupee = 0;
        }
    }

    JKRArchive* getLkDemoAnmArchive() { return mpLkDArc; }
    void setLkDemoAnmArchive(JKRArchive* i_arc) { mpLkDArc = i_arc; }
    s8 getLkDemoAnmNo() { return mLkDArcIdx; }
    void setLkDemoAnmNo(s8 idx) { mLkDArcIdx = idx; }
    void setStatus(u16 status) { mStatus = status; }
    void onStatus(u16 status) { mStatus |= status; }
    s32 checkStatus(u16 flags) { return flags & mStatus; }

    void setShipId(u8 i_id) { mShipId = i_id; }
    void setShipRoomId(u8 i_id) { mShipRoomId = i_id; }
    u8 getShipId() { return mShipId; }
    u8 getShipRoomId() { return mShipRoomId; }

    u8* getPlayerInfoBuffer() { return mPlayerInfoBuffer; }
    void setPlayerInfoBufferStageNo(u8 i_stageno) { mPlayerInfoBufferStageNo = i_stageno; }
    u8 getPlayerInfoBufferStageNo() { return mPlayerInfoBufferStageNo; }

    void setAgb(fopAc_ac_c* i_agb) { mpAgb = (daAgb_c*)i_agb; }
    daAgb_c* getAgb() { return mpAgb; }

    void setIkadaShipBeforePos(Vec& i_pos) { mIkadaLinkPos = i_pos; }
    void setIkadaShipId(u8 i_id) { mIkadaShipId = i_id; }
    void setIkadaShipBeforeRoomId(u8 i_roomId) { mIkadaShipBeforeRoomId = i_roomId; }
    u8 getIkadaShipId() { return mIkadaShipId; }
    u8 getIkadaShipBeforeRoomId() { return mIkadaShipBeforeRoomId; }

    void setTimerPtr(dTimer_c* timer) { mTimerInfo.mTimerPtr = timer; }
    dTimer_c* getTimerPtr() { return mTimerInfo.mTimerPtr; }
    void setTimerMode(int mode) { mTimerInfo.mTimerMode = mode; }
    int getTimerMode() { return mTimerInfo.mTimerMode; }
    void setTimerNowTimeMs(int ms) { mTimerInfo.mTimerNowTimeMs = ms; }
    int getTimerNowTimeMs() { return mTimerInfo.mTimerNowTimeMs; }
    void setTimerLimitTimeMs(int ms) { mTimerInfo.mTimerLimitTimeMs = ms; }
    int getTimerLimitTimeMs() { return mTimerInfo.mTimerLimitTimeMs; }
    void setWaveFrame(u16 frame) { mTimerInfo.mWaveFrame = frame; }
    u16 getWaveFrame() { return mTimerInfo.mWaveFrame; }

    s16 getItemMagicCount() { return mItemMagicCount; }
    void setItemMagicCount(s16 magic) { mItemMagicCount += magic; }
    s16 getItemMaxMagicCount() { return mItemMaxMagicCount; }
    void setItemMaxMagicCount(s16 magic) { mItemMaxMagicCount += magic; }

    void setItemBombNumCount(s16 num) { mItemBombNumCount += num; }

    f32 getItemLifeCount() { return mItemLifeCount; }
    void setItemLifeCount(f32 num) { mItemLifeCount += num; }

    s16 getItemMaxLifeCount() { return mItemMaxLifeCount; }
    void setItemMaxLifeCount(s16 num) { mItemMaxLifeCount += num; }

    s16 getItemArrowNumCount() { return mItemArrowNumCount; }
    void setItemArrowNumCount(s16 num) { mItemArrowNumCount += num; }

    void setItemKeyNumCount(s16 num) { mItemKeyNumCount += num; }

    void setItemBeastNumCount(int i_idx, s16 num) { mItemBeastNumCounts[i_idx] += num; }
    s16 getItemBeastNumCount(int i_idx) { return mItemBeastNumCounts[i_idx]; }

    void setItemTimeCount(s32 time) { mAirMeter = time; }
    void setItemTimeMax(s32 time) { field_0x4928 = time; }

    u8 checkMesgSendButton() { return mMesgSendButton; }
    u8 checkMesgCancelButton() { return mMesgCancelButton; }

    void setPlayerStatus(int param_0, int i, u32 flag) { mPlayerStatus[param_0][i] |= flag; }
    void clearPlayerStatus(int param_0, int i, u32 flag) { mPlayerStatus[param_0][i] &= ~flag; }
    bool checkPlayerStatus(int param_0, int i, u32 flag) { return flag & mPlayerStatus[param_0][i]; }

    u8 getSelectItem(int idx) { return mSelectItem[idx]; }
    void setSelectItem(int idx, u8 itemNo) { mSelectItem[idx] = itemNo; }
    void setSelectEquip(int idx, u8 itemNo) { mSelectEquip[idx] = itemNo; }

    void setItem(u8 i_slot, u8 i_itemNo) {
        mItemSlot = i_slot;
        mItemNo = i_itemNo;
    }

    u8 getAStatus() { return mCurrButtonBAction; }
    void setAStatus(u8 status) { mCurrButtonBAction = status; }
    u8 getDoStatus() { return mCurrButtonAAction; }
    void setDoStatus(u8 status) { mCurrButtonAAction = status; }
    void setRStatus(u8 status) { field_0x492d = status; }
    u8 getRStatusForce() { return field_0x4930; }
    void setRStatusForce(u8 status) { field_0x4930 = status; }
    u8 getAStatusForce() { return field_0x4931; }
    void setAStatusForce(u8 value) { field_0x4931 = value; }
    u8 getDoStatusForce() { return field_0x4932; }
    void setDoStatusForce(u8 value) { field_0x4932 = value; }
    u8 getPictureStatus() { return mPictureStatus; }
    void setPictureStatusOn() { mPictureStatus = 2; }

    u8 getScopeType() { return mbCamOverrideFarPlane; }
    void setScopeType(u8 v) { mbCamOverrideFarPlane = v; }
    void setCameraInfo(int idx, camera_class* camera_p, int dlst_window_idx, int cam_idx, int p5) {
        mCameraInfo[idx].mpCamera = camera_p;
        mCameraInfo[idx].mDlstWindowIdx = dlst_window_idx;
        mCameraInfo[idx].mCamIdx = cam_idx;
        mCameraInfo[idx].field_0x06 = p5;
        setCameraAttentionStatus(0, 0);
    }
    void setCameraAttentionStatus(int idx, u32 stts) {
        mCameraInfo[idx].mCameraAttentionStatus = stts;
    }
    void setCurrentGrafPort(J2DOrthoGraph* i_graf) { mCurrentGrafPort = i_graf; }
    void setCurrentWindow(dDlst_window_c* i_window) { mCurrentWindow = i_window; }
    void setCurrentView(view_class* i_view) { mCurrentView = i_view; }
    void setCurrentViewport(view_port_class* i_viewport) { mCurrentViewport = i_viewport; }
    s32 getWindowNum() { return mDlstWindowNum; }
    void setWindowNum(u8 num) { mDlstWindowNum = num; }
    dDlst_window_c * getWindow(int idx) { return &mDlstWindow[idx]; }
    void setWindow(int idx, f32 x, f32 y, f32 w, f32 h, f32 n, f32 f, int cameraID, int mode) {
        mDlstWindow[idx].setViewPort(x, y, w, h, n, f);
        mDlstWindow[idx].setScissor(x, y, w, h);
        mDlstWindow[idx].setCameraID(cameraID);
        mDlstWindow[idx].setMode(mode);
    }

    J2DOrthoGraph* getCurrentGrafPort() { return mCurrentGrafPort; }

    JKRExpHeap* getExpHeap2D() { return mpExpHeap2D; }
    void setExpHeap2D(void* heap) { mpExpHeap2D = (JKRExpHeap*)heap; }

    inline u8 isHeapLockFlag() { return mHeapLockFlag; }
    inline void setHeapLockFlag(u8 flag) { mHeapLockFlag = flag; }
    inline void offHeapLockFlag() { mHeapLockFlag = 0; }

    void setMsgArchive(JKRArchive * pArc) { mpMsgArchive = pArc; }
    void setDmsgArchive(JKRArchive * pArc) { mpDmsgArchive = pArc; }
    void setTmsgArchive(JKRArchive * pArc) { mpTmsgArchive = pArc; }
    JKRArchive* getTmsgArchive() { return mpTmsgArchive; }
    void setMenuArchive(JKRArchive * pArc) { mpMenuArchive = pArc; }
    JKRArchive* getMenuArchive() { return mpMenuArchive; }
    void setFont0Archive(JKRArchive * pArc) { mpFont0Archive = pArc; }
    void setFont1Archive(JKRArchive * pArc) { mpFont1Archive = pArc; }
    JKRArchive* getFontArchive() { return mpFont0Archive; }
    JKRArchive* getRubyArchive() { return mpFont1Archive; }
    void setAnmArchive(JKRArchive * pArc) { mpAnmArchive = pArc; }
    JKRArchive* getAnmArchive() { return mpAnmArchive; }
    void setLkDArc(JKRArchive * pArc) { mpLkDArc = pArc; }
    void setFmapArchive(JKRArchive * pArc) { mpFmapArchive = pArc; }
    void setItemResArchive(JKRArchive * pArc) { mpItemResArchive = pArc; }
    void setClctResArchive(JKRArchive * pArc) { mpClctResArchive = pArc; }
    void setFmapResArchive(JKRArchive * pArc) { mpFmapResArchive = pArc; }
    void setDmapResArchive(JKRArchive * pArc) { mpDmapResArchive = pArc; }
    void setOptResArchive(JKRArchive * pArc) { mpOptResArchive = pArc; }
    JKRArchive* getClothResArchive() { return mpClothResArchive; }
    void setClothResArchive(JKRArchive * pArc) { mpClothResArchive = pArc; }
    void setSaveResArchive(JKRArchive * pArc) { mpSaveResArchive = pArc; }
    void setItemIconArchive(JKRArchive * pArc) { mpItemIconArchive = pArc; }
    JKRArchive* getItemIconArchive() { return mpItemIconArchive; }
    void setNameResArchive(JKRArchive * pArc) { mpNameResArchive = pArc; }
    void setErrorResArchive(JKRArchive * pArc) { mpErrorResArchive = pArc; }
    void setActionIconArchive(JKRArchive * pArc) { mpActionIconArchive = pArc; }
    void setScopeResArchive(JKRArchive * pArc) { mpScopeResArchive = pArc; }
    void setCamResArchive(JKRArchive * pArc) { mpCamResArchive = pArc; }
    void setSwimResArchive(JKRArchive * pArc) { mpSwimResArchive = pArc; }
    void setWindResArchive(JKRArchive * pArc) { mpWindResArchive = pArc; }
    void setFontArchive(JKRArchive * pArc) { mpFont0Archive = pArc; }
    void setMsgDtArchive(JKRArchive * pArc) { mpEnglishTextArchive = pArc; }
#if VERSION != VERSION_JPN
    void setMsgDt2Archive(JKRArchive * pArc) { mpHyruleTextArchive = pArc; }
#endif

    void setItemTable(void * pData) { mpItemTable = (ItemTableList*)pData; }
    ItemTableList* getItemTable() { return mpItemTable; }
    void setFmapData(void * pData) { mpFmapData = pData; }

    void setPictureBoxData(JKRAramBlock* aramHeap, int i) { mPictureBoxDataHeap[i] = aramHeap; }
    void offPictureFlag(u8 i) {
        u8 mask = (1 << i);
        mPictureFlag &= ~mask;
    }
    void setBossBattleData(JKRAramBlock* aramHeap, int i) { mBossBattleDataHeap[i] = aramHeap; }

    void stopFwaterTimer() { mFwaterTimer = 0; }
    u8 checkFwaterTimer() { return mFwaterTimer; }

    u8 getMiniGameType() { return mMiniGameType; }

    void endMiniGame(u16 param_1) {
        mMiniGameType = 0;
        field_0x4A38 ^= 1 << (param_1 - 1); // toggle Nth bit
        field_0x4A3E = 0;
    }

    void show2dOn() { m2dShow = true; }
    void show2dOff() { m2dShow = false; }
    bool show2dCheck() { return m2dShow; }

    u8 getMelodyNum() { return mMelodyNum; }
    void setMelodyNum(u8 melody) { mMelodyNum = melody; }

    u8 getBaseAnimeID() { return mMesgAnime; }
    void clearBaseAnimeID() { mMesgAnime = 0xFF; }
    u8 getNowAnimeID() { return mMesgAnimeTagInfo; }
    void clearNowAnimeID() { mMesgAnimeTagInfo = 0xFF; }

    u8 getButtonMode() { return mButtonMode; }
    void setButtonMode(u8 mode) { mButtonMode = mode; }

    /* 0x0000 */ dBgS mBgS;
    /* 0x1404 */ dCcS mCcS;
    /* 0x3DF8 */ dADM mADM;
    /* 0x3E94 */ dStage_startStage_c mCurStage;
    /* 0x3EA0 */ dStage_nextStage_c mNextStage;
    /* 0x3EAE */ u8 field_0x3EAE[0x3EB0 - 0x3EAE];
    /* 0x3EB0 */ dStage_stageDt_c mStageData;
    /* 0x3F34 */ dStage_roomControl_c mRoomCtrl;
    /* 0x3F38 */ dEvt_control_c mEvtCtrl;
    /* 0x402C */ dEvent_manager_c mEvtManager;
    /* 0x4568 */ dAttention_c mAttention;
    /* 0x46F8 */ u8 field_0x46F8[0x4700 - 0x46F8];
    /* 0x4700 */ dVibration_c mVibration;
    /* 0x4784 */ dDetect_c mDetect;
    /* 0x4798 */ JKRArchive* mpMsgArchive;
    /* 0x479C */ JKRArchive* mpDmsgArchive;
    /* 0x47A0 */ JKRArchive* mpTmsgArchive;
    /* 0x47A4 */ JKRArchive* mpMenuArchive;
    /* 0x47A8 */ JKRArchive* mpFont0Archive;
    /* 0x47AC */ JKRArchive* mpFont1Archive;
    /* 0x47B0 */ JKRArchive* mpAnmArchive;
    /* 0x47B4 */ JKRArchive* mpLkDArc;
    /* 0x47B8 */ JKRArchive* mpFmapArchive;
    /* 0x47BC */ JKRArchive* mpItemResArchive;
    /* 0x47C0 */ JKRArchive* mpClctResArchive;
    /* 0x47C4 */ JKRArchive* mpFmapResArchive;
    /* 0x47C8 */ JKRArchive* mpDmapResArchive;
    /* 0x47CC */ JKRArchive* mpOptResArchive;
    /* 0x47D0 */ JKRArchive* mpClothResArchive;
    /* 0x47D4 */ JKRArchive* mpSaveResArchive;
    /* 0x47D8 */ JKRArchive* mpItemIconArchive;
    /* 0x47DC */ JKRArchive* mpNameResArchive;
    /* 0x47E0 */ JKRArchive* mpErrorResArchive;
    /* 0x47E4 */ JKRArchive* mpActionIconArchive;
    /* 0x47E8 */ JKRArchive* mpScopeResArchive;
    /* 0x47EC */ JKRArchive* mpCamResArchive;
    /* 0x47F0 */ JKRArchive* mpSwimResArchive;
    /* 0x47F4 */ JKRArchive* mpWindResArchive;
    /* 0x47F8 */ JKRArchive* mpEnglishTextArchive;
#if VERSION != VERSION_JPN
    /* 0x47FC */ JKRArchive* mpHyruleTextArchive;
    /* 0x4800 */ JKRAramBlock* mPictureBoxDataHeap[3];
    /* 0x480C */ JKRAramBlock* mBossBattleDataHeap[4];
    /* 0x481C */ JKRAramBlock* field_0x481c;
    /* 0x4820 */ JKRAramBlock* field_0x4820;
#else
    /* 0x47FC */ JKRAramBlock* mPictureBoxDataHeap[3];
    /* 0x480C */ JKRAramBlock* mBossBattleDataHeap[4];
#endif
    /* Offsets below are for USA/PAL */

    /* 0x4824 */ dPa_control_c* mParticle;
    /* 0x4828 */ dDemo_manager_c* mDemo;
    /* 0x482C */ dMagma_packet_c* mpMagmaPacket;
    /* 0x4830 */ dGrass_packet_c* mpGrassPacket;
    /* 0x4834 */ dTree_packet_c* mpTreePacket;
    /* 0x4838 */ dWood::Packet_c* mpWoodPacket;
    /* 0x483C */ dFlower_packet_c* mpFlowerPacket;
    /* 0x4840 */ s8 mLkDArcIdx;
    /* 0x4841 */ u8 mDlstWindowNum;
    /* 0x4842 */ u16 mStatus;
    /* 0x4844 */ dDlst_window_c mDlstWindow[1];
    /* 0x4870 */ dComIfG_camera_info_class mCameraInfo[1];
    /* 0x48A4 */ daPy_py_c* mpPlayer[1];
    /* 0x48A8 */ s8 mCurCamera[1];
    /* 0x48A9 */ u8 field_0x48A9[0x48AC - 0x48A9];
    /* 0x48AC */ fopAc_ac_c* mpPlayerPtr[3];  // 0: Link, 1: Partner, 2: Ship
    /* 0x48B8 */ f32 field_0x48b8;
    /* 0x48BC */ f32 mItemLifeCount;
    /* 0x48C0 */ int mItemRupeeCount;
    /* 0x48C4 */ int mAirMeter;
    /* 0x48C8 */ int field_0x48c8;
    /* 0x48CC */ int mNpcNameMessageID;
    /* 0x48D0 */ int mItemNameMessageID;
    /* 0x48D4 */ s16 mItemKeyNumCount;
    /* 0x48D6 */ s16 mItemMaxLifeCount;
    /* 0x48D8 */ s16 mItemMagicCount;
    /* 0x48DA */ s16 field_0x48da;
    /* 0x48DC */ s16 mItemMaxMagicCount;
    /* 0x48DE */ s16 field_0x48de;
    /* 0x48E0 */ s16 mItemArrowNumCount;
    /* 0x48E2 */ s16 field_0x48e2;
    /* 0x48E4 */ s16 mItemBombNumCount;
    /* 0x48E6 */ s16 field_0x48e6;
    /* 0x48E8 */ s16 mItemBeastNumCounts[8];
    /* 0x48F8 */ u8 field_0x48F8[0x4918 - 0x48F8];
    /* 0x4918 */ u16 mMsgCountNumber;
    /* 0x491A */ s16 mMsgSetNumber;
    /* 0x491C */ s16 mMessageRupee;
    /* 0x491E */ s16 field_0x491e;
    /* 0x4920 */ s16 field_0x4920;
    /* 0x4922 */ s16 field_0x4922;
    /* 0x4924 */ s16 mCurrHP;
    /* 0x4926 */ s16 mRupyCountDisplay;
    /* 0x4928 */ u8 field_0x4928;
    /* 0x4929 */ u8 field_0x4929;
    /* 0x492A */ u8 field_0x492a;
    /* 0x492B */ u8 mbCamOverrideFarPlane;
    /* 0x492C */ u8 field_0x492c;
    /* 0x492D */ u8 field_0x492d;
    /* 0x492E */ u8 mCurrButtonBAction;
    /* 0x492F */ u8 mCurrButtonAAction;
    /* 0x4930 */ u8 field_0x4930;
    /* 0x4931 */ u8 field_0x4931;
    /* 0x4932 */ u8 field_0x4932;
    /* 0x4933 */ u8 mSelectItem[4];
    /* 0x4937 */ u8 mSelectEquip[4];
    /* 0x493B */ u8 mMesgAnime;
    /* 0x493C */ u8 mMesgAnimeTagInfo;
    /* 0x493D */ u8 mItemSlot;
    /* 0x493E */ u8 mItemNo;
    /* 0x493F */ u8 field_0x493f;
    /* 0x4940 */ u8 field_0x4940;
    /* 0x4941 */ u8 field_0x4941;
    /* 0x4942 */ u8 mButtonMode;
    /* 0x4943 */ u8 field_0x4943;
    /* 0x4944 */ u8 field_0x4944;
    /* 0x4945 */ u8 field_0x4945;
    /* 0x4946 */ u8 field_0x4946;
    /* 0x4947 */ u8 field_0x4947;
    /* 0x4948 */ u8 mMesgSendButton;
    /* 0x4949 */ u8 mMesgCancelButton;
    /* 0x494A */ u8 field_0x494a[6];
    /* 0x4950 */ u8 mMelodyNum;
    /* 0x4951 */ u8 field_0x4951;
    /* 0x4952 */ u8 field_0x4952;
    /* 0x4953 */ u8 field_0x4953;
    /* 0x4954 */ u8 field_0x4954;
    /* 0x4955 */ u8 field_0x4955;
    /* 0x4956 */ u8 mFwaterTimer;
    /* 0x4957 */ u8 mPlacenameIndex;
    /* 0x4958 */ u8 mPlacenameState;
    /* 0x4959 */ u8 mGameoverStatus;
    /* 0x495A */ u8 field_0x495a;
    /* 0x495B */ u8 mPictureFlag;
    /* 0x495C */ u8 field_0x495c;
    /* 0x495D */ u8 field_0x495d;
    /* 0x495E */ u8 mPictureStatus;
    /* 0x495F */ u8 field_0x495f;
    /* 0x4960 */ u8 field_0x4960;
    /* 0x4961 */ u8 field_0x4961;
    /* 0x4962 */ u8 mHeapLockFlag;
    /* 0x4963 */ u8 field_0x4963;
#if VERSION != VERSION_JPN
    /* 0x4964 */ u8 mGameLanguage;
#endif
    /* 0x4965 */ u8 field_0x4965;
    /* 0x4966 */ char field_0x4966[1];
    /* 0x4967 */ u8 field_0x4967[0x4977 - 0x4967];
    /* 0x4977 */ u8 field_0x4977;
    /* 0x4978 */ u8 field_0x4978;
    /* 0x4979 */ u8 m2dShow;
    /* 0x497A */ u8 field_0x497a;
    /* 0x497B */ u8 field_0x497B[0x497C - 0x497B];
    /* 0x497C */ JKRExpHeap* mpExpHeap2D;
    /* 0x4980 */ int mMesgCameraTagInfo;
    /* 0x4984 */ int field_0x4984;
    /* 0x4988 */ int field_0x4988[10];
    /* 0x49B0 */ u8 mPlayerInfoBuffer[0x4A20 - 0x49B0];
    /* 0x4A20 */ u8 mPlayerInfoBufferStageNo;
    /* 0x4A24 */ daAgb_c* mpAgb;
    /* 0x4A28 */ u32 mPlayerStatus[2][2];
    /* 0x4A38 */ u16 field_0x4A38;
    /* 0x4A3A */ u8 mMiniGameType;
    /* 0x4A3C */ s16 mMiniGameRupee;
    /* 0x4A3E */ u8 field_0x4A3E;
    /* 0x4A40 */ __d_timer_info_c mTimerInfo;
    /* 0x4A54 */ dDlst_window_c* mCurrentWindow;
    /* 0x4A58 */ view_class* mCurrentView;
    /* 0x4A5C */ view_port_class* mCurrentViewport;
    /* 0x4A60 */ J2DOrthoGraph* mCurrentGrafPort;
    /* 0x4A64 */ u8 mShipId;
    /* 0x4A65 */ u8 mShipRoomId;
    /* 0x4A66 */ u8 mIkadaShipBeforeRoomId;
    /* 0x4A67 */ u8 mIkadaShipId;
    /* 0x4A68 */ cXyz mIkadaLinkPos;
    /* 0x4A74 */ ItemTableList* mpItemTable;
    /* 0x4A78 */ void* mpFmapData;
};

class dComIfG_inf_c {
public:
#if VERSION == VERSION_JPN
    dComIfG_inf_c();
#else
    dComIfG_inf_c() { ct(); }
#endif
    ~dComIfG_inf_c() {}

    void ct();

    /* 0x00000 */ dSv_info_c save;
    /* 0x012A0 */ dComIfG_play_c play;
    /* 0x05D1C */ dDlst_list_c drawlist;
    /* 0x1BF50 */ u8 field_0x1BF50[0x1BFC0 - 0x1BF50];
    /* 0x1BFC0 */ dRes_control_c mResControl;
    /* 0x1D1C0 */ u8 field_0x1d1c0;
    /* 0x1D1C1 */ u8 mBrightness;
};

#if VERSION != VERSION_JPN
STATIC_ASSERT(sizeof(dComIfG_inf_c) == 0x1D1C8);
#endif

extern dComIfG_inf_c g_dComIfG_gameInfo;

extern GXColor g_clearColor;
extern GXColor g_blackColor;
extern GXColor g_whiteColor;
extern GXColor g_saftyWhiteColor;

/**
 * === SAVE ===
 */

void dComIfGs_gameStart();
u8 dComIfGs_checkGetItem(u8);

inline void dComIfGs_init() {
    g_dComIfG_gameInfo.save.init();
}

inline u8 dComIfGs_checkReserveItem(u8 i_itemNo) {
    return g_dComIfG_gameInfo.save.getPlayer().getBagItem().checkReserveItem(i_itemNo);
}

inline void dComIfGs_initZone() {
    g_dComIfG_gameInfo.save.initZone();
}

inline u32 dComIfGs_createZone(int i_roomNo) {
    return g_dComIfG_gameInfo.save.createZone(i_roomNo);
}

inline u8 dComIfGs_getSelectEquip(int i_no) {
    return g_dComIfG_gameInfo.save.getPlayer().getPlayerStatusA().getSelectEquip(i_no);
}

void dComIfGs_setSelectEquip(int i_type, u8 i_itemNo);

inline u8 dComIfGs_getWalletSize() {
