#ifndef D_MENU_WINDOW_H
#define D_MENU_WINDOW_H

#include "dolphin/types.h"

class JKRExpHeap;

class sub_ms_screen_class : public msg_class {
public:
    /* 0x00FC */ JKRHeap* parentHeap_0xfc;
    /* 0x0100 */ JKRHeap* childHeap;
    /* 0x0104 */ JKRArchive* arc;
    /* 0x0108 */ fpc_ProcID mMsgID;
    /* 0x010C */ char* name[2];
    /* 0x0114 */ char* note[2];
    /* 0x011C */ char* dummy[2];
    /* 0x0124 */ u8 field_0x124[0x128 - 0x124];
    /* 0x0128 */ void* buffer_p[33];
    /* 0x01AC */ u8 field_0x1AC[0x1B0 - 0x1AC];
    /* 0x01B0 */ u16 field_0x1B0;
    /* 0x01B2 */ u8 field_0x1B2;
    /* 0x01B3 */ u8 field_0x1B3[0x1B6 - 0x1B3];
    /* 0x01B6 */ u8 mButtonsPressed;
};

class dMw_HIO_c : public JORReflexible {
public:
    dMw_HIO_c();
    virtual ~dMw_HIO_c() {}

    /* 0x04 */ s8 mNo;
    /* 0x06 */ u16 field_0x06;
    /* 0x08 */ u16 field_0x08;
    /* 0x0A */ u8 padding_0x0A[0x0C - 0x0A];
    /* 0x0C */ u16 field_0x0C;
    /* 0x0E */ u16 field_0x0E;
    /* 0x10 */ u8 padding_0x10[0x12 - 0x10];
    /* 0x12 */ u16 field_0x12;
    /* 0x14 */ u16 field_0x14;
    /* 0x16 */ u8 padding_0x16[0x18 - 0x16];
    /* 0x18 */ u16 field_0x18;
    /* 0x1A */ u16 field_0x1A;
    /* 0x1C */ u8 padding_0x1C[0x20 - 0x1C];
    /* 0x20 */ u8 arr_0x20[21];
    /* 0x35 */ u8 padding_0x35[0x38 - 0x35];
    /* 0x38 */ u8 arr_0x38[21];
    /* 0x4D */ u8 padding_0x4D[0x50 - 0x4D];
    /* 0x50 */ u8 arr_0x50[8];
    /* 0x58 */ u8 arr_0x58[8];
    /* 0x60 */ u8 arr_0x60[8];
    /* 0x68 */ u8 arr_0x68[8];
    /* 0x70 */ u8 arr_0x70[8];
    /* 0x78 */ u8 arr_0x78[8];
    /* 0x80 */ u8 padding_0x80[0x83 - 0x80];
    /* 0x83 */ u8 arr_0x83[8];
    /* 0x8B */ u8 arr_0x8B[8];
    /* 0x93 */ u8 padding_0x93[0x9E - 0x93];
    /* 0x9E */ u8 arr_0x9E[8];
    /* 0xA6 */ u8 arr_0xA6[8];
    /* 0xAE */ u8 padding_0xAE[0xB6 - 0xAE];
    /* 0xB6 */ u8 arr_0xB6[6];
    /* 0xBC */ u8 arr_0xBC[6];
    /* 0xC2 */ u8 arr_0xC2[8];
    /* 0xCA */ u8 arr_0xCA[8];
    /* 0xD2 */ u8 arr_0xD2[3];
    /* 0xD5 */ u8 arr_0xD5[3];
    /* 0xD8 */ u8 arr_0xD8[8];
    /* 0xE0 */ u8 arr_0xE0[8];
};

class dMw_DHIO_c : public JORReflexible {
public:
    dMw_DHIO_c();
    virtual ~dMw_DHIO_c() {}

    /* 0x04 */ s8 mNo;
};

extern dMw_HIO_c g_mwHIO;
extern dMw_DHIO_c g_mwDHIO;

#endif /* D_MENU_WINDOW_H */
