#ifndef D_D_A_PLAYER_H
#define D_D_A_PLAYER_H

#include "JSystem/J3DGraphAnimator/J3DAnimation.h"
#include "JSystem/J3DGraphAnimator/J3DMaterialAnm.h"
#include "d/d_attention.h"
#include "f_op/f_op_actor_mng.h"
#include "m_Do/m_Do_ext.h"

class mDoExt_MtxCalcOldFrame;
class daPy_matAnm_c;

class daPy_py_c : public fopAc_ac_c {
public:
    /* 0x290 */ u8 mAttackState;
    /* 0x291 */ u8 field_0x291;
    /* 0x292 */ u8 field_0x292[0x294 - 0x292];
    /* 0x294 */ s16 field_0x294;
    /* 0x296 */ s16 mQuakeTimer;
    /* 0x298 */ int field_0x298;
    /* 0x29C */ u32 field_0x29c;
    /* 0x2A0 */ u32 field_0x2a0;
    /* 0x2A4 */ u32 field_0x2a4;
    /* 0x2A8 */ f32 field_0x2a8;
    /* 0x2AC */ u8 field_0x2AC[0x2B0 - 0x2AC];
    /* 0x2B0 */ f32 field_0x2b0;
    /* 0x2B4 */ u8 field_0x2B4[0x2BC - 0x2B4];
    /* 0x2BC */ cXyz mHeadTopPos;
    /* 0x2C8 */ cXyz mSwordTopPos;
    /* 0x2D4 */ cXyz field_0x2d4;
    /* 0x2E0 */ cXyz field_0x2e0;
    /* 0x2EC */ cXyz mRopePos;
    /* 0x2F8 */ f32 field_0x2f8;
    /* 0x2FC */ u8 field_0x2FC[0x300 - 0x2FC];
    /* 0x300 */ f32 field_0x300;
};

class daPy_lk_c : public daPy_py_c {
public:
    /* 0x0304 */ s16 field_0x0304;
    /* 0x0306 */ s16 field_0x0306;
    /* 0x0308 */ u8 field_0x0308[0x030C - 0x0308];
    /* 0x030C */ int field_0x030c;
    /* 0x0310 */ u8 field_0x0310[0x0314 - 0x0310];
    /* 0x0314 */ int mDemoMode;
    /* 0x0318 */ u8 field_0x0318[0x031C - 0x0318];
    /* 0x031C */ void* vtbl;
    /* 0x0320 */ request_of_phase_process_class mPhsLoad;

    /* 0x0328 */ u8 temp0[0x3480 - 0x0328];

    /* 0x3480 */ dAttention_c* mpAttention;
    /* 0x3484 */ dAttList_c* mpAttnEntryA;
    /* 0x3488 */ dAttList_c* mpAttnEntryX;
    /* 0x348C */ dAttList_c* mpAttnEntryY;
    /* 0x3490 */ dAttList_c* mpAttnentryZ;
    /* 0x3494 */ u8 field_0x3494[0x34B9 - 0x3494];
    /* 0x34B9 */ u8 mFrontWallType;
    /* 0x34BA */ u8 field_0x34BA[0x34BD - 0x34BA];
    /* 0x34BD */ u8 mLastUsedEquipItem;
    /* 0x34BE */ u8 field_0x34BE[0x34C0 - 0x34BE];
    /* 0x34C0 */ u8 field_0x34c0;
    /* 0x34C1 */ u8 field_0x34c1;
    /* 0x34C2 */ u8 field_0x34c2;
    /* 0x34C3 */ u8 field_0x34c3;
    /* 0x34C4 */ u8 field_0x34c4;
    /* 0x34C5 */ u8 field_0x34c5;
    /* 0x34C6 */ u8 field_0x34C6[0x34C7 - 0x34C6];
    /* 0x34C7 */ u8 mActivePlayerBombs;
    /* 0x34C8 */ u8 mPressedButtonsBitfield;
    /* 0x34C9 */ u8 field_0x34C9[0x34D0 - 0x34C9];
    /* 0x34D0 */ s16 field_0x34d0;
    /* 0x34D2 */ s16 field_0x34d2;
    /* 0x34D4 */ s16 field_0x34d4;
    /* 0x34D6 */ u16 field_0x34d6;
    /* 0x34D8 */ s16 field_0x34d8;
    /* 0x34DA */ s16 field_0x34da;
    /* 0x34DC */ u8 field_0x34DC[0x34DE - 0x34DC];
    /* 0x34DE */ s16 field_0x34de;
    /* 0x34E0 */ u8 field_0x34E0[0x34E2 - 0x34E0];
    /* 0x34E2 */ s16 field_0x34e2;
    /* 0x34E4 */ u8 field_0x34E4[0x34E6 - 0x34E4];
    /* 0x34E6 */ s16 field_0x34e6;
    /* 0x34E8 */ u8 field_0x34E8[0x3522 - 0x34E8];
    /* 0x3522 */ s16 field_0x3522;
    /* 0x3524 */ u8 field_0x3524[0x352C - 0x3524];
    /* 0x352C */ s16 field_0x352c;
    /* 0x352E */ s16 field_0x352e;
    /* 0x3530 */ s16 field_0x3530;
    /* 0x3532 */ s16 field_0x3532;
    /* 0x3534 */ u8 field_0x3534[0x3544 - 0x3534];
    /* 0x3544 */ s16 field_0x3544;
    /* 0x3546 */ u8 field_0x3546[0x354E - 0x3546];
    /* 0x354E */ s16 field_0x354e;
    /* 0x3550 */ u8 field_0x3550[0x3554 - 0x3550];
    /* 0x3554 */ s16 field_0x3554;
    /* 0x3556 */ u8 field_0x3556[0x355E - 0x3556];
    /* 0x355E */ u16 field_0x355e;
    /* 0x3560 */ u16 mHeldItemType;
    /* 0x3562 */ u8 field_0x3562[0x3566 - 0x3562];
    /* 0x3566 */ s16 field_0x3566;
    /* 0x3568 */ s16 field_0x3568;
    /* 0x356A */ u8 field_0x356A[0x356C - 0x356A];
    /* 0x356C */ int mCameraInfoIdx;
    /* 0x3570 */ int field_0x3570;
    /* 0x3574 */ int field_0x3574;
    /* 0x3578 */ u8 field_0x3578[0x3580 - 0x3578];
    /* 0x3580 */ int field_0x3580;
    /* 0x3584 */ int mCurrentGroundAttributeCode;
    /* 0x3588 */ u8 field_0x3588[0x358C - 0x3588];
    /* 0x358C */ int mStaffIdx;
    /* 0x3590 */ int field_0x3590;
    /* 0x3594 */ int field_0x3594;
    /* 0x3598 */ u8 field_0x3598[0x35A0 - 0x3598];
    /* 0x35A0 */ f32 field_0x35a0;
    /* 0x35A4 */ f32 field_0x35a4;
    /* 0x35A8 */ u8 field_0x35A8[0x35BC - 0x35A8];
    /* 0x35BC */ f32 mVelocity;
    /* 0x35C0 */ u8 field_0x35C0[0x35C8 - 0x35C0];
    /* 0x35C8 */ f32 field_0x35c8;
    /* 0x35CC */ u8 field_0x35CC[0x35D0 - 0x35CC];
    /* 0x35D0 */ f32 field_0x35d0;
    /* 0x35D4 */ u8 field_0x35D4[0x35D8 - 0x35D4];
    /* 0x35D8 */ f32 field_0x35d8;
    /* 0x35DC */ u8 field_0x35DC[0x35E4 - 0x35DC];
    /* 0x35E4 */ f32 field_0x35e4;
    /* 0x35E8 */ f32 field_0x35e8;
    /* 0x35EC */ f32 field_0x35ec;
    /* 0x35F0 */ u8 field_0x35F0[0x35FC - 0x35F0];
    /* 0x35FC */ f32 field_0x35fc;
    /* 0x3600 */ f32 field_0x3600;
    /* 0x3604 */ u8 field_0x3604[0x3610 - 0x3604];
    /* 0x3610 */ f32 field_0x3610;
    /* 0x3614 */ int field_0x3614;
    /* 0x3618 */ u32 field_0x3618;
    /* 0x361C */ u8 field_0x361C[0x3624 - 0x361C];
    /* 0x3624 */ int field_0x3624;
    /* 0x3628 */ int field_0x3628;
    /* 0x362C */ u8 field_0x362C[0x3630 - 0x362C];
    /* 0x3630 */ int field_0x3630;
    /* 0x3634 */ int field_0x3634;
    /* 0x3638 */ u8 field_0x3638[0x3644 - 0x3638];
    /* 0x3644 */ f32 field_0x3644;
    /* 0x3648 */ u8 field_0x3648[0x3694 - 0x3648];
    /* 0x3694 */ cXyz mOldSpeed;
    /* 0x36A0 */ cXyz field_0x36a0;
    /* 0x36AC */ cXyz field_0x36ac;
    /* 0x36B8 */ u8 field_0x36B8[0x36C4 - 0x36B8];
    /* 0x36C4 */ cXyz field_0x36c4;
    /* 0x36D0 */ u8 field_0x36D0[0x3700 - 0x36D0];
    /* 0x3700 */ cXyz field_0x3700;
    /* 0x370C */ cXyz field_0x370c;
    /* 0x3718 */ u8 field_0x3718[0x3724 - 0x3718];
    /* 0x3724 */ cXyz field_0x3724;
    /* 0x3730 */ u8 field_0x3730[0x3748 - 0x3730];
    /* 0x3748 */ cXyz field_0x3748;
    /* 0x3754 */ u8 field_0x3754[0x37E4 - 0x3754];
};

#endif /* D_D_A_PLAYER_H */