//
// Generated by dtk
// Translation Unit: d_kankyo.cpp
//

#include "d/d_kankyo.h"
#include "d/d_bg_s_gnd_chk.h"
#include "d/d_com_inf_game.h"
#include "d/d_kankyo_data.h"
#include "d/d_kankyo_rain.h"
#include "d/d_kankyo_wether.h"
#include "d/d_procname.h"
#include "d/d_s_play.h"
#include "d/d_stage.h"
#include "dolphin/gf/GFPixel.h"
#include "f_op/f_op_actor_mng.h"
#include "f_op/f_op_camera_mng.h"
#include "f_op/f_op_kankyo.h"
#include "m_Do/m_Do_audio.h"
#include "m_Do/m_Do_ext.h"
#include "m_Do/m_Do_lib.h"
#include "m_Do/m_Do_mtx.h"
#include "m_Do/m_Do_printf.h"
#include "math.h"

class sub_kankyo__class : public kankyo_class {
};

#include "d/d_kankyo_dayproc.inc"

// stripped or compiler generated?
static Vec unused_lit_2100[] = {1.0f, 1.0f, 1.0f};
static Vec unused_lit_210c[] = {1.0f, 1.0f, 1.0f};

struct dKy_setLight__Status {
    /* 0x00 */ Vec mPos;
    /* 0x0C */ Vec mPos2;
    /* 0x18 */ GXColor mColor;
    /* 0x1C */ int mAttnType;
    /* 0x20 */ f32 mLightA0;
    /* 0x24 */ f32 mLightA1;
    /* 0x28 */ f32 mLightA2;
    /* 0x2C */ f32 mLightK0;
    /* 0x30 */ f32 mLightK1;
    /* 0x34 */ f32 mLightK2;
    /* 0x38 */ Vec mLightDir;
    /* 0x44 */ f32 mSpotCutoff;
    /* 0x48 */ GXSpotFn mSpotFn;
    /* 0x4C */ f32 mRefDistance;
    /* 0x50 */ f32 mRefBrightness;
    /* 0x54 */ GXDistAttnFn mDistAttnFn;
    /* 0x58 */ u32 field_0x58[12];  //?
    /* 0x88 */ f32 field_0x88;
    /* 0x8C */ f32 field_0x8c;
    /* 0x90 */ f32 field_0x90;
    /* 0x94 */ f32 field_0x94;
    /* 0x98 */ u32 field_0x98[16];  //?
    /* 0xD8 */ f32 field_0xd8;
    /* 0xDC */ f32 field_0xdc;
    /* 0xE0 */ f32 field_0xe0;
    /* 0xE4 */ f32 field_0xe4;
};

dKy_setLight__Status lightStatusBase = {
    {-36384.5f, 29096.7f, 17422.2f},
    {377.0f, 5207.4f, 1220.4f},
    {255, 255, 255, 255},
    0,
    1.0f, 0.0f, 0.0f,
    1.0f, 0.0f, 0.0f,
    {0.0f, -1.0f, -1.0f},
    90.0f,
    GX_SP_OFF,
    500.0f,
    1.0f,
    GX_DA_OFF,
    {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0},
    320.0f,
    -320.0f,
    1000.0f,
    160000.0f,
    {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0},
    0.536479f,
    2.726476f,
    0.0f,
    0.5f,
};

u16 lightMaskData[] = {
    GX_LIGHT0, GX_LIGHT1, GX_LIGHT2, GX_LIGHT3, GX_LIGHT4, GX_LIGHT5, GX_LIGHT6, GX_LIGHT7,
};

/* 8018F7FC-8018F848       .text toon_proc_check__Fv */
BOOL toon_proc_check() {
    s32 roomNo = dComIfGp_roomControl_getStayNo();
    if (roomNo >= 0) {
        dComIfGp_roomControl_getStatusRoomDt(roomNo)->getFileListInfo();
    }

    return false;
}

/* 8018F848-8018F894       .text u8_data_ratio_set__FUcUcf */
