//
// Generated by dtk
// Translation Unit: d_s_logo.cpp
//

#include "f_op/f_op_scene.h"
#include "f_op/f_op_scene_mng.h"
#include "c/c_dylink.h"
#include "d/d_com_inf_game.h"
#include "d/d_com_lib_game.h"
#include "d/d_procname.h"
#include "d/d_s_play.h"
#include "m_Do/m_Do_audio.h"
#include "m_Do/m_Do_controller_pad.h"
#include "m_Do/m_Do_ext.h"
#include "m_Do/m_Do_graphic.h"
#include "m_Do/m_Do_machine.h"
#include "m_Do/m_Do_MemCard.h"
#include "m_Do/m_Do_Reset.h"
#include "m_Do/m_Do_dvd_thread.h"
#include "JSystem/JKernel/JKRExpHeap.h"
#include "JSystem/JKernel/JKRAram.h"
#include "JSystem/JKernel/JKRAramBlock.h"
#include "JSystem/JKernel/JKRAramHeap.h"
#include "dolphin/vi/vi.h"
#include "dolphin/os/OS.h"
#include "MSL_C/string.h"

class dScnLogo_c : public scene_class {
public:
    /* 0x1C4 */ request_of_phase_process_class mPhs;
    /* 0x1CC */ dDlst_2D_c * nintendoImg;
    /* 0x1D0 */ dDlst_2D_c * dolbyImg;
    /* 0x1D4 */ dDlst_2D_c * progchoiceImg;
    /* 0x1D8 */ dDlst_2D_c * progyesImg;
    /* 0x1DC */ dDlst_2D_c * prognoImg;
    /* 0x1E0 */ dDlst_2D_c * progImg;
    /* 0x1E4 */ dDlst_2D_c * interImg;
    /* 0x1E8 */ u8 mAction;
    /* 0x1E9 */ u8 mInterFlag;
    /* 0x1EA */ u8 field_0x1ea;
    /* 0x1EB */ u8 field_0x1eb;
    /* 0x1EC */ u16 mTimer;
    /* 0x1EE */ u16 field_0x1ee;
    /* 0x1F0 */ u16 field_0x1f0;
    /* 0x1F2 */ u16 field_0x1f2;
    /* 0x1F4 */ u16 field_0x1f4;
    /* 0x1F8 */ void * field_0x1f8;
    /* 0x1FC */ u32 field_0x1fc;
};

#if VERSION == VERSION_PAL
enum LOGO_RES_FILE_ID { // IDs and indexes are synced
    /* DAT */
    LOGO_BTI_NINTENDO_376X104=0x3,
    LOGO_BTI_PROGRESSIVE_CHOICE=0x4,
    LOGO_BTI_PROGRESSIVE_CHOICE_FR=0x5,
    LOGO_BTI_PROGRESSIVE_CHOICE_GM=0x6,
    LOGO_BTI_PROGRESSIVE_CHOICE_IT=0x7,
    LOGO_BTI_PROGRESSIVE_CHOICE_SP=0x8,
    LOGO_BTI_PROGRESSIVE_INTER=0x9,
    LOGO_BTI_PROGRESSIVE_INTER_FR=0xA,
    LOGO_BTI_PROGRESSIVE_INTER_GM=0xB,
    LOGO_BTI_PROGRESSIVE_INTER_IT=0xC,
    LOGO_BTI_PROGRESSIVE_INTER_SP=0xD,
    LOGO_BTI_PROGRESSIVE_NO=0xE,
    LOGO_BTI_PROGRESSIVE_NO_FR=0xF,
    LOGO_BTI_PROGRESSIVE_NO_GM=0x10,
    LOGO_BTI_PROGRESSIVE_NO_IT=0x11,
    LOGO_BTI_PROGRESSIVE_NO_SP=0x12,
    LOGO_BTI_PROGRESSIVE_PRO=0x13,
    LOGO_BTI_PROGRESSIVE_PRO_FR=0x14,
    LOGO_BTI_PROGRESSIVE_PRO_GM=0x15,
    LOGO_BTI_PROGRESSIVE_PRO_IT=0x16,
    LOGO_BTI_PROGRESSIVE_PRO_SP=0x17,
    LOGO_BTI_PROGRESSIVE_YES=0x18,
    LOGO_BTI_PROGRESSIVE_YES_FR=0x19,
