//
// Generated by dtk
// Translation Unit: d_snap.cpp
//

#include "d/d_snap.h"
#include "d/d_com_inf_game.h"
#include "f_pc/f_pc_manager.h"
#include "f_op/f_op_camera.h"
#include "m_Do/m_Do_mtx.h"
#include "m_Do/m_Do_lib.h"
#include "JSystem/JUtility/JUTAssert.h"

// Needed for the .rodata section to match.
static const f32 dummy_2080[3] = {1.0f, 1.0f, 1.0f};
static const f32 dummy_2100[3] = {1.0f, 1.0f, 1.0f};
static const f32 dummy_3599[3] = {0.0f, 0.0f, 0.0f};

int (dSnap_packet::*dSnap_packet::m_judge_tbl[])() = {
    NULL,
    &dSnap_packet::JudgePost,
    &dSnap_packet::JudgeBikutsuki,
    &dSnap_packet::JudgeCoupleLook,
    &dSnap_packet::JudgeGF,
    &dSnap_packet::JudgeGenzo,
    &dSnap_packet::JudgeObasan4,
    &dSnap_packet::JudgeGene,
    &dSnap_packet::JudgeGene,
    &dSnap_packet::JudgeGene,
    &dSnap_packet::JudgeTestM,
};
dSnap_packet l_snap;

struct CharaData {
    /* 0x00 */ SVec offset;
    /* 0x06 */ s16 radius;
    /* 0x08 */ s16 height;
    /* 0x0A */ u16 minRatio;
    /* 0x0C */ s16 cullAngle;
    /* 0x0E */ u16 minPixels;
    /* 0x10 */ u8 figRoom;
    /* 0x11 */ u8 m11;
};  // Size: 0x12

static const CharaData l_CharaData[] = {

    {   // 0x00
        /* offset    */ {0, 10, 0},
        /* radius    */ 25,
        /* height    */ 80,
        /* minRatio  */ 500,
        /* cullAngle */ 0x2000,
        /* minPixels */ 5000,
        /* figRoom   */ 0x03,
        /* m11       */ 0x02,
    },
    {   // 0x01
        /* offset    */ {0, 20, 20},
        /* radius    */ 40,
        /* height    */ 90,
        /* minRatio  */ 500,
        /* cullAngle */ 0x2000,
        /* minPixels */ 5000,
        /* figRoom   */ 0x03,
        /* m11       */ 0x02,
    },
    {   // 0x02
        /* offset    */ {0, 10, 0},
        /* radius    */ 35,
        /* height    */ 130,
        /* minRatio  */ 500,
        /* cullAngle */ 0x2000,
        /* minPixels */ 5000,
        /* figRoom   */ 0x03,
        /* m11       */ 0x02,
    },
    {   // 0x03
        /* offset    */ {0, 10, 10},
        /* radius    */ 50,
        /* height    */ 130,
