//
// Generated by dtk
// Translation Unit: d_wood.cpp
//

#include "d/dolzel.h" // IWYU pragma: keep
#include "d/d_wood.h"
#include "JAZelAudio/JAIZelBasic.h"
#include "JSystem/JUtility/JUTAssert.h"
#include "SSystem/SComponent/c_lib.h"
#include "d/d_bg_s_gnd_chk.h"
#include "d/d_com_inf_game.h"
#include "d/d_drawlist.h"
#include "d/d_kankyo_wether.h"
#include "d/d_procname.h"
#include "d/d_tree.h"
#include "d/d_cc_d.h"
#include "dolphin/gf/GF.h"
#include "dolphin/gx/GXAttr.h"
#include "dolphin/gx/GXDisplayList.h"
#include "dolphin/gx/GXStruct.h"
#include "dolphin/types.h"
#include "m_Do/m_Do_lib.h"
#include "m_Do/m_Do_mtx.h"

//-----------------------------------------
// Types
//-----------------------------------------
enum AttrSway_e {
    SWAY_LIGHT,
    SWAY_MEDIUM,
    SWAY_STRONG,
    SWAY_PUSH,
};

struct AttrSway_c {
    /* 0x0 */ s16 phaseVelY;
    /* 0x2 */ s16 ampY;
    /* 0x4 */ s16 phaseVelX;
    /* 0x6 */ s16 ampX;
    /* 0x8 */ f32 phaseBiasX;
};
struct Attr_c {
    /* 0x00 */ AttrSway_c kSways[4][2];
    /* 0x60 */ u8 kCutCooldown;         // = 20
    /* 0x61 */ u8 kCutFadeStart;        // = 20 (Countdown time at which bush starts to fade out)
    /* 0x62 */ u8 kCutAlphaFadeSpeed;   // = 14
    /* 0x64 */ f32 kCutInitVelY;        // = 18.0f
    /* 0x68 */ f32 kCutYAccel;          // = -3.0f (Units per frame per frame)
    /* 0x6C */ f32 kCutZVel;            // = 2.5f (Units per frame)
    /* 0x70 */ s16 kCutPitchVel;        // = 200 (shortRad per frame)
    /* 0x74 */ f32 kUncutShadowScale;   // = 1.5f
    /* 0x78 */ f32 kCutShadowScale;     // = 0.3f
    /* 0x7C */ f32 kCollisionRad;       // = 80.0f;
    /* 0x80 */ f32 kCollisionRadCut;    // = 15.0f;
    /* 0x84 */ f32 kCollisionHeight;    // = 80.0f;
    /* 0x88 */ f32 kCollisionHeightCut; // = 15.0f;
    /* 0x8C */ f32 kClipRadius;         // = 100.0f;
    /* 0x90 */ f32 kClipCenterYOffset;  // = 40.0f;
    /* 0x94 */ u8 kPushBackCountdown;   // = 23
    /* 0x95 */ u8 L_Alpha_Cutoff;       // = 0x80;
};

typedef void (dWood::Anm_c::*modeProcFunc)(dWood::Packet_c *);

//-----------------------------------------
// Data
//-----------------------------------------

namespace dWood {
namespace {
// .data

#include "assets/l_Txa_swood_bTEX.h"
const u16 l_Txa_swood_bTEX__width = 64;
const u16 l_Txa_swood_bTEX__height = 64;

Vec l_pos[] = {
    {0.000022f, 14.922843f, -89.982368f},
    {-77.927017f, 14.922843f, -44.991203f},
    {-77.927025f, 14.922843f, 44.991173f},
    {-0.000008f, 14.922843f, 89.982353f},
    {77.92701f, 14.922843f, 44.99118f},
    {77.92701f, 14.922843f, -44.99118f},
    {0.0f, 86.107872f, 0.0f},
    {48.073795f, 32.79335f, -83.266212f},
    {-48.073753f, 32.79335f, -83.266228f},
    {-96.147537f, 32.79335f, -0.000015f},
    {-48.073772f, 32.79335f, 83.266212f},
    {48.073757f, 32.79335f, 83.266212f},
    {96.14753f, 32.79335f, 0.0f},
    {0.0f, 94.79158f, 0.0f},
    {46.784023f, 67.793831f, -81.032257f},
