//
// Generated by dtk
// Translation Unit: d_wood.cpp
//

#include "d/d_wood.h"
#include "JAZelAudio/JAIZelBasic.h"
#include "JSystem/JUtility/JUTAssert.h"
#include "SSystem/SComponent/c_lib.h"
#include "d/d_bg_s_gnd_chk.h"
#include "d/d_com_inf_game.h"
#include "d/d_drawlist.h"
#include "d/d_kankyo_wether.h"
#include "d/d_procname.h"
#include "d/d_tree.h"
#include "d/d_cc_d.h"
#include "dolphin/gf/GFGeometry.h"
#include "dolphin/gf/GFTev.h"
#include "dolphin/gf/GFTransform.h"
#include "dolphin/gx/GXAttr.h"
#include "dolphin/gx/GXDisplayList.h"
#include "dolphin/gx/GXStruct.h"
#include "dolphin/types.h"
#include "m_Do/m_Do_lib.h"
#include "m_Do/m_Do_mtx.h"

#include "weak_data_2100_2080.h" // IWYU pragma: keep

#define CONST_U32(v) ((u8)((v) >> 16)), ((u8)((v) >> 8)), ((u8)((v) >> 0))
#define IMAGE_ADDR(addr) CONST_U32((u32)(addr) >> 5)

//-----------------------------------------
// Types
//-----------------------------------------
enum AttrSway_e {
    SWAY_LIGHT,
    SWAY_MEDIUM,
    SWAY_STRONG,
    SWAY_PUSH,
};

struct AttrSway_c {
    /* 0x0 */ s16 phaseVelY;
    /* 0x2 */ s16 ampY;
    /* 0x4 */ s16 phaseVelX;
    /* 0x6 */ s16 ampX;
    /* 0x8 */ f32 phaseBiasX;
};
struct Attr_c {
    /* 0x00 */ AttrSway_c kSways[4][2];
    /* 0x60 */ u8 kCutCooldown;         // = 20
    /* 0x61 */ u8 kCutFadeStart;        // = 20 (Countdown time at which bush starts to fade out)
    /* 0x62 */ u8 kCutAlphaFadeSpeed;   // = 14
    /* 0x64 */ f32 kCutInitVelY;        // = 18.0f
    /* 0x68 */ f32 kCutYAccel;          // = -3.0f (Units per frame per frame)
    /* 0x6C */ f32 kCutZVel;            // = 2.5f (Units per frame)
    /* 0x70 */ s16 kCutPitchVel;        // = 200 (shortRad per frame)
    /* 0x74 */ f32 kUncutShadowScale;   // = 1.5f
    /* 0x78 */ f32 kCutShadowScale;     // = 0.3f
    /* 0x7C */ f32 kCollisionRad;       // = 80.0f;
    /* 0x80 */ f32 kCollisionRadCut;    // = 15.0f;
    /* 0x84 */ f32 kCollisionHeight;    // = 80.0f;
    /* 0x88 */ f32 kCollisionHeightCut; // = 15.0f;
    /* 0x8C */ f32 kClipRadius;         // = 100.0f;
    /* 0x90 */ f32 kClipCenterYOffset;  // = 40.0f;
    /* 0x94 */ u8 kPushBackCountdown;   // = 23
    /* 0x95 */ u8 L_Alpha_Cutoff;       // = 0x80;
};

typedef void (dWood::Anm_c::*modeProcFunc)(dWood::Packet_c *);

//-----------------------------------------
// Data
//-----------------------------------------

namespace dWood {
namespace {
// .data

// #include "assets/l_Txa_swood_bTEX.h"
u8 l_Txa_swood_bTEX[] ALIGN_DECL(32) = {
    0x34, 0x66, 0x3C, 0xE7, 0xFF, 0xFF, 0x55, 0x80, 0x3C, 0x86, 0x3C, 0xE7, 0xFF, 0xFF, 0x5B, 0x95,
    0x2C, 0x05, 0x2B, 0xC4, 0x2D, 0xA0, 0xA0, 0x00, 0x3C, 0xC7, 0x2C, 0x05, 0x78, 0x57, 0x55, 0x55,
    0x00, 0x00, 0x3C, 0xE7, 0xFF, 0xFF, 0xFF, 0x7F, 0x3C, 0xA7, 0x3D, 0x07, 0xFF, 0xFF, 0xFA, 0x81,
    0x2C, 0x25, 0x3C, 0xC7, 0x5D, 0x55, 0x95, 0x24, 0x3C, 0xE7, 0x2B, 0xE5, 0x0A, 0x37, 0xD5, 0x75,
    0x3C, 0xC7, 0x3C, 0xE7, 0xFF, 0xFF, 0x3F, 0x4F, 0x00, 0x00, 0x3C, 0xC7, 0xFF, 0xFF, 0xFF, 0xFD,
    0x3C, 0xA7, 0x3C, 0xE7, 0xAF, 0x5D, 0x55, 0x14, 0x3C, 0xC7, 0x2C, 0x05, 0x00, 0x00, 0x0B, 0xD5,
