//
// Generated by dtk
// Translation Unit: d_wood.cpp
//

#include "d/d_wood.h"
#include "JAZelAudio/JAIZelBasic.h"
#include "JSystem/J3DGraphBase/J3DShape.h"
#include "JSystem/J3DU/J3DUClipper.h"
#include "JSystem/JMath/JMath.h"
#include "JSystem/JUtility/JUTAssert.h"
#include "SSystem/SComponent/c_bg_s_gnd_chk.h"
#include "SSystem/SComponent/c_lib.h"
#include "d/d_bg_s_gnd_chk.h"
#include "d/d_bg_s_spl_grp_chk.h"
#include "d/d_com_inf_game.h"
#include "d/d_drawlist.h"
#include "d/d_kankyo_wether.h"
#include "d/d_procname.h"
#include "d/d_tree.h"
#include "dolphin/gf/GFGeometry.h"
#include "dolphin/gf/GFTev.h"
#include "dolphin/gf/GFTransform.h"
#include "dolphin/gx/GXAttr.h"
#include "dolphin/gx/GXDisplayList.h"
#include "dolphin/types.h"
#include "m_Do/m_Do_lib.h"
#include "m_Do/m_Do_mtx.h"

// These belong in the d_tree compilation unit. But in order to match, they must
// be in this compilation unit so they can have a 16-bit offset, allowing us
// load their pointer using a single load immediate instruction
// u8 g_dTree_shadowTexCoord[2];

//-----------------------------------------
// Types
//-----------------------------------------
typedef u8 ALIGN_DECL(32) jData;

typedef void (dWood::Anm_c::*modeProcFunc)(dWood::Packet_c *);

enum AttrSway_e {
    SWAY_LIGHT,
    SWAY_MEDIUM,
    SWAY_STRONG,
    SWAY_EXTREME,
};

struct AttrSway_c {
    /* 0x0 */ s16 phaseVelY;
    /* 0x2 */ s16 ampY;
    /* 0x4 */ s16 phaseVelX;
    /* 0x6 */ s16 ampX;
    /* 0x8 */ float phaseBiasX;
};
struct Attr_c {
    /* 0x0 */ AttrSway_c kSways[4][2];
    /* 0x60 */ u8 kCutCooldown;           // = 20
    /* 0x61 */ u8 kCutPosOffsetX;         // = 20
    /* 0x62 */ u8 kCutAlphaFadeSpeed;     // = 14
    /* 0x64 */ float kCutInitVelY;        // = 18.0f
    /* 0x68 */ float kCutYAccel;          // = -3.0f (Units per frame per frame)
    /* 0x6C */ float kCutZVel;            // = 2.5f (Units per frame)
    /* 0x70 */ s16 kCutPitchVel;          // = 200 (shortRad per frame)
    /* 0x74 */ float kUncutShadowScale;   // = 1.5f
    /* 0x78 */ float kCutShadowScale;     // = 0.3f
    /* 0x7c */ float kCollisionRad;       // = 80.0f;
    /* 0x80 */ float kCollisionRadCut;    // = 15.0f;
    /* 0x84 */ float kCollisionHeight;    // = 80.0f;
    /* 0x88 */ float kCollisionHeightCut; // = 15.0f;
    /* 0x8c */ float kClipRadius;         // = 100.0f;
    /* 0x90 */ float kClipCenterYOffset;  // = 40.0f;
    /* 0x94 */ u8 kPushBackCountdown;     // = 23
    /* 0x95 */ const u8 L_Alpha_Cutoff;   // = 0x80;
};

//-----------------------------------------
// Data
//-----------------------------------------
static Vec _pad0[1] = {1, 1, 1};
static Vec _pad1[1] = {1, 1, 1};

namespace dWood {
namespace {
// .data
