//
// Generated by dtk
// Translation Unit: d_a_sail.cpp
//

#include "d/dolzel_rel.h" // IWYU pragma: keep
#include "d/actor/d_a_sail.h"
#if VERSION == VERSION_DEMO
#include "d/d_s_play.h"
#endif
#include "d/res/res_kaizokusen.h"
#include "d/res/res_cloth.h"
#include "d/d_procname.h"
#include "d/d_priority.h"
#include "d/d_com_inf_game.h"
#include "d/d_kankyo_wether.h"
#include "d/actor/d_a_obj_pirateship.h"
#include "f_op/f_op_actor_mng.h"
#include "m_Do/m_Do_mtx.h"
#include "SSystem/SComponent/c_lib.h"
#include "SSystem/SComponent/c_angle.h"

class daSail_HIO_c : public JORReflexible {
public:
    daSail_HIO_c() {
        mNo = -1;
        m05 = 1;
        m06 = 1;
        m10 = 0.0f;
        m07 = 0;
    }
    virtual ~daSail_HIO_c() {
        mNo = -1;
    }

    void genMessage(JORMContext* ctx) {}

public:
    /* 0x04 */ s8 mNo;
    /* 0x05 */ u8 m05;
    /* 0x06 */ u8 m06;
    /* 0x07 */ u8 m07;
    /* 0x08 */ u8 m08;
    /* 0x09 */ u8 m09[0x0C - 0x09];
    /* 0x0C */ f32 m0C;
    /* 0x10 */ f32 m10;
};

#if VERSION == VERSION_DEMO
#define REG_SAIL_F(i) REG10_F(i)
#define REG_SAIL_S(i) REG10_S(i)
#else
#define REG_SAIL_F(i) 0.0f
#define REG_SAIL_S(i) 0
#endif

static daObjPirateship::Act_c* l_p_ship;
static daSail_HIO_c l_HIO;

Vec l_pos[] = {
    {-840.0f, 0.0f, 0.0f},
    {-560.0f, 0.0f, 0.0f},
    {-280.0f, 0.0f, 0.0f},
    {0.0f, 0.0f, 0.0f},
    {280.0f, 0.0f, 0.0f},
    {560.0f, 0.0f, 0.0f},
    {840.0f, 0.0f, 0.0f},
    {-840.0f, -100.0f, 0.0f},
    {-560.0f, -100.0f, 0.0f},
    {-280.0f, -100.0f, 0.0f},
    {0.0f, -100.0f, 0.0f},
    {280.0f, -100.0f, 0.0f},
    {560.0f, -100.0f, 0.0f},
    {840.0f, -100.0f, 0.0f},
    {-840.0f, -200.0f, 0.0f},
    {-560.0f, -200.0f, 0.0f},
    {-280.0f, -200.0f, 0.0f},
    {0.0f, -200.0f, 0.0f},
    {280.0f, -200.0f, 0.0f},
    {560.0f, -200.0f, 0.0f},
    {840.0f, -200.0f, 0.0f},
    {-840.0f, -300.0f, 0.0f},
    {-560.0f, -300.0f, 0.0f},
    {-280.0f, -300.0f, 0.0f},
    {0.0f, -300.0f, 0.0f},
