/**
 * d_a_bb.cpp
 * Enemy - Kargaroc
 */

#include "d/dolzel_rel.h" // IWYU pragma: keep
#include "d/actor/d_a_bb.h"
#include "m_Do/m_Do_ext.h"
#include "d/d_procname.h"
#include "d/d_priority.h"
#include "d/d_cc_d.h"
#include "d/d_com_inf_game.h"
#include "d/d_s_play.h"
#include "d/res/res_bb.h"
#include "d/d_kankyo.h"
#include "f_op/f_op_kankyo_mng.h"
#include "d/d_snap.h"
#include "d/d_material.h"
#include "d/actor/d_a_esa.h"
#include "d/actor/d_a_sea.h"
#include "d/actor/d_a_mo2.h"
#include "d/actor/d_a_bk.h"
#include "d/actor/d_a_player.h"
#if VERSION == VERSION_DEMO
#include "m_Do/m_Do_controller_pad.h"
#endif
#include "d/d_bg_s_lin_chk.h"
#include "d/d_cc_uty.h"
#include "SSystem/SComponent/c_lib.h"

class bbHIO_c : public mDoHIO_entry_c {
public:
    bbHIO_c() {
        unk_04 = 0;
        unk_05 = 0;
#if VERSION == VERSION_DEMO
        unk_10 = 0x3228;
#endif
        unk_08 = 20.0f;
        unk_0C = 2500.0f;
        unk_12 = 0x258;
        unk_14 = 0x4B0;
        unk_16 = 0x1C2;
        unk_18 = 0x2EE;
        unk_1C = 0.35f;
        unk_20 = 0.5f;
        unk_24 = 1.5f;
        unk_28 = 1.0f;
        unk_2C = 0.85f;
        unk_38 = 0.85f;
        unk_3C = 1.0f;
        unk_40 = 30;
        unk_44 = 1.0f;
        unk_48 = 1.0f;
        unk_4C = 1.5f;
        unk_50 = 0x44C;
        unk_54 = 3.5f;
        unk_32 = 20;
        unk_30 = 0x2D;
        unk_34 = 2.5f;
        unk_58 = 45.0f;
        unk_5C = 30.0f;
        unk_60 = 2;
        unk_62 = 2;
        unk_64 = 1;
        unk_68 = 8000.0f;
        unk_74 = 3000.0f;
        unk_70 = 0x6D60;
        unk_6C = 1500.0f;
        unk_78 = 2000.0f;
        unk_72 = 0x59D8;
        unk_7C = 10000.0f;
    }
    virtual ~bbHIO_c() {}

    void genMessage(JORMContext* ctx) {}

public:
    /* 0x04 */ u8 unk_04;
    /* 0x05 */ u8 unk_05;
    /* 0x06 */ u8 unk_06;
    /* 0x08 */ f32 unk_08;
    /* 0x0C */ f32 unk_0C;
    /* 0x10 */ s16 unk_10;
    /* 0x12 */ s16 unk_12;
    /* 0x14 */ s16 unk_14;
    /* 0x16 */ s16 unk_16;
    /* 0x18 */ s16 unk_18;
    /* 0x1C */ f32 unk_1C;
    /* 0x20 */ f32 unk_20;
    /* 0x24 */ f32 unk_24;
    /* 0x28 */ f32 unk_28;
    /* 0x2C */ f32 unk_2C;
    /* 0x30 */ s16 unk_30;
    /* 0x32 */ s16 unk_32;
    /* 0x34 */ f32 unk_34;
    /* 0x38 */ f32 unk_38;
    /* 0x3C */ f32 unk_3C;
    /* 0x40 */ s16 unk_40;
    /* 0x44 */ f32 unk_44;
    /* 0x48 */ f32 unk_48;
    /* 0x4C */ f32 unk_4C;
    /* 0x50 */ s16 unk_50;
    /* 0x54 */ f32 unk_54;
    /* 0x58 */ f32 unk_58;
    /* 0x5C */ f32 unk_5C;
    /* 0x60 */ s16 unk_60;
    /* 0x62 */ s16 unk_62;
    /* 0x64 */ s16 unk_64;
    /* 0x68 */ f32 unk_68;
    /* 0x6C */ f32 unk_6C;
    /* 0x70 */ s16 unk_70;
    /* 0x72 */ s16 unk_72;
    /* 0x74 */ f32 unk_74;
    /* 0x78 */ f32 unk_78;
    /* 0x7C */ f32 unk_7C;
}; // size = 0x80

static s8 callback_check_index[] = {0xFF, 0xFF, 0xFF, 0x64, 0xFF, 0xFF, 0xFF, 0xFF, 0x64, 0xFF, 0xFF, 0x00, 0x01, 0x02, 0x03, 0x04, 0x05, 0x06, 0x07, 0x08, 0x09, 0x0A, 0x64, 0x64, 0x64, 0xFF, 0xFF, 0xFF, 0xFF, 0x64, 0x64};
static f32 tial_scale[] = {
    0.25f, 0.275f, 0.2875f, 0.3f, 0.325f, 0.375f, 0.4625f, 0.575f, 0.8f, 
};
static u16 bb_tex_anm_idx[] = {
    BB_BTP_TATACK, BB_BTP_TCLOSE, BB_BTP_TDAMAGE, BB_BTP_TKAIJO, BB_BTP_TMABATAKI, BB_BTP_TOPEN,
};
static u16 bb_tex_max_frame[] = {
    5, 3, 40, 5, 7, 3,
};

static bbHIO_c l_bbHIO;
static esa_class* esa_info[100];
static s32 esa_check_count;

/* 000000EC-000003C8       .text nodeCallBack__FP7J3DNodei */
static BOOL nodeCallBack(J3DNode* node, int calcTiming) {
    s32 idx;
    s32 jntNo;
    J3DModel* model;
    bb_class* i_this;
    
    if (calcTiming == J3DNodeCBCalcTiming_In) {
        J3DJoint* joint = (J3DJoint*)node;
        jntNo = joint->getJntNo();
