//
// Generated by dtk
// Translation Unit: d_a_npc_people.cpp
//

#include "d/dolzel_rel.h" // IWYU pragma: keep
#include "d/actor/d_a_npc_people.h"
#include "d/actor/d_a_kb.h"
#include "d/actor/d_a_player.h"
#include "d/actor/d_a_ship.h"
#include "d/actor/d_a_dai.h"
#include "d/d_procname.h"
#include "d/d_priority.h"
#include "d/d_com_lib_game.h"
#include "d/d_com_inf_game.h"
#include "d/d_camera.h"
#include "d/d_a_obj.h"
#include "d/d_snap.h"
#include "d/d_kankyo_wether.h"
#include "f_op/f_op_actor_mng.h"
#include "m_Do/m_Do_lib.h"

extern dCcD_SrcCyl dNpc_cyl_src;

static char* l_npc_staff_id[] = {
    "Uo1",
    "Uo2",
    "Uo3",
    "Ub1",
    "Ub2",
    "Ub3",
    "Ub4",
    "Uw1",
    "Uw2",
    "Um1",
    "Um2",
    "Um3",
    "Sa1",
    "Sa2",
    "Sa3",
    "Sa4",
    "Sa5",
    "Ug1",
    "Ug2",
};

static const char* l_arcname_tbl[] = {
    "Uo",
    "Uo",
    "Uo",
    "Ub",
    "Ub",
    "Ub",
    "Ub",
    "Uw",
    "Uw",
    "Um",
    "Um",
    "Um",
    "Sa",
    "Sa",
    "Sa",
    "Sa",
    "Sa",
    "Ug",
    "Ug",
};

static int l_bck_ix_tbl_uo1[] = {
    0x05,
    0x03,
    0x14,
    0x04,
    0x04,
    0x04,
};

static int l_bck_ix_tbl_uo2[] = {
    0x04,
    0x02,
    0x14,
    0x00,
    0x01,
    0x01,
};

static int l_bck_ix_tbl_uo3[] = {
    0x04,
    0x02,
    0x14,
    0x12,
    0x13,
    0x13,
};

static int l_bck_ix_tbl_ub1[] = {
    0x0E,
    0x0D,
    0x0E,
    0x0F,
    0x10,
    0x10,
};

static int l_bck_ix_tbl_ub2[] = {
    0x0E,

static u32 l_msg_sa5_explain1[] = {
    0x3270,
    0x3271,
    0x3274,
    0x3275,
    0x0014,
};

static u32 l_msg_sa5_explain2[] = {
    0x3270,
    0x3271,
    0x3273,
    0x3275,
    0x0014,
};

static u32 l_msg_sa5_explain3[] = {
    0x3270,
    0x3271,
    0x3272,
    0x3275,
    0x0014,
};

static u32* l_msg_sa5_explain[] = {
    l_msg_sa5_explain1,
    l_msg_sa5_explain2,
    l_msg_sa5_explain3,
};

static u32 l_msg_sa5_ok[] = {
    0x3277,
    0x3278,
    0x0000,
};

static u32 l_msg_sa5_wait[] = {
    0x3276,
    0x0012,
};

static u32 l_msg_sa5_mini_game_clr[] = {
    0x3287,
    0x3288,
    0x3289,
    0x0009,
    0x328A,
    0x0017,
};

static u32 l_msg_sa5_timer_zero[] = {
    0x3285,
    0x0017,
};

static u32 l_msg_sa5__next_day[] = {
    0x3286,
    0x0017,
};

static u32 l_msg_sa5_false_1st1[] = {
    0x3293,
    0x328C,
    0x0000,
};

static u32 l_msg_sa5_false_1st2[] = {
    0x3294,
    0x328C,
    0x0000,
};

static u32 l_msg_sa5_false_1st3[] = {
    0x3295,
    0x328C,
    0x0000,
};

static u32* l_msg_sa5_false_1st[] = {
    l_msg_sa5_false_1st1,
    l_msg_sa5_false_1st2,
    l_msg_sa5_false_1st3,
};

static u32 l_msg_sa5_false_2nd[] = {
    0x328D,
    0x328E,
    0x0017,
};

static u32 l_msg_sa5_night[] = {
    0x3265,
    0x0000,
};

static u32 l_msg_xy_sa5_no_skull_necklace[] = {
    0x3279,
    0x0000,
};

static u32 l_msg_xy_sa5_1st[] = {
    0x327B,
    0x327C,
    0x327D,
    0x0011,
};

static u32 l_msg_xy_sa5_2nd[] = {
    0x327A,
    0x327D,
    0x0011,
};

static u32 l_msg_xy_sa5_no[] = {
    0x0001,
    0x327E,
    0x0000,
};

static u32 l_msg_xy_sa5_yes_ng[] = {
    0x0001,
    0x327F,
    0x0000,
};

static u32 l_msg_xy_sa5_yes[] = {
    0x0001,
    0x3280,
    0x3281,
    0x0013,
};

static u32 l_msg_xy_sa5_explain[] = {
    0x3282,
    0x3283,
    0x0015,
};

static u32 l_msg_xy_sa5_ok[] = {
    0x3284,
    0x3278,
    0x0000,
};

static u32 l_msg_xy_sa5_wait[] = {
    0x3276,
    0x0013,
};

static u32 l_msg_xy_sa5_mini_game2_clr[] = {
    0x328F,
    0x3289,
    0x000A,
    0x3290,
    0x0017,
};

static u32 l_msg_xy_pig1[] = {
    0x3291,
    0x0000,
};

static u32 l_msg_xy_pig2[] = {
    0x3292,
    0x0000,
};

static u32 l_msg_ug1_1st_talk[] = {
    0x3585,
    0x3586,
    0x0000,
};

static u32 l_msg_ug1_hint_talk[] = {
    0x3587,
    0x0000,
};

static u32 l_msg_ug1_hint_talk_today[] = {
    0x3588,
    0x0000,
};

static u32 l_msg_ug1_out_area[] = {
    0x359C,
    0x0000,
};

static u32 l_msg_ug2_1st_talk[] = {
    0x358F,
    0x3590,
    0x0000,
};

static u32 l_msg_ug2_hint_talk[] = {
    0x3591,
    0x0000,
};

static u32 l_msg_ug2_hint_talk_today[] = {
    0x3592,
    0x3593,
    0x0000,
};

static u32 l_msg_ug2_out_area[] = {
    0x359D,
    0x0000,
};

static int l_get_item_no[] = {
#if VERSION == VERSION_DEMO
    dItem_ORANGE_RUPEE_e,
#else
    dItem_HEART_PIECE_e,
#endif
    dItem_COLLECT_MAP_20_e,
    dItem_COLLECT_MAP_16_e,
    dItem_HEART_PIECE_e,
    dItem_HEART_PIECE_e,
    dItem_COLLECT_MAP_15_e,
};

struct PsoData {
    /* 0x00 */ f32 field_0x00;
    /* 0x04 */ f32 field_0x04;
    /* 0x08 */ f32 field_0x08;
    /* 0x0C */ f32 field_0x0C;
    /* 0x10 */ f32 field_0x10;
    /* 0x14 */ s16 field_0x14;
    /* 0x16 */ u8 field_0x16;
    /* 0x17 */ u8 field_0x17;
    /* 0x18 */ u8 field_0x18;
}; // Size: 0x19

static PsoData l_pso_uo2 = {
    0.0f,
    50.0f,
    0.0f,
    50.0f,
    120.0f,
    0x0000,
    0xFF,
    0x04,
    0x02,
};

static PsoData l_pso_uo3 = {
    0.0f,
    50.0f,
    0.0f,
    50.0f,
    80.0f,
    0x0000,
    0xFF,
    0x04,
    0x01,
};

static PsoData l_pso_ub4 = {
    0.0f,
    100.0f,
    0.0f,
#if VERSION == VERSION_DEMO
    30.0f,
#else
    50.0f,
#endif
    85.0f,
    0x0000,
    0xFF,
    0x04,
    0x06,
};

static PsoData l_pso_uw2 = {
    0.0f,
    70.0f,
    0.0f,
    45.0f,
    100.0f,
    0x0000,
    0xFF,
    0x04,
    0x03,
};

static PsoData l_pso_uw2_2 = {
    0.0f,
    70.0f,
    0.0f,
    45.0f,
    100.0f,
    0x0000,
    0xFF,
    0x04,
    0x04,
};

static PsoData l_pso_um2 = {
    0.0f,
    70.0f,
    0.0f,
    55.0f,
    100.0f,
    0x0000,
    0xFF,
    0x04,
    0x03,
};

static PsoData* l_pso_tbl[] = {
    &l_pso_uo2,
    &l_pso_uo3,
    &l_pso_ub4,
    &l_pso_uw2,
    &l_pso_um2,
