/**
 * d_a_bomb2.cpp
 * Object - Bomb Flower - Bomb
 */

#include "d/dolzel.h" // IWYU pragma: keep
#include "d/actor/d_a_bomb2.h"
#include "d/actor/d_a_sea.h"
#include "d/actor/d_a_player.h"
#include "d/d_a_obj.h"
#include "d/d_procname.h"
#include "d/d_priority.h"
#include "d/d_kankyo_wether.h"
#include "d/d_com_inf_game.h"
#include "d/res/res_vbakh.h"
#include "f_op/f_op_camera.h"
#include "f_op/f_op_kankyo_mng.h"
#include "m_Do/m_Do_mtx.h"

namespace daBomb2 {
    namespace {
        struct Attr_c {
            /* 0x00 */ const char* resName;
            /* 0x04 */ u32 heapSize;
            /* 0x08 */ s16 field_0x8;
            /* 0x0A */ s16 field_0xA; // Appears to be the bomb timer cap
            /* 0x0C */ f32 gravity;
            /* 0x10 */ f32 maxFallSpeed;
            /* 0x14 */ f32 field_0x14;
            /* 0x18 */ f32 field_0x18;
            /* 0x1C */ f32 field_0x1C;
            /* 0x20 */ f32 field_0x20;
            /* 0x24 */ f32 field_0x24;
            /* 0x28 */ f32 field_0x28;
            /* 0x2C */ f32 field_0x2C;
            /* 0x30 */ f32 field_0x30;
            /* 0x34 */ f32 field_0x34;
            /* 0x38 */ f32 field_0x38;
            /* 0x3C */ f32 field_0x3C;
            /* 0x40 */ f32 field_0x40;
            /* 0x44 */ f32 field_0x44;
            /* 0x48 */ f32 field_0x48;
            /* 0x4C */ f32 field_0x4C;
            /* 0x50 */ f32 field_0x50;
            /* 0x54 */ f32 field_0x54;
            /* 0x58 */ f32 field_0x58;
            /* 0x5C */ f32 field_0x5C;
            /* 0x60 */ f32 field_0x60;
            /* 0x64 */ f32 field_0x64;
            /* 0x68 */ f32 field_0x68;
        };

        const Attr_c L_attr = {
            /* resName      */ "VbakH",
            /* heapSize     */ 0x920,
            /* field_0x8    */ 0x96,
            /* field_0xA    */ 0x1E,
            /* gravity      */ -2.9f,
            /* maxFallSpeed */ -100.0f,
            /* field_0x14   */ -0.6f,
            /* field_0x18   */ 19.5f,
            /* field_0x1C   */ 13.0f,
            /* field_0x20   */ 0.1f,
            /* field_0x24   */ 0.5f,
            /* field_0x28   */ 20.0f,
            /* field_0x2C   */ 25.0f,
            /* field_0x30   */ 0.002f,
            /* field_0x34   */ 0.0005f,
            /* field_0x38   */ 140.0f,
            /* field_0x3C   */ 100.0f,
            /* field_0x40   */ 180.0f,
            /* field_0x44   */ 50.0f,
            /* field_0x48   */ 2.0f,
            /* field_0x4C   */ 0.3f,
            /* field_0x50   */ 0.03f,
            /* field_0x54   */ 0.1f,
            /* field_0x58   */ 0.4f,
