/**
 * d_a_ki.cpp
 * Enemy - Keese
 */

#include "d/dolzel_rel.h" // IWYU pragma: keep
#include "d/actor/d_a_ki.h"
#include "d/actor/d_a_player.h"
#include "m_Do/m_Do_ext.h"
#include "d/d_procname.h"
#include "d/d_com_inf_game.h"
#include "d/d_priority.h"
#include "d/d_cc_d.h"
#include "d/d_s_play.h"
#include "d/d_path.h"
#include "d/d_snap.h"
#include "d/d_material.h"
#include "d/res/res_ki.h"
#include "m_Do/m_Do_hostIO.h"
#include "f_op/f_op_actor_mng.h"
#include "d/d_cc_uty.h"
#include "d/d_bg_s_lin_chk.h"
#include "JSystem/JUtility/JUTReport.h"

class kiHIO_c : public JORReflexible {
public:
    kiHIO_c() {
        m05 = 0;
        m06 = 0;
        m07 = 0;
        m10 = 1.0f;
        m08 = 1.0f;
        m14 = 1.5f;
        m18 = 2.0f;
        m1C = 55.0f;
        m20 = 175.0f;
        m24 = 60.0f;
        m28 = 30.0f;
        m2C = 3.0f;
        m30 = 7.0f;
        m44 = 30.0f;
        m34 = 65.0f;
        m38 = 100.0f;
        m40 = 7.0f;
        m3C = 15.0f;
        m4C = 30;
        m48 = 0.2f;
        m54 = 3;
        m52 = 7;
        m50 = 0x12C;
        m4E = 0x320;
        m0C = 500.0f;
        m58 = 80.0f;
    }
    virtual ~kiHIO_c() {}

    void genMessage(JORMContext* ctx) {}

    /* 0x04 */ s8 mNo;
    /* 0x05 */ u8 m05;
    /* 0x06 */ u8 m06;
    /* 0x07 */ u8 m07;
    /* 0x08 */ f32 m08;
    /* 0x0C */ f32 m0C;
    /* 0x10 */ f32 m10;
    /* 0x14 */ f32 m14;
    /* 0x18 */ f32 m18;
    /* 0x1C */ f32 m1C;
    /* 0x20 */ f32 m20;
    /* 0x24 */ f32 m24;
    /* 0x28 */ f32 m28;
    /* 0x2C */ f32 m2C;
    /* 0x30 */ f32 m30;
    /* 0x34 */ f32 m34;
    /* 0x38 */ f32 m38;
    /* 0x3C */ f32 m3C;
    /* 0x40 */ f32 m40;
    /* 0x44 */ f32 m44;
    /* 0x48 */ f32 m48;
    /* 0x4C */ s16 m4C;
    /* 0x4E */ s16 m4E;
    /* 0x50 */ s16 m50;
    /* 0x52 */ s16 m52;
    /* 0x54 */ s16 m54;
    /* 0x58 */ f32 m58;
}; // size = 0x5C

static bool hio_set;
static kiHIO_c l_kiHIO;
static s32 ki_all_count;
static s32 ki_fight_count;

static u16 ki_tex_anm_idx[] = {KI_BTP_AKE1, KI_BTP_TOJI1, KI_BTP_METOJI1, KI_BTP_GURU1};
static u16 ki_tex_max_frame[] = { 2, 2, 3, 2 };
static u8 ki_tex_loop[] = { 0, 0, 0, 0 };

/* 000000EC-000001B4       .text nodeCallBack__FP7J3DNodei */
static BOOL nodeCallBack(J3DNode* node, int calcTiming) {
    if (calcTiming == 0) {
        J3DJoint* joint = (J3DJoint*)node;
        s32 jntNo = joint->getJntNo();
        J3DModel* model = j3dSys.getModel();
        ki_class* pvVar3 = (ki_class*)model->getUserArea();

        if (pvVar3 != NULL) {
            MTXCopy(model->getAnmMtx(jntNo), *calc_mtx);
            cMtx_YrotM(*calc_mtx, pvVar3->m328);
            cMtx_ZrotM(*calc_mtx, pvVar3->m326);
            model->setAnmMtx(jntNo, *calc_mtx);
            MTXCopy(*calc_mtx, J3DSys::mCurrentMtx);
        }
    }
    return TRUE;
}

