/**
 * d_a_bwd.cpp
 * Boss - Molgera / 風ボス (Wind boss)
 */

#include "d/dolzel_rel.h" // IWYU pragma: keep
#include "d/actor/d_a_bwd.h"
#include "d/actor/d_a_bwds.h"
#include "d/actor/d_a_player.h"
#include "d/actor/d_a_player_main.h"
#include "d/d_lib.h"
#include "d/d_procname.h"
#include "d/d_priority.h"
#include "d/d_cc_d.h"
#include "d/d_s_play.h"
#include "d/d_bg_s_movebg_actor.h"
#include "d/d_snap.h"
#include "d/res/res_bwd.h"
#include "f_op/f_op_camera.h"
#include "m_Do/m_Do_graphic.h"
#include "JSystem/JUtility/JUTReport.h"

class daBwd_HIO_c : public JORReflexible {
public:
    daBwd_HIO_c();
    virtual ~daBwd_HIO_c() {};
    void genMessage(JORMContext*) {}

public:
    /* 0x04 */ s8 mNo;
    /* 0x05 */ u8 m05;
    /* 0x06 */ u8 m06;
    /* 0x07 */ u8 m07;
    /* 0x08 */ u8 m08;
    /* 0x09 */ u8 m09[0x0C - 0x09];
    /* 0x0C */ f32 m0C;
    /* 0x10 */ f32 m10;
    /* 0x14 */ s16 m14;
    /* 0x16 */ u8 m16[0x18 - 0x16];
    /* 0x18 */ f32 m18;
    /* 0x1C */ f32 m1C;
    /* 0x20 */ f32 m20;
    /* 0x24 */ s16 m24;
    /* 0x26 */ s16 m26;
    /* 0x28 */ f32 m28;
    /* 0x2C */ f32 m2C;
    /* 0x30 */ f32 m30;
    /* 0x34 */ f32 m34;
    /* 0x38 */ s16 m38;
    /* 0x3A */ s16 m3A;
    /* 0x3C */ s16 m3C;
    /* 0x3E */ s16 m3E;
};

/* 000000EC-0000019C       .text __ct__11daBwd_HIO_cFv */
daBwd_HIO_c::daBwd_HIO_c() {
    mNo = 0xFF;
    m05 = 0;
    m06 = 0;
    m07 = 0;
    m08 = 0;
    m0C = -400.0f;
    m10 = 6.0f;
    m14 = 0x78;
    m18 = 700.0f;
    m1C = 3000.0f;
    m20 = 1.3f;
    m24 = 3;
    m26 = 5;
    m28 = 800.0f;
    m2C = -500.0f;
    m30 = 3.5f;
    m34 = 2.0f;
    m38 = 0x8c;
    m3A = 0x78;
    m3C = 0x50;
    m3E = 0x96;
}

static GXColor eff_col;
static bool hio_set;
static daBwd_HIO_c l_HIO;
static cXyz suna_gr_pos[6] = {
    cXyz(-3791.0f, 0.0f, -467.0f),
    cXyz(2138.0f, 0.0f, -3176.0f),
    cXyz(1655.0f, 0.0f, 3434.0f),
    cXyz(-2405.0f, 0.0f, 2935.0f),
    cXyz(3747.0f, 0.0f, 753.0f),
    cXyz(-1393.0f, 0.0f, -3546.0f)
};
static csXyz suna_gr_ang[6];
static cXyz center_pos(0.0f, 0.0f, 0.0f);
static s32 ko_count;
static fopAc_ac_c* ko_ac[22];
static cXyz set_pos;

/* 0000019C-000001B4       .text g_eff_on__FP9bwd_class */
void g_eff_on(bwd_class* i_this) {
