/**
 * d_a_npc_fa1.cpp
 * Item - Fairy / 回復妖精 (Recovery fairy)
 */

#include "d/dolzel.h" // IWYU pragma: keep
#include "d/actor/d_a_npc_fa1.h"
#include "SSystem/SComponent/c_lib.h"
#include "d/d_com_inf_game.h"
#include "d/d_item.h"
#include "d/d_priority.h"
#include "d/d_procname.h"
#include "d/d_snap.h"
#include "f_op/f_op_actor_mng.h"

class daNpc_Fa1_HIO3_c {
public:
    struct hio_prm_c {
        // Note: Offsets are relative to daNpc_Fa1_HIO3_c instead of hio_prm_c for convenience.
        /* 0x08 */ f32 m08;
        /* 0x0C */ f32 m0C;
        /* 0x10 */ f32 m10;
        /* 0x14 */ f32 m14;
        /* 0x18 */ s16 m18;
    };

    daNpc_Fa1_HIO3_c();
    virtual ~daNpc_Fa1_HIO3_c() {}

public:
    /* 0x04 */ s8 mNo;
    /* 0x08 */ hio_prm_c prm;
};

class daNpc_Fa1_HIO2_c {
public:
    struct hio_prm_c {
        // Note: Offsets are relative to daNpc_Fa1_HIO2_c instead of hio_prm_c for convenience.
        /* 0x08 */ f32 m08;
        /* 0x0C */ f32 m0C;
        /* 0x10 */ f32 m10;
        /* 0x14 */ f32 m14;
        /* 0x18 */ f32 m18;
        /* 0x1C */ f32 m1C;
        /* 0x20 */ s16 m20;
        /* 0x22 */ s16 m22;
        /* 0x24 */ s16 m24;
    };

    daNpc_Fa1_HIO2_c();
    virtual ~daNpc_Fa1_HIO2_c() {}

public:
    /* 0x04 */ s8 mNo;
    /* 0x08 */ hio_prm_c prm;
};

class daNpc_Fa1_HIO_c : public JORReflexible {
public:
    struct hio_prm_c {
        // Note: Offsets are relative to daNpc_Fa1_HIO_c instead of hio_prm_c for convenience.
        /* 0x08 */ f32 m08;
        /* 0x0C */ f32 m0C;
        /* 0x10 */ f32 m10;
        /* 0x14 */ f32 m14;
        /* 0x18 */ f32 m18;
        /* 0x1C */ f32 m1C;
        /* 0x20 */ f32 m20;
        /* 0x24 */ f32 m24;
        /* 0x28 */ f32 m28;
        /* 0x2C */ f32 m2C;
        /* 0x30 */ f32 m30;
        /* 0x34 */ f32 m34;
        /* 0x38 */ f32 m38;
        /* 0x3C */ s16 m3C;
        /* 0x3E */ s16 m3E;
        /* 0x40 */ s16 m40;
        /* 0x42 */ s16 m42;
        /* 0x44 */ s16 m44;
        /* 0x46 */ s16 m46;
        /* 0x48 */ s16 m48;
        /* 0x4A */ s16 m4A;
        /* 0x4C */ s16 m4C;
        /* 0x4E */ s16 m4E;
    };

    daNpc_Fa1_HIO_c();
    virtual ~daNpc_Fa1_HIO_c() {}

    void genMessage(JORMContext* ctx) {}

public:
    /* 0x04 */ s8 mNo;
    /* 0x08 */ hio_prm_c prm;
    /* 0x50 */ daNpc_Fa1_HIO2_c m50;
    /* 0x78 */ daNpc_Fa1_HIO3_c m78;
};

/* 800FAFC0-800FB004       .text __ct__16daNpc_Fa1_HIO3_cFv */
daNpc_Fa1_HIO3_c::daNpc_Fa1_HIO3_c() {
    mNo = -1;
    static const hio_prm_c init_data = {
        1.0f,
        0.1f,
        50.0f,
        20.0f,
        0x3600,
    };
    prm = init_data;
}

/* 800FB004-800FB068       .text __ct__16daNpc_Fa1_HIO2_cFv */
daNpc_Fa1_HIO2_c::daNpc_Fa1_HIO2_c() {
    mNo = -1;
    static const hio_prm_c init_data = {
        20.0f,
        1.5f,
        -2.5f,
        5.0f,
        -2.5f,
        5.0f,
        0x3600,
        0xB4,
        3,
    };
    prm = init_data;
}

/* 800FB068-800FB174       .text __ct__15daNpc_Fa1_HIO_cFv */
daNpc_Fa1_HIO_c::daNpc_Fa1_HIO_c() {
    mNo = -1;
    static const hio_prm_c init_data = {
        3.0f,
        3.5f,
        40.0f,
        12.0f,
        8.0f,
        200.0f,
        100.0f,
        -50.0f,
        2.0f,
        3.0f,
        -2.5f,
        5.0f,
        -3.0f,
        4000,
        5000,
