/**
 * d_a_player_sword.inc
 *
 * Code relating using a sword item.
 *
 * This file is not a standalone translation unit and is instead directly
 * included into d_a_player_main.cpp.
 *
 * The original name of this file is known because of an assert contained within
 * a function from this file.
 */

#include "d/actor/d_a_boko.h"
#include "d/actor/d_a_player_main.h"
#include "d/actor/d_a_player_HIO.h"
#include "JSystem/J3DGraphLoader/J3DAnmLoader.h"

/* 80154B80-80154FBC       .text setSwordModel__9daPy_lk_cFi */
void daPy_lk_c::setSwordModel(BOOL r28) {
    struct sword_model_tbl_s {
        /* 0x00 */ u16 bladeModel;
        /* 0x02 */ u16 glowModel;
        /* 0x04 */ u16 glowBtk;
        /* 0x06 */ u16 glowBrk;
        /* 0x08 */ u16 tipStabModel;
        /* 0x0A */ u16 tipStabBpk;
        /* 0x0C */ u16 tipStabBtk;
        /* 0x0E */ u16 tipStabBrk;
    };
    static const sword_model_tbl_s sword_model_tbl[] = {
        {
            LINK_BDL_SWA,
            LINK_BDL_YHSLS00,
            LKANM_BTK_YHSLS00,
            LKANM_BRK_YHSLS00,
            LINK_BDL_CUTFH,
            LKANM_BPK_CUTFH,
            LKANM_BTK_CUTFH,
            LKANM_BRK_CUTFH,
        },
        {
            LINK_BDL_SWMS,
            LINK_BDL_YMSLI00,
            LKANM_BTK_YMSLI00,
            LKANM_BRK_YMSLI00,
            LINK_BDL_CUTFM,
            LKANM_BPK_CUTFM,
            LKANM_BTK_CUTFM,
            LKANM_BRK_CUTFM,
        },
    };

    u8* buffer;

    J3DAnmTransform* bck =
        checkNormalSwordEquip() ? getItemAnimeResource(LKANM_BCK_CUTAA) : getItemAnimeResource(LKANM_BCK_CUTAMS);

    mEquipItem = daPyItem_SWORD_e;
    JKRHeap* oldHeap = setItemHeap();

    const sword_model_tbl_s& model_tbl = checkNormalSwordEquip() ? sword_model_tbl[0] : sword_model_tbl[1];
