//
// Generated by dtk
// Translation Unit: d_a_npc_roten.cpp
//

#include "d/actor/d_a_npc_roten.h"
#include "d/res/res_ro.h"
#include "m_Do/m_Do_ext.h"
#include "d/actor/d_a_player_main.h"
#include "d/actor/d_a_demo_item.h"
#include "d/d_procname.h"
#include "d/d_priority.h"
#include "d/d_com_inf_game.h"
#include "d/d_com_lib_game.h"
#include "d/d_a_obj.h"
#include "d/d_snap.h"

#include "weak_data_1811.h" // IWYU pragma: keep

extern dCcD_SrcCyl dNpc_cyl_src;

static const char* l_arcname_tbl[] = {
    "Ro",
    "Ro",
    "Ro",
};

static sRotenAnmDat l_npc_anm_wait[] = {
    {
        0x00,
        0x0E,
        0xFF,
    },
};

static sRotenAnmDat l_npc_anm_talk[] = {
    {
        0x01,
        0x0E,
        0xFF,
    },
};

static sRotenAnmDat l_npc_anm_walk[] = {
    {
        0x02,
        0x0E,
        0xFF,
    },
};

static sRotenAnmDat l_npc_anm_talk2[] = {
    {
        0x03,
        0x0E,
        0xFF,
    },
};

static sRotenAnmDat l_npc_anm_talk3[] = {
    {
        0x04,
        0x0E,
        0xFF,
    },
};

static sRotenAnmDat l_npc_anm_talk4[] = {
    {
        0x05,
        0x06,
        0xFF,
    },
};

static sRotenAnmDat l_npc_anm_talk5[] = {
    {
        0x06,
        0x0A,
        0xFF,
    },
};

static sRotenAnmDat l_npc_anm_watasu[] = {
    {
        0x07,
        0x0E,
        0x01,
    },
    {
        0x08,
        0x0E,
        0xFF,
    },
};

static sRotenAnmDat l_npc_anm_itemwait[] = {
    {
        0x08,
        0x0E,
        0xFF,
    },
};

static sRotenAnmDat l_npc_anm_wind[] = {
    {
        0x09,
        0x0E,
        0x01,
    },
    {
        0x00,
        0x14,
        0x01,
    },
    {
        0xFF,
        0x08,
        0x00,
    },
};

struct NpcDatStruct {
    /* 0x00 */ f32 field_0x00;
    /* 0x04 */ s16 field_0x04;
    /* 0x06 */ s16 field_0x06;
    /* 0x08 */ s16 field_0x08;
    /* 0x0A */ s16 field_0x0A;
    /* 0x0C */ s16 field_0x0C;
    /* 0x0E */ s16 field_0x0E;
    /* 0x10 */ s16 field_0x10;
    /* 0x12 */ s16 field_0x12;
    /* 0x14 */ s16 field_0x14;
    /* 0x16 */ s16 field_0x16;
    /* 0x18 */ s16 field_0x18;
    /* 0x1A */ s16 field_0x1A;
    /* 0x1C */ f32 field_0x1C;
    /* 0x20 */ s16 field_0x20;
    /* 0x24 */ f32 field_0x24;
    /* 0x28 */ f32 field_0x28;
    /* 0x2C */ f32 field_0x2C;
    /* 0x30 */ f32 field_0x30;
    /* 0x34 */ f32 field_0x34;
    /* 0x38 */ f32 field_0x38;
    /* 0x3C */ f32 field_0x3C;
    /* 0x40 */ f32 field_0x40;
    /* 0x44 */ f32 field_0x44;
    /* 0x48 */ s16 field_0x48;
    /* 0x4A */ s16 field_0x4A;
    /* 0x4C */ s16 field_0x4C;
    /* 0x4E */ s16 field_0x4E;
    /* 0x50 */ s16 field_0x50;
    /* 0x52 */ s16 field_0x52;
}; // Size: 0x54

static NpcDatStruct l_npc_dat[] = {
    {
        0.0f,
        0x09C4,
        0x1388,
        0x1388,
        0x1388,
        0xF63C,
        0xEC78,
        0xEC78,
        0xEC78,
        0x03E8,
        0x0352,
        0x0190,
        0x0000,
        190.0f,
        0x7FFF,
        250.0f,
        150.0f,
        120.0f,
        120.0f,
        40.0f,
        60.0f,
        30.0f,
        1.0f,
        1.0f,
        0x0006,
        0x0400,
        0x003C,
        0x005A,
        0x00C8,
        0x012C,
    },
    {
        0.0f,
        0x09C4,
        0x1388,
        0x1388,
        0x1388,
        0xF63C,
        0xEC78,
        0xEC78,
        0xEC78,
        0x03E8,
        0x0352,
        0x0190,
        0x0000,
        190.0f,
        0x7FFF,
        250.0f,
        150.0f,
        120.0f,
        120.0f,
        40.0f,
        50.0f,
        20.0f,
        1.0f,
        1.0f,
        0x0006,
        0x0400,
        0x003C,
        0x005A,
        0x00C8,
        0x012C,
    },
    {
        0.0f,
        0x09C4,
        0x1388,
        0x1388,
        0x1388,
        0xF63C,
        0xEC78,
        0xEC78,
        0xEC78,
        0x03E8,
        0x0352,
        0x0190,
        0x0000,
        190.0f,
        0x7FFF,
        250.0f,
        150.0f,
        120.0f,
        120.0f,
        40.0f,
        60.0f,
        30.0f,
        1.0f,
        1.0f,
        0x0006,
        0x0400,
        0x003C,
        0x005A,
        0x00C8,
        0x012C,
    },
};

static u32 l_msg_1st_talk_A[] = {
    0x2905,
    0x2906,
    0x2907,
    0x2908,
    0x2909,
    0x0000,
};

static u32 l_msg_1st_talk_B[] = {
    0x2969,
    0x296A,
    0x296B,
    0x296C,
    0x296D,
    0x0000,
};

static u32 l_msg_1st_talk_C[] = {
    0x29CD,
    0x29CE,
    0x29CF,
    0x29D0,
    0x29D1,
    0x0000,
};

static u32* l_msg_1st_talk[] = {
    l_msg_1st_talk_A,
    l_msg_1st_talk_B,
    l_msg_1st_talk_C,
};

static u32 l_msg_exchange3_A[] = {
    0x290C,
    0x290D,
    0x290E,
    0x0000,
};

static u32 l_msg_exchange3_B[] = {
    0x2970,
    0x2971,
    0x2972,
    0x0000,
};

static u32 l_msg_exchange3_C[] = {
    0x29D4,
    0x29D5,
    0x29D6,
    0x0000,
};

static u32* l_msg_exchange3[] = {
    l_msg_exchange3_A,
    l_msg_exchange3_B,
    l_msg_exchange3_C,
};

static u32 l_msg_exchange_A[] = {
    0x290F,
    0x2910,
    0x0000,
};

static u32 l_msg_exchange_B[] = {
    0x2973,
    0x2974,
    0x0000,
};

static u32 l_msg_exchange_C[] = {
    0x29D7,
    0x29D8,
    0x0000,
};

static u32* l_msg_exchange[] = {
    l_msg_exchange_A,
    l_msg_exchange_B,
    l_msg_exchange_C,
};

static u32 l_msg_etc_A[] = {
    0x290A,
    0x290B,
    0x0000,
};

static u32 l_msg_etc_B[] = {
    0x296E,
    0x296F,
    0x0000,
};

static u32 l_msg_etc_C[] = {
    0x29D2,
    0x29D3,
    0x0000,
};

static u32* l_msg_etc[] = {
    l_msg_etc_A,
    l_msg_etc_B,
    l_msg_etc_C,
};

static u32 l_msg_xy_exchange3_A[] = {
    0x2911,
    0x2912,
    0x0000,
};

static u32 l_msg_xy_exchange3_B[] = {
    0x2975,
    0x2976,
    0x0000,
};

static u32 l_msg_xy_exchange3_C[] = {
    0x29D9,
    0x29DA,
    0x0000,
};

static u32* l_msg_xy_exchange3[] = {
    l_msg_xy_exchange3_A,
    l_msg_xy_exchange3_B,
    l_msg_xy_exchange3_C,
};

static u32 l_msg_xy_no_roten_item_A[] = {
    0x2914,
    0x0000,
};

static u32 l_msg_xy_no_roten_item_B[] = {
    0x2978,
    0x0000,
};

static u32 l_msg_xy_no_roten_item_C[] = {
    0x29DC,
    0x0000,
};

static u32* l_msg_xy_no_roten_item[] = {
    l_msg_xy_no_roten_item_A,
    l_msg_xy_no_roten_item_B,
    l_msg_xy_no_roten_item_C,
};

static u32 l_msg_xy_invalid_item_A[] = {
    0x2915,
    0x0000,
};

static u32 l_msg_xy_invalid_item_B[] = {
    0x2979,
    0x0000,
};

static u32 l_msg_xy_invalid_item_C[] = {
    0x29DD,
    0x0000,
};

static u32* l_msg_xy_invalid_item[] = {
    l_msg_xy_invalid_item_A,
    l_msg_xy_invalid_item_B,
    l_msg_xy_invalid_item_C,
};

static u32 l_msg_xy_koukan_item_A0[] = {
    0x2913,
    0x2916,
    0x0000,
};

static u32 l_msg_xy_koukan_item_A1[] = {
    0x2913,
    0x2917,
    0x0000,
};

static u32 l_msg_xy_koukan_item_A2[] = {
    0x2913,
    0x2918,
    0x0000,
};

static u32 l_msg_xy_koukan_item_A3[] = {
    0x2913,
    0x2919,
    0x0000,
};

static u32 l_msg_xy_koukan_item_A4[] = {
    0x2913,
    0x291A,
    0x0000,
};

static u32 l_msg_xy_koukan_item_A5[] = {
    0x2913,
    0x291B,
    0x0000,
};

static u32 l_msg_xy_koukan_item_A6[] = {
    0x2913,
    0x291C,
    0x0000,
};

static u32 l_msg_xy_koukan_item_A7[] = {
    0x2913,
    0x291D,
    0x0000,
};

static u32 l_msg_xy_koukan_item_A8[] = {
    0x2913,
    0x291E,
    0x0000,
};

static u32 l_msg_xy_koukan_item_A9[] = {
    0x2913,
    0x291F,
    0x0000,
};

static u32 l_msg_xy_koukan_item_AA[] = {
    0x2913,
    0x2920,
    0x0000,
};

static u32 l_msg_xy_koukan_item_AB[] = {
    0x2913,
    0x2921,
    0x0000,
};

static u32 l_msg_xy_koukan_item_B0[] = {
    0x2977,
    0x297A,
    0x0000,
};

static u32 l_msg_xy_koukan_item_B1[] = {
    0x2977,
    0x297B,
    0x0000,
};

static u32 l_msg_xy_koukan_item_B2[] = {
    0x2977,
    0x297C,
    0x0000,
};

static u32 l_msg_xy_koukan_item_B3[] = {
    0x2977,
    0x297D,
    0x0000,
};

static u32 l_msg_xy_koukan_item_B4[] = {
    0x2977,
    0x297E,
    0x0000,
};

static u32 l_msg_xy_koukan_item_B5[] = {
    0x2977,
    0x297F,
    0x0000,
};

static u32 l_msg_xy_koukan_item_B6[] = {
    0x2977,
    0x2980,
    0x0000,
};

static u32 l_msg_xy_koukan_item_B7[] = {
    0x2977,
    0x2981,
    0x0000,
};

static u32 l_msg_xy_koukan_item_B8[] = {
    0x2977,
    0x2982,
    0x0000,
};

static u32 l_msg_xy_koukan_item_B9[] = {
    0x2977,
    0x2983,
    0x0000,
};

static u32 l_msg_xy_koukan_item_BA[] = {
    0x2977,
    0x2984,
    0x0000,
};

static u32 l_msg_xy_koukan_item_BB[] = {
    0x2977,
    0x2985,
    0x0000,
};

static u32 l_msg_xy_koukan_item_C0[] = {
    0x29DB,
    0x29DE,
    0x0000,
};

static u32 l_msg_xy_koukan_item_C1[] = {
    0x29DB,
    0x29DF,
    0x0000,
};

static u32 l_msg_xy_koukan_item_C2[] = {
    0x29DB,
    0x29E0,
    0x0000,
};

static u32 l_msg_xy_koukan_item_C3[] = {
    0x29DB,
    0x29E1,
    0x0000,
};

static u32 l_msg_xy_koukan_item_C4[] = {
    0x29DB,
    0x29E2,
    0x0000,
};

static u32 l_msg_xy_koukan_item_C5[] = {
    0x29DB,
    0x29E3,
    0x0000,
};

static u32 l_msg_xy_koukan_item_C6[] = {
    0x29DB,
    0x29E4,
    0x0000,
};

static u32 l_msg_xy_koukan_item_C7[] = {
    0x29DB,
    0x29E5,
    0x0000,
};

static u32 l_msg_xy_koukan_item_C8[] = {
    0x29DB,
    0x29E6,
    0x0000,
};

static u32 l_msg_xy_koukan_item_C9[] = {
    0x29DB,
    0x29E7,
    0x0000,
};

static u32 l_msg_xy_koukan_item_CA[] = {
    0x29DB,
    0x29E8,
    0x0000,
};

static u32 l_msg_xy_koukan_item_CB[] = {
    0x29DB,
    0x29E9,
    0x0000,
};

static u32* l_msg_xy_koukan_item[][12] = {
    {
        l_msg_xy_koukan_item_A0,
        l_msg_xy_koukan_item_A1,
        l_msg_xy_koukan_item_A2,
        l_msg_xy_koukan_item_A3,
        l_msg_xy_koukan_item_A4,
        l_msg_xy_koukan_item_A5,
        l_msg_xy_koukan_item_A6,
        l_msg_xy_koukan_item_A7,
        l_msg_xy_koukan_item_A8,
        l_msg_xy_koukan_item_A9,
        l_msg_xy_koukan_item_AA,
        l_msg_xy_koukan_item_AB,
    },
    {
        l_msg_xy_koukan_item_B0,
        l_msg_xy_koukan_item_B1,
        l_msg_xy_koukan_item_B2,
        l_msg_xy_koukan_item_B3,
        l_msg_xy_koukan_item_B4,
        l_msg_xy_koukan_item_B5,
        l_msg_xy_koukan_item_B6,
        l_msg_xy_koukan_item_B7,
        l_msg_xy_koukan_item_B8,
        l_msg_xy_koukan_item_B9,
        l_msg_xy_koukan_item_BA,
        l_msg_xy_koukan_item_BB,
    },
    {
        l_msg_xy_koukan_item_C0,
        l_msg_xy_koukan_item_C1,
        l_msg_xy_koukan_item_C2,
        l_msg_xy_koukan_item_C3,
        l_msg_xy_koukan_item_C4,
        l_msg_xy_koukan_item_C5,
        l_msg_xy_koukan_item_C6,
        l_msg_xy_koukan_item_C7,
        l_msg_xy_koukan_item_C8,
        l_msg_xy_koukan_item_C9,
        l_msg_xy_koukan_item_CA,
        l_msg_xy_koukan_item_CB,
    },
};

static u32 l_msg_xy_koukan_item2_A0[] = {
    0x2922,
    0x0001,
    0x2930,
    0x0000,
};

static u32 l_msg_xy_koukan_item2_A1[] = {
    0x2923,
    0x0001,
    0x2931,
    0x0000,
};

static u32 l_msg_xy_koukan_item2_A2[] = {
    0x2924,
    0x0001,
    0x2932,
    0x0000,
};

static u32 l_msg_xy_koukan_item2_A3[] = {
    0x2925,
    0x0001,
    0x2933,
    0x0000,
};

static u32 l_msg_xy_koukan_item2_A4[] = {
    0x2926,
    0x0001,
    0x2934,
    0x0000,
};

static u32 l_msg_xy_koukan_item2_A5[] = {
    0x2927,
    0x0001,
    0x2935,
    0x0000,
};

static u32 l_msg_xy_koukan_item2_A6[] = {
    0x2928,
    0x0001,
    0x2936,
    0x0000,
};

static u32 l_msg_xy_koukan_item2_A7[] = {
    0x2929,
    0x0001,
    0x2937,
    0x0000,
};

static u32 l_msg_xy_koukan_item2_A8[] = {
    0x292A,
    0x0001,
    0x2938,
    0x0000,
};

static u32 l_msg_xy_koukan_item2_A9[] = {
    0x292B,
    0x0001,
    0x2939,
    0x0000,
};

static u32 l_msg_xy_koukan_item2_AA[] = {
    0x292C,
    0x0001,
    0x293A,
    0x0000,
};

static u32 l_msg_xy_koukan_item2_AB[] = {
    0x292D,
    0x0001,
    0x293B,
    0x0000,
};

static u32 l_msg_xy_koukan_item2_B0[] = {
    0x2986,
    0x0001,
    0x2994,
    0x0000,
};

static u32 l_msg_xy_koukan_item2_B1[] = {
    0x2987,
    0x0001,
    0x2995,
    0x0000,
};

static u32 l_msg_xy_koukan_item2_B2[] = {
    0x2988,
    0x0001,
    0x2996,
    0x0000,
};

static u32 l_msg_xy_koukan_item2_B3[] = {
    0x2989,
    0x0001,
    0x2997,
    0x0000,
};

static u32 l_msg_xy_koukan_item2_B4[] = {
    0x298A,
    0x0001,
    0x2998,
    0x0000,
};

static u32 l_msg_xy_koukan_item2_B5[] = {
    0x298B,
    0x0001,
    0x2999,
    0x0000,
};

static u32 l_msg_xy_koukan_item2_B6[] = {
    0x298C,
    0x0001,
    0x299A,
    0x0000,
};

static u32 l_msg_xy_koukan_item2_B7[] = {
    0x298D,
    0x0001,
    0x299B,
    0x0000,
};

static u32 l_msg_xy_koukan_item2_B8[] = {
    0x298E,
    0x0001,
    0x299C,
    0x0000,
};

static u32 l_msg_xy_koukan_item2_B9[] = {
    0x298F,
    0x0001,
    0x299D,
    0x0000,
};

static u32 l_msg_xy_koukan_item2_BA[] = {
    0x2990,
    0x0001,
    0x299E,
    0x0000,
};

static u32 l_msg_xy_koukan_item2_BB[] = {
    0x2991,
    0x0001,
    0x299F,
    0x0000,
};

static u32 l_msg_xy_koukan_item2_C0[] = {
    0x29EA,
    0x0001,
    0x29F8,
    0x0000,
};

static u32 l_msg_xy_koukan_item2_C1[] = {
    0x29EB,
    0x0001,
    0x29F9,
    0x0000,
};

static u32 l_msg_xy_koukan_item2_C2[] = {
    0x29EC,
    0x0001,
    0x29FA,
    0x0000,
};

static u32 l_msg_xy_koukan_item2_C3[] = {
    0x29ED,
    0x0001,
    0x29FB,
    0x0000,
};

static u32 l_msg_xy_koukan_item2_C4[] = {
    0x29EE,
    0x0001,
    0x29FC,
    0x0000,
};

static u32 l_msg_xy_koukan_item2_C5[] = {
    0x29EF,
    0x0001,
    0x29FD,
    0x0000,
};

static u32 l_msg_xy_koukan_item2_C6[] = {
    0x29F0,
    0x0001,
    0x29FE,
    0x0000,
};

static u32 l_msg_xy_koukan_item2_C7[] = {
    0x29F1,
    0x0001,
    0x29FF,
    0x0000,
};

static u32 l_msg_xy_koukan_item2_C8[] = {
    0x29F2,
    0x0001,
    0x2A00,
    0x0000,
};

static u32 l_msg_xy_koukan_item2_C9[] = {
    0x29F3,
    0x0001,
    0x2A01,
    0x0000,
};

static u32 l_msg_xy_koukan_item2_CA[] = {
    0x29F4,
    0x0001,
    0x2A02,
    0x0000,
};

static u32 l_msg_xy_koukan_item2_CB[] = {
    0x29F5,
    0x0001,
    0x2A03,
    0x0000,
};

static u32* l_msg_xy_koukan_item2[][12] = {
    {
        l_msg_xy_koukan_item2_A0,
        l_msg_xy_koukan_item2_A1,
        l_msg_xy_koukan_item2_A2,
        l_msg_xy_koukan_item2_A3,
        l_msg_xy_koukan_item2_A4,
        l_msg_xy_koukan_item2_A5,
        l_msg_xy_koukan_item2_A6,
        l_msg_xy_koukan_item2_A7,
        l_msg_xy_koukan_item2_A8,
        l_msg_xy_koukan_item2_A9,
        l_msg_xy_koukan_item2_AA,
        l_msg_xy_koukan_item2_AB,
    },
    {
        l_msg_xy_koukan_item2_B0,
        l_msg_xy_koukan_item2_B1,
        l_msg_xy_koukan_item2_B2,
        l_msg_xy_koukan_item2_B3,
        l_msg_xy_koukan_item2_B4,
        l_msg_xy_koukan_item2_B5,
        l_msg_xy_koukan_item2_B6,
        l_msg_xy_koukan_item2_B7,
        l_msg_xy_koukan_item2_B8,
        l_msg_xy_koukan_item2_B9,
        l_msg_xy_koukan_item2_BA,
        l_msg_xy_koukan_item2_BB,
    },
    {
        l_msg_xy_koukan_item2_C0,
        l_msg_xy_koukan_item2_C1,
        l_msg_xy_koukan_item2_C2,
        l_msg_xy_koukan_item2_C3,
        l_msg_xy_koukan_item2_C4,
        l_msg_xy_koukan_item2_C5,
        l_msg_xy_koukan_item2_C6,
        l_msg_xy_koukan_item2_C7,
        l_msg_xy_koukan_item2_C8,
        l_msg_xy_koukan_item2_C9,
        l_msg_xy_koukan_item2_CA,
        l_msg_xy_koukan_item2_CB,
    },
};

static u32 l_msg_xy_koukan_item3_A0[] = {
    0x292E,
    0x2930,
    0x0002,
    0x0000,
};

static u32 l_msg_xy_koukan_item3_A1[] = {
    0x292E,
    0x2931,
    0x0002,
    0x0000,
};

static u32 l_msg_xy_koukan_item3_A2[] = {
    0x292E,
    0x2932,
    0x0002,
    0x0000,
};

static u32 l_msg_xy_koukan_item3_A3[] = {
    0x292E,
    0x2933,
    0x0002,
    0x0000,
};

static u32 l_msg_xy_koukan_item3_A4[] = {
    0x292E,
    0x2934,
    0x0002,
    0x0000,
};

static u32 l_msg_xy_koukan_item3_A5[] = {
    0x292E,
    0x2935,
    0x0002,
    0x0000,
};

static u32 l_msg_xy_koukan_item3_A6[] = {
    0x292E,
    0x2936,
    0x0002,
    0x0000,
};

static u32 l_msg_xy_koukan_item3_A7[] = {
    0x292E,
    0x2937,
    0x0002,
    0x0000,
};

static u32 l_msg_xy_koukan_item3_A8[] = {
    0x292E,
    0x2938,
    0x0002,
    0x0000,
};

static u32 l_msg_xy_koukan_item3_A9[] = {
    0x292E,
    0x2939,
    0x0002,
    0x0000,
};

static u32 l_msg_xy_koukan_item3_AA[] = {
    0x292E,
    0x293A,
    0x0002,
    0x0000,
};

static u32 l_msg_xy_koukan_item3_AB[] = {
    0x292E,
    0x293B,
    0x0002,
    0x0000,
};

static u32 l_msg_xy_koukan_item3_B0[] = {
    0x2992,
    0x2994,
    0x0002,
    0x0000,
};

static u32 l_msg_xy_koukan_item3_B1[] = {
    0x2992,
    0x2995,
    0x0002,
    0x0000,
};

static u32 l_msg_xy_koukan_item3_B2[] = {
    0x2992,
    0x2996,
    0x0002,
    0x0000,
};

static u32 l_msg_xy_koukan_item3_B3[] = {
    0x2992,
    0x2997,
    0x0002,
    0x0000,
};

static u32 l_msg_xy_koukan_item3_B4[] = {
    0x2992,
    0x2998,
    0x0002,
    0x0000,
};

static u32 l_msg_xy_koukan_item3_B5[] = {
    0x2992,
    0x2999,
    0x0002,
    0x0000,
};

static u32 l_msg_xy_koukan_item3_B6[] = {
    0x2992,
    0x299A,
    0x0002,
    0x0000,
};

static u32 l_msg_xy_koukan_item3_B7[] = {
    0x2992,
    0x299B,
    0x0002,
    0x0000,
};

static u32 l_msg_xy_koukan_item3_B8[] = {
    0x2992,
    0x299C,
    0x0002,
    0x0000,
};

static u32 l_msg_xy_koukan_item3_B9[] = {
    0x2992,
    0x299D,
    0x0002,
    0x0000,
};

static u32 l_msg_xy_koukan_item3_BA[] = {
    0x2992,
    0x299E,
    0x0002,
    0x0000,
};

static u32 l_msg_xy_koukan_item3_BB[] = {
    0x2992,
    0x299F,
    0x0002,
    0x0000,
};

static u32 l_msg_xy_koukan_item3_C0[] = {
    0x29F6,
    0x29F8,
    0x0002,
    0x0000,
};

static u32 l_msg_xy_koukan_item3_C1[] = {
    0x29F6,
    0x29F9,
    0x0002,
    0x0000,
};

static u32 l_msg_xy_koukan_item3_C2[] = {
    0x29F6,
    0x29FA,
    0x0002,
    0x0000,
};

static u32 l_msg_xy_koukan_item3_C3[] = {
    0x29F6,
    0x29FB,
    0x0002,
    0x0000,
};

static u32 l_msg_xy_koukan_item3_C4[] = {
    0x29F6,
    0x29FC,
    0x0002,
    0x0000,
};

static u32 l_msg_xy_koukan_item3_C5[] = {
    0x29F6,
    0x29FD,
    0x0002,
    0x0000,
};

static u32 l_msg_xy_koukan_item3_C6[] = {
    0x29F6,
    0x29FE,
    0x0002,
    0x0000,
};

static u32 l_msg_xy_koukan_item3_C7[] = {
    0x29F6,
    0x29FF,
    0x0002,
    0x0000,
};

static u32 l_msg_xy_koukan_item3_C8[] = {
    0x29F6,
    0x2A00,
    0x0002,
    0x0000,
};

static u32 l_msg_xy_koukan_item3_C9[] = {
    0x29F6,
    0x2A01,
    0x0002,
    0x0000,
};

static u32 l_msg_xy_koukan_item3_CA[] = {
    0x29F6,
    0x2A02,
    0x0002,
    0x0000,
};

static u32 l_msg_xy_koukan_item3_CB[] = {
    0x29F6,
    0x2A03,
    0x0002,
    0x0000,
};

static u32* l_msg_xy_koukan_item3[][12] = {
    {
        l_msg_xy_koukan_item3_A0,
        l_msg_xy_koukan_item3_A1,
        l_msg_xy_koukan_item3_A2,
        l_msg_xy_koukan_item3_A3,
        l_msg_xy_koukan_item3_A4,
        l_msg_xy_koukan_item3_A5,
        l_msg_xy_koukan_item3_A6,
        l_msg_xy_koukan_item3_A7,
        l_msg_xy_koukan_item3_A8,
        l_msg_xy_koukan_item3_A9,
        l_msg_xy_koukan_item3_AA,
        l_msg_xy_koukan_item3_AB,
    },
    {
        l_msg_xy_koukan_item3_B0,
        l_msg_xy_koukan_item3_B1,
        l_msg_xy_koukan_item3_B2,
        l_msg_xy_koukan_item3_B3,
        l_msg_xy_koukan_item3_B4,
        l_msg_xy_koukan_item3_B5,
        l_msg_xy_koukan_item3_B6,
        l_msg_xy_koukan_item3_B7,
        l_msg_xy_koukan_item3_B8,
        l_msg_xy_koukan_item3_B9,
        l_msg_xy_koukan_item3_BA,
        l_msg_xy_koukan_item3_BB,
    },
    {
        l_msg_xy_koukan_item3_C0,
        l_msg_xy_koukan_item3_C1,
        l_msg_xy_koukan_item3_C2,
        l_msg_xy_koukan_item3_C3,
        l_msg_xy_koukan_item3_C4,
        l_msg_xy_koukan_item3_C5,
        l_msg_xy_koukan_item3_C6,
        l_msg_xy_koukan_item3_C7,
        l_msg_xy_koukan_item3_C8,
        l_msg_xy_koukan_item3_C9,
        l_msg_xy_koukan_item3_CA,
        l_msg_xy_koukan_item3_CB,
    },
};

static u32 l_msg_xy_koukan_yes[] = {
    0x292E,
    0x2992,
    0x29F6,
};

static u32 l_msg_xy_koukan_no[] = {
    0x292F,
    0x2993,
    0x29F7,
};

static u32 l_msg_xy_koukan_rupee[] = {
    0x293C,
    0x29A0,
    0x2A04,
};

static u32 l_msg_xy_koukan_end[] = {
    0x293D,
    0x29A1,
    0x2A05,
};

static u32 l_msg_xy_koukan_first[] = {
    0x293E,
    0x29A2,
    0x2A06,
};

static u32 l_msg_xy_after_get_demo_A[] = {
    0x293F,
    0x2940,
    0x0000,
};

static u32 l_msg_xy_after_get_demo_B[] = {
    0x29A3,
    0x29A4,
    0x0000,
};

static u32 l_msg_xy_after_get_demo_C[] = {
    0x2A07,
    0x2A08,
    0x0000,
};

static u32* l_msg_xy_after_get_demo[] = {
    l_msg_xy_after_get_demo_A,
    l_msg_xy_after_get_demo_B,
    l_msg_xy_after_get_demo_C,
};

static u32 l_msg_xy_after_get_demo2_A[] = {
    0x2941,
    0x0000,
};

static u32 l_msg_xy_after_get_demo2_B[] = {
    0x29A5,
    0x0000,
};

static u32 l_msg_xy_after_get_demo2_C[] = {
    0x2A09,
    0x0000,
};

static u32* l_msg_xy_after_get_demo2[] = {
    l_msg_xy_after_get_demo2_A,
    l_msg_xy_after_get_demo2_B,
    l_msg_xy_after_get_demo2_C,
};

static u32 l_msg_collect_map[] = {
    0x29A6,
    0x0000
};

static u32 l_msg_try_force[] = {
    0x29A7,
    0x29A8,
    0x29A9,
    0x29AA,
    0x0003,
    0x29AB,
    0x0000
};

static u32 l_get_item_no[] = {
    dItem_HEART_PIECE_e,
};

static dCcD_SrcSph l_sph_src = {
    // dCcD_SrcGObjInf
    {
        /* Flags             */ 0,
        /* SrcObjAt  Type    */ 0,
        /* SrcObjAt  Atp     */ 0,
        /* SrcObjAt  SPrm    */ 0,
        /* SrcObjTg  Type    */ AT_TYPE_WIND,
        /* SrcObjTg  SPrm    */ cCcD_TgSPrm_Set_e | cCcD_TgSPrm_IsEnemy_e,
        /* SrcObjCo  SPrm    */ 0,
        /* SrcGObjAt Se      */ 0,
        /* SrcGObjAt HitMark */ 0,
        /* SrcGObjAt Spl     */ 0,
        /* SrcGObjAt Mtrl    */ 0,
        /* SrcGObjAt SPrm    */ 0,
        /* SrcGObjTg Se      */ 0,
        /* SrcGObjTg HitMark */ 0,
        /* SrcGObjTg Spl     */ 0,
        /* SrcGObjTg Mtrl    */ 0,
        /* SrcGObjTg SPrm    */ dCcG_TgSPrm_NoHitMark_e,
        /* SrcGObjCo SPrm    */ 0,
    },
    // cM3dGSphS
    {
        /* Center */ 0.0f, 0.0f, 0.0f,
        /* Radius */ 50.0f,
    },
};

static char* l_npc_staff_id[] = {
    "Roten",
    "Roten",
    "Roten",
};

const char daNpcRoten_c::m_arcname[] = "Ro";

static const int l_bmd_ix_tbl[] = {
    RO_BDL_RO,
    RO_BDL_RO,
    RO_BDL_RO,
};

static const int l_bck_ix_tbl[][10] = {
    {
        RO_BCK_RO_WAIT01,
        RO_BCK_RO_TALK01,
        RO_BCK_RO_WALK,
        RO_BCK_RO_TALK02,
        RO_BCK_RO_TALK03,
        RO_BCK_RO_TALK04,
        RO_BCK_RO_TALK05,
        RO_BCK_RO_WATASU,
        RO_BCK_RO_ITEMWAIT,
        RO_BCK_RO_WIND,
    },
    {
        RO_BCK_RO_WAIT01,
        RO_BCK_RO_TALK01,
        RO_BCK_RO_WALK,
        RO_BCK_RO_TALK02,
        RO_BCK_RO_TALK03,
        RO_BCK_RO_TALK04,
        RO_BCK_RO_TALK05,
        RO_BCK_RO_WATASU,
        RO_BCK_RO_ITEMWAIT,
        RO_BCK_RO_WIND,
    },
    {
        RO_BCK_RO_WAIT01,
        RO_BCK_RO_TALK01,
        RO_BCK_RO_WALK,
        RO_BCK_RO_TALK02,
        RO_BCK_RO_TALK03,
        RO_BCK_RO_TALK04,
        RO_BCK_RO_TALK05,
        RO_BCK_RO_WATASU,
        RO_BCK_RO_ITEMWAIT,
        RO_BCK_RO_WIND,
    },
};

static const int l_head_bmd_ix_tbl[] = {
    RO_BDL_RO_HAT,
    RO_BDL_RO_HAT2,
    RO_BDL_RO_HAT3,
};

static const int l_head_bck_ix_tbl[] = {
    RO_BCK_HAT_WID,
    RO_BCK_HAT2_WIND,
    RO_BCK_HAT3_WID,
};

static const int l_btp_ix_tbl[] = {
    RO_BTP_RO,
    RO_BTP_RO,
    RO_BTP_RO,
};

static const int l_bmt_ix_tbl[] = {
    -1,
    RO_BMT_RO2,
    RO_BMT_RO3,
};

static const int l_diff_flag_tbl[] = {
    0x11020022,
    0x37461622,
    0x37461622,
};

struct SaveDatStruct {
    /* 0x00 */ u16 field_0x00;
    /* 0x02 */ u16 field_0x02;
    /* 0x04 */ u16 field_0x04;
    /* 0x06 */ u16 field_0x06;
}; // Size: 0x08

static const SaveDatStruct l_save_dat[] = {
    {
        0x1320,
        0xCB03,
        0xC803,
        0x1304,
    },
    {
        0x1310,
        0xCA03,
        0xC703,
        0x1302,
    },
    {
        0x1308,
        0xC903,
        0xC603,
        0x1301,
    },
};

static const u8 l_item_dat[][12] = {
    {
        0x01,
        0x00,
        0x07,
        0x04,
        0x09,
        0x03,
        0x07,
        0x09,
        0x09,
        0x07,
        0x09,
        0x0A,
    },
    {
        0x01,
        0x02,
        0x01,
        0x0A,
        0x09,
        0x03,
        0x02,
        0x09,
        0x09,
        0x08,
        0x09,
        0x0A,
    },
    {
        0x01,
        0x00,
        0x06,
        0x05,
        0x07,
        0x04,
        0x02,
        0x04,
        0x05,
        0x05,
        0x0B,
        0x0A,
    },
};

/* 00000078-000002F0       .text __ct__12daNpcRoten_cFv */
