//
// Generated by dtk
// Translation Unit: d_a_auction.cpp
//

#include "d/actor/d_a_auction.h"
#include "d/actor/d_a_npc_auction.h"
#include "d/actor/d_a_player.h"
#include "d/actor/d_a_player_main.h"
#include "d/d_camera.h"
#include "d/d_procname.h"
#include "d/d_priority.h"
#include "m_Do/m_Do_controller_pad.h"

#include "weak_bss_936_to_1036.h" // IWYU pragma: keep
#include "weak_data_1811.h" // IWYU pragma: keep

struct NpcDatStruct {
    /* 0x00 */ f32 field_0x00;
    /* 0x04 */ f32 field_0x04;
    /* 0x08 */ s16 mBidIncMin; // Minimum bid increment
    /* 0x0A */ s16 mBidIncMax; // Maximum bid increment
    /* 0x0C */ s16 mSpendingLimit;
};

struct NpcMsgDatStruct {
    /* 0x00 */ s16 field_0x00;
    /* 0x02 */ s16 field_0x02;
    /* 0x04 */ s16 field_0x04;
    /* 0x06 */ s16 field_0x06;
    /* 0x08 */ s16 field_0x08;
};

struct NpcCameraDatStruct {
    /* 0x00 */ f32 field_0x00;
    /* 0x04 */ f32 field_0x04;
    /* 0x08 */ s16 field_0x08;
    /* 0x0A */ s16 field_0x0A;
};

static cXyz l_camera_pos[][2] = {
    {cXyz(-265.0f, 48.0f, -631.0f), cXyz(332.0f, 232.0f, 286.0f)},
    {cXyz(-50.0f, 202.0f, 137.0f), cXyz(-87.0f, 239.0f, 330.0f)},
    {cXyz(-216.0f, 205.0f, 5.0f), cXyz(-379.0f, 238.0f, 115.0f)},
};

#ifdef DEBUG
static daAuction_HIO_c l_HIO;
#endif


static daAuction_c::ItemData l_item_dat[] = {
    {dItem_JOY_PENDANT_e, 0x1D10, 40, 0x0F01},
    {dItem_COLLECT_MAP_27_e, 0x1D11, 5, 0x1080},
    {dItem_COLLECT_MAP_18_e, 0x1D12, 60, 0x1040},
    {dItem_HEART_PIECE_e, 0x1D13, 80, 0x1020},
};

static daAuction_c::ItemData l_item_dat2[] = {
    {POSTMAN_STATUE, 0x1D14, 30, 0x1008},
    {PRESIDENT_STATUE, 0x1D15, 40, 0x1004},
};

static s16 l_item_dat22[] = {0x002A, 0x00F9};

static NpcDatStruct l_npc_dat[7] = {
    {2.0f, 2.1f, 0x0, 0x0, 1000},
    {0.3f, 0.5f, 0x4, 0x6, 450 },
    {0.3f, 0.6f, 0x3, 0x7, 500 },
    {0.4f, 0.7f, 0x2, 0x4, 250 },
    {0.5f, 1.0f, 0x2, 0x3, VERSION_SELECT(998, 998, 990, 990) },
