/**
 * d_a_bgn.cpp
 * Boss - Puppet Ganon (Phase 1) / Ｇ（クグツ）(G (Puppet))
 */

#include "d/dolzel_rel.h" // IWYU pragma: keep
#include "d/actor/d_a_bgn.h"
#include "d/actor/d_a_bgn2.h"
#include "d/actor/d_a_bgn3.h"
#include "d/actor/d_a_bomb.h"
#include "d/actor/d_a_ki.h"
#include "d/actor/d_a_ks.h"
#include "d/actor/d_a_player.h"
#include "d/d_meter.h"
#include "d/d_procname.h"
#include "d/d_priority.h"
#include "d/d_s_play.h"
#include "d/d_snap.h"
#include "d/res/res_bgn.h"
#include "dolphin/gf/GFGeometry.h"
#include "f_op/f_op_actor_mng.h"
#include "d/d_cc_d.h"
#include "f_op/f_op_camera.h"
#include "m_Do/m_Do_graphic.h"
#include "JSystem/JUtility/JUTReport.h"

class daBgn_HIO_c : public JORReflexible {
public:
    daBgn_HIO_c();
    virtual ~daBgn_HIO_c() {};
    void genMessage(JORMContext*) {}

public:
    /* 0x004 */ s16 m004;
    /* 0x006 */ s8 mNo;
    /* 0x007 */ u8 m007[0x008 - 0x007];
    /* 0x008 */ f32 m008;
    /* 0x00C */ u8 m00C;
    /* 0x00D */ u8 m00D;
    /* 0x00E */ u8 m00E[0x010 - 0x00E];
    /* 0x010 */ f32 m010;
    /* 0x014 */ s16 m014;
    /* 0x016 */ s16 m016;
    /* 0x018 */ s16 m018;
    /* 0x01A */ u8 m01A[0x01C - 0x01A];
    /* 0x01C */ f32 m01C;
    /* 0x020 */ f32 m020;
    /* 0x024 */ u8 m024;
    /* 0x025 */ u8 m025;
    /* 0x026 */ u8 m026;
    /* 0x027 */ u8 m027;
    /* 0x028 */ u8 m028;
    /* 0x029 */ u8 m029;
    /* 0x02A */ u8 m02A;
    /* 0x02B */ u8 m02B;
    /* 0x02C */ u8 m02C;
    /* 0x02D */ u8 m02D;
    /* 0x02E */ u8 m02E;
    /* 0x02F */ u8 m02F;
    /* 0x030 */ u8 m030;
    /* 0x031 */ u8 m031[0x034 - 0x031];
    /* 0x034 */ f32 m034;
    /* 0x038 */ f32 m038;
    /* 0x03C */ s16 m03C;
    /* 0x03E */ s16 m03E;
    /* 0x040 */ s16 m040;
    /* 0x042 */ s16 m042;
    /* 0x044 */ s16 m044;
    /* 0x046 */ u8 m046[0x048 - 0x046];
    /* 0x048 */ f32 m048;
    /* 0x04C */ f32 m04C;
    /* 0x050 */ f32 m050;
    /* 0x054 */ cXyz m054;
    /* 0x060 */ cXyz m060;
    /* 0x06C */ cXyz m06C;
    /* 0x078 */ cXyz m078;
    /* 0x084 */ cXyz m084;
    /* 0x090 */ cXyz m090;
    /* 0x09C */ cXyz m09C;
    /* 0x0A8 */ s16 m0A8;
    /* 0x0AA */ csXyz m0AA;
    /* 0x0B0 */ csXyz m0B0;
    /* 0x0B6 */ csXyz m0B6;
    /* 0x0BC */ csXyz m0BC;
    /* 0x0C2 */ csXyz m0C2;
    /* 0x0C8 */ csXyz m0C8;
    /* 0x0CE */ csXyz m0CE;
    /* 0x0D4 */ f32 m0D4;
    /* 0x0D8 */ s16 m0D8;
    /* 0x0DA */ s16 m0DA;
    /* 0x0DC */ s16 m0DC;
    /* 0x0DE */ s16 m0DE;
    /* 0x0E0 */ s16 m0E0;
    /* 0x0E2 */ s16 m0E2;
    /* 0x0E4 */ s16 m0E4;
    /* 0x0E6 */ s16 m0E6;
    /* 0x0E8 */ s16 m0E8;
    /* 0x0EA */ s16 m0EA;
    /* 0x0EC */ s16 m0EC;
    /* 0x0EE */ s16 m0EE;
    /* 0x0F0 */ s16 m0F0;
    /* 0x0F2 */ s16 m0F2;
    /* 0x0F4 */ f32 m0F4;
    /* 0x0F8 */ f32 m0F8;
    /* 0x0FC */ f32 m0FC;
    /* 0x100 */ f32 m100;
    /* 0x104 */ f32 m104;
    /* 0x108 */ f32 m108;
    /* 0x10C */ f32 m10C;
    /* 0x110 */ f32 m110;
    /* 0x114 */ f32 m114;
    /* 0x118 */ f32 m118;
    /* 0x11C */ f32 m11C;
    /* 0x120 */ f32 m120;
    /* 0x124 */ f32 m124;
    /* 0x128 */ f32 m128;
    /* 0x12C */ cXyz m12C;
    /* 0x138 */ cXyz m138;
    /* 0x144 */ cXyz m144;
    /* 0x150 */ cXyz m150;
    /* 0x15C */ cXyz m15C;
    /* 0x168 */ f32 m168;
    /* 0x16C */ f32 m16C;
    /* 0x170 */ f32 m170;
    /* 0x174 */ s16 m174;
    /* 0x176 */ s16 m176;
    /* 0x178 */ s16 m178;
    /* 0x17A */ s16 m17A;
}; // Size: 0x17C

/* 000000EC-000003F0       .text __ct__11daBgn_HIO_cFv */
daBgn_HIO_c::daBgn_HIO_c() {
    mNo = 0xff;
    m00C = 1;
    m00D = 1;
    m010 = 50.0f;
    m014 = 10;
    m016 = 10;
    m018 = 0x50;
    m01C = 1000.0f;
    m020 = 10000.0f;
    m025 = 0;
    m026 = 0;
    m027 = 0;
    m024 = 0;
    m028 = 1;
    m008 = 200.0f;
    m004 = 0;
    m029 = 0;
    m02A = 0;
    m02B = 0;
    m02C = 0;
    m02D = 0;
    m02E = 0;
    m02F = 0;
    m030 = 0;
    m034 = -20.0f;
    m038 = -30.0f;
    m03C = 0;
    m03E = 22000;
    m040 = 0;
    m042 = 0;
    m044 = 0;
    m048 = 0.0f;
    m04C = 950.0f;
    m050 = 0.0f;
    m054.set(0.0f, 2000.0f, 800.0f);
    m060.set(0.0f, -800.0f, -800.0f);
    m06C.set(700.0f, -900.0f, 300.0f);
    m078.set(-700.0f, -900.0f, 300.0f);
    m084.set(500.0f, -1300.0f, -100.0f);
    m090.set(-500.0f, -1300.0f, -100.0f);
    m09C.set(0.0f, -700.0f, -1200.0f);
    m0A8 = 0;
    m0AA.set(0, 0, 0);
    m0B0.set(0, 0, 0);
