/**
 * d_a_fm.cpp
 * Enemy - Floormaster
 */

#include "d/dolzel_rel.h" // IWYU pragma: keep
#include "d/actor/d_a_fm.h"
#include "d/actor/d_a_player_main.h"
#include "d/d_procname.h"
#include "d/d_priority.h"
#include "d/d_cc_d.h"
#include "d/d_lib.h"
#include "d/d_jnt_hit.h"
#include "d/d_snap.h"
#include "d/d_material.h"
#include "d/actor/d_a_bomb.h"
#include "d/actor/d_a_tsubo.h"
#include "d/actor/d_a_npc_cb1.h"
#include "d/actor/d_a_npc_md.h"
#include "d/d_s_play.h"
#include "d/d_a_obj.h"
#include "d/res/res_fm.h"
#include "d/actor/d_a_player_main_data.h"


const u32 daFm_c::m_heapsize = 0x2100;
const char daFm_c::m_arc_name[] = "Fm";

const dCcD_SrcSph daFm_c::m_sph_src = {
    // dCcD_SrcGObjInf
    {
        /* Flags             */ 0,
        /* SrcObjAt  Type    */ 0,
        /* SrcObjAt  Atp     */ 0,
        /* SrcObjAt  SPrm    */ 0,
        /* SrcObjTg  Type    */ AT_TYPE_ALL & ~AT_TYPE_UNK8 & ~AT_TYPE_WATER & ~AT_TYPE_UNK20000 & ~AT_TYPE_UNK400000,
        /* SrcObjTg  SPrm    */ cCcD_TgSPrm_Set_e | cCcD_TgSPrm_IsOther_e,
        /* SrcObjCo  SPrm    */ cCcD_CoSPrm_Set_e | cCcD_CoSPrm_IsOther_e | cCcD_CoSPrm_VsEnemy_e | cCcD_CoSPrm_NoCrr_e,
        /* SrcGObjAt Se      */ 0,
        /* SrcGObjAt HitMark */ dCcG_AtHitMark_None_e,
        /* SrcGObjAt Spl     */ dCcG_At_Spl_UNK0,
        /* SrcGObjAt Mtrl    */ 0,
        /* SrcGObjAt SPrm    */ 0,
        /* SrcGObjTg Se      */ dCcG_SE_UNK23,
        /* SrcGObjTg HitMark */ 0,
        /* SrcGObjTg Spl     */ dCcG_Tg_Spl_UNK0,
        /* SrcGObjTg Mtrl    */ 0,
        /* SrcGObjTg SPrm    */ dCcG_TgSPrm_NoConHit_e | dCcG_TgSPrm_NoHitMark_e,
        /* SrcGObjCo SPrm    */ 0,
    },
    // cM3dGSphS
    {{
        /* Center */ {0.0f, 0.0f, 0.0f},
        /* Radius */ 60.0f,
    }},
};


const dCcD_SrcCyl daFm_c::m_cyl_src = {
    // dCcD_SrcGObjInf
    {
        /* Flags             */ 0,
        /* SrcObjAt  Type    */ AT_TYPE_UNK800,
        /* SrcObjAt  Atp     */ 0,
        /* SrcObjAt  SPrm    */ 0,
        /* SrcObjTg  Type    */ AT_TYPE_ALL & ~AT_TYPE_WATER & ~AT_TYPE_UNK20000 & ~AT_TYPE_WIND & ~AT_TYPE_UNK400000 & ~AT_TYPE_LIGHT,
        /* SrcObjTg  SPrm    */ 0,
        /* SrcObjCo  SPrm    */ cCcD_CoSPrm_Set_e | cCcD_CoSPrm_IsOther_e | cCcD_CoSPrm_VsEnemy_e | cCcD_CoSPrm_NoCrr_e,
        /* SrcGObjAt Se      */ 0,
        /* SrcGObjAt HitMark */ dCcG_AtHitMark_None_e,
        /* SrcGObjAt Spl     */ dCcG_At_Spl_UNK0,
        /* SrcGObjAt Mtrl    */ 0,
        /* SrcGObjAt SPrm    */ 0,
        /* SrcGObjTg Se      */ dCcG_SE_UNK23,
        /* SrcGObjTg HitMark */ 0,
        /* SrcGObjTg Spl     */ dCcG_Tg_Spl_UNK0,
        /* SrcGObjTg Mtrl    */ 0,
        /* SrcGObjTg SPrm    */ 0,
        /* SrcGObjCo SPrm    */ 0,
    },
    // cM3dGCylS
    {{
        /* Center */ {0.0f, 0.0f, 0.0f},
        /* Radius */ 60.0f,
        /* Height */ 0.0f,
    }},
};

class daFm_HIO_c : public mDoHIO_entry_c{
public:
    daFm_HIO_c();
    virtual ~daFm_HIO_c() {};
    void genMessage(JORMContext* ctx) {}

public:
    /* 0x004 */ s8 field_0x004;
    /* 0x005 */ s8 field_0x005;
    /* 0x006 */ s8 field_0x006;
    /* 0x007 */ s8 field_0x007;
    /* 0x008 */ s8 field_0x008;
    /* 0x009 */ u8 field_0x009;
    /* 0x00A */ s8 field_0x00A;
    /* 0x00B */ s8 field_0x00B;
    /* 0x00C */ s8 field_0x00C;
    /* 0x00D */ u8 field_0x00D;
    /* 0x00E */ s8 field_0x00E;
    /* 0x00F */ u8 field_0x00F[6];
    /* 0x015 */ s8 field_0x015[10];
    /* 0x01F */ u8 field_0x01F;
    /* 0x020 */ cXyz field_0x020;
    /* 0x02C */ cXyz field_0x02C;
    /* 0x038 */ cXyz field_0x038;
    /* 0x044 */ f32 field_0x044;
    /* 0x048 */ f32 field_0x048;
    /* 0x04C */ f32 field_0x04C;
    /* 0x050 */ f32 field_0x050;
    /* 0x054 */ f32 field_0x054;
    /* 0x058 */ f32 field_0x058;
    /* 0x05C */ s16 field_0x05C;
    /* 0x05E */ s16 field_0x05E;
    /* 0x060 */ s16 field_0x060;
    /* 0x062 */ s16 field_0x062;
    /* 0x064 */ s16 mMaxHealth;
    /* 0x066 */ s16 field_0x066;
    /* 0x068 */ s16 field_0x068;
    /* 0x06A */ s16 field_0x06A;
    /* 0x06C */ f32 mSpAttackVJumpHeight;
    /* 0x070 */ f32 mSpAttackVJumpRadius;
    /* 0x074 */ s16 mSpAttackVJumpStartFrame;
    /* 0x076 */ s16 mSpAttackVJumpEndFrame;
    /* 0x078 */ f32 mSpAttackJumpHeight;
    /* 0x07C */ f32 mSpAttackJumpRadius;
    /* 0x080 */ s16 mSpAttackJumpStartFrame;
    /* 0x082 */ s16 mSpAttackJumpEndFrame;
    /* 0x084 */ s16 field_0x084;
    /* 0x086 */ s16 field_0x086;
    /* 0x088 */ s16 field_0x088;
    /* 0x08A */ s16 field_0x08A;
    /* 0x08C */ s16 field_0x08C;
    /* 0x08E */ s16 field_0x08E;
    /* 0x090 */ s16 field_0x090;
    /* 0x092 */ s16 field_0x092;
    /* 0x094 */ s16 field_0x094;
    /* 0x096 */ s16 field_0x096;
    /* 0x098 */ s16 field_0x098;
    /* 0x09A */ s16 field_0x09A;
    /* 0x09C */ s16 field_0x09C;
    /* 0x09E */ s16 field_0x09E;
    /* 0x0A0 */ s16 field_0x0A0;
    /* 0x0A2 */ s16 field_0x0A2;
    /* 0x0A4 */ s16 field_0x0A4;
    /* 0x0A6 */ s16 field_0x0A6;
    /* 0x0A8 */ f32 field_0x0A8;
    /* 0x0AC */ f32 field_0x0AC;
    /* 0x0B0 */ f32 field_0x0B0;
    /* 0x0B4 */ f32 field_0x0B4;
    /* 0x0B8 */ f32 field_0x0B8;
    /* 0x0BC */ f32 field_0x0BC;
    /* 0x0C0 */ f32 field_0x0C0;
    /* 0x0C4 */ f32 field_0x0C4;
    /* 0x0C8 */ f32 field_0x0C8;
    /* 0x0CC */ f32 field_0x0CC;
    /* 0x0D0 */ f32 field_0x0D0;
    /* 0x0D4 */ f32 field_0x0D4;
    /* 0x0D8 */ f32 field_0x0D8;
    /* 0x0DC */ f32 field_0x0DC;
    /* 0x0E0 */ f32 field_0x0E0;
    /* 0x0E4 */ f32 field_0x0E4;
    /* 0x0E8 */ f32 field_0x0E8;
    /* 0x0EC */ f32 field_0x0EC;
    /* 0x0F0 */ f32 field_0x0F0;
    /* 0x0F4 */ f32 field_0x0F4;
    /* 0x0F8 */ f32 field_0x0F8;
    /* 0x0FC */ f32 field_0x0FC;
    /* 0x100 */ s16 field_0x100;
    /* 0x102 */ u8 field_0x102[0x104 - 0x102];
    /* 0x104 */ cXyz field_0x104;
    /* 0x110 */ f32 field_0x110;
    /* 0x114 */ f32 field_0x114;
    /* 0x118 */ f32 field_0x118;
    /* 0x11C */ s16 field_0x11C;
    /* 0x11E */ s16 field_0x11E;
    /* 0x120 */ f32 field_0x120;
    /* 0x124 */ f32 field_0x124;
    /* 0x128 */ f32 field_0x128;
    /* 0x12C */ f32 field_0x12C;
    /* 0x130 */ JntHit_HIO_c field_0x130;
};  // Size: 0x15C

static daFm_HIO_c l_HIO;

/* 000000EC-000003EC       .text __ct__10daFm_HIO_cFv */
daFm_HIO_c::daFm_HIO_c() {
    field_0x006 = 0;
    field_0x007 = 0;
    field_0x008 = 0;
    field_0x004 = 0;
    field_0x01F = 0;
    field_0x00B = 0;
    field_0x009 = 0;
    field_0x00A = 0;
    field_0x00C = 0;
    field_0x005 = 0;

    field_0x068 = 0x1e;
    mSpAttackVJumpHeight = 240.0f;
    mSpAttackVJumpRadius = 100.0f;
    mSpAttackVJumpStartFrame = 0;
    mSpAttackVJumpEndFrame = 0xF;
    mSpAttackJumpHeight = 120.0f;
    mSpAttackJumpRadius = 100.0f;
    mSpAttackJumpStartFrame = 5;
    mSpAttackJumpEndFrame = 0xF;
    field_0x11C = 100;
    field_0x00E = 0;
    field_0x00D = 0;
    field_0x062 = 0x78;

    for (int i = 0; i < 6; i++) {
        switch (i) {
            case 0:
            case 1:
            case 2:
            case 3:
            case 5:
                field_0x00F[i] = 1;
                break;

