/**
 * d_a_bmd.cpp
 * Boss - Kalle Demos (Core) / 森ボス (Forest Boss)
 */

#include "d/dolzel_rel.h" // IWYU pragma: keep
#include "d/actor/d_a_bmd.h"
#include "d/actor/d_a_player.h"
#include "d/d_bg_s_movebg_actor.h"
#include "d/d_camera.h"
#include "d/d_kankyo_wether.h"
#include "d/d_lib.h"
#include "d/res/res_bmd.h"
#include "d/d_procname.h"
#include "d/d_priority.h"
#include "d/d_cc_d.h"
#include "d/d_s_play.h"
#include "d/d_snap.h"
#include "f_op/f_op_camera.h"
#include "JSystem/JUtility/JUTReport.h"
#include "m_Do/m_Do_graphic.h"

class daBmd_HIO_c : public JORReflexible {
public:
    daBmd_HIO_c();
    virtual ~daBmd_HIO_c() {}
    void genMessage(JORMContext*) {}

public:
    /* 0x04 */ s8 mNo;
    /* 0x05 */ u8 m05;
    /* 0x06 */ u8 m06;
    /* 0x07 */ u8 m07;
    /* 0x08 */ f32 m08;
    /* 0x0C */ f32 m0C;
    /* 0x10 */ f32 m10;
    /* 0x14 */ s16 m14;
};

/* 000000EC-00000134       .text __ct__11daBmd_HIO_cFv */
daBmd_HIO_c::daBmd_HIO_c() {
    mNo = 0xFF;
    m05 = 0;
    m08 = 0.8f;
    m14 = 100;
    m0C = 1.0f;
    m10 = 0.5f;
}

static cXyz static_center_pos; // Unused
static daBmd_HIO_c l_HIO;

/* 00000134-00000240       .text core_nodeCallBack__FP7J3DNodei */
static BOOL core_nodeCallBack(J3DNode* node, int calcTiming) {
    if (calcTiming == 0) {
        J3DJoint* joint = (J3DJoint*)node;
        s32 jntNo = joint->getJntNo();
        J3DModel* model = j3dSys.getModel();
        bmd_class* i_this = (bmd_class*)model->getUserArea();
        if (((i_this != 0) && (jntNo != 0)) && (jntNo != 5)) {
            MTXCopy(model->getAnmMtx(jntNo), *calc_mtx);
            if (jntNo < 7) {
                cMtx_XrotM(*calc_mtx, i_this->m90C[0].x);
                cMtx_ZrotM(*calc_mtx, i_this->m90C[0].z);
            } else {
                cMtx_XrotM(*calc_mtx, i_this->m90C[1].x);
