//
// Generated by dtk
// Translation Unit: d_a_npc_md.cpp
//

#include "d/actor/d_a_npc_md.h"
#include "d/d_procname.h"
#include "d/d_com_inf_game.h"
#include "d/d_item_data.h"
#include "m_Do/m_Do_controller_pad.h"
#include "m_Do/m_Do_mtx.h"
#include "d/actor/d_a_player_main.h"
#include "d/d_snap.h"
#include "d/actor/d_a_ship.h"
#include "d/d_kankyo_wether.h"
#include "d/d_camera.h"
#include "d/d_detect.h"

// Needed for the .data section to match.
static f32 dummy1[3] = {1.0f, 1.0f, 1.0f};
static f32 dummy2[3] = {1.0f, 1.0f, 1.0f};
static u8 dummy3[4] = {0x02, 0x00, 0x02, 0x01};
static f64 dummy4[2] = {3.0, 0.5};

static u8 temp[0x4C]; // TODO

static daNpc_Md_HIO_c l_HIO;

static cXyz l_ms_light_local_vec;
static cXyz l_ms_light_local_start;

static char* l_arc_name = "Md";
static char* l_arc_name_ship = "Md_ship";
static char* l_staff_name = "Md1";

static char* event_name_tbl[] = {
    "Md_ItemGet",
    "Md_RopeGet",
    "MD_FLY",
    "md_cliff",
    "Md_Fly2",
    "Md_Tact",
    "Md_TactTrue",
    "Md_HarpTalk",
    "OPTION_CHAR_END",
    "DEFAULT_TALK_XY",
};

static dCcD_SrcCyl l_cyl_src = {
    // dCcD_SrcGObjInf
    {
        /* Flags             */ 0,
        /* SrcObjAt  Type    */ 0,
        /* SrcObjAt  Atp     */ 0,
        /* SrcObjAt  SPrm    */ 0,
        /* SrcObjTg  Type    */ ~(AT_TYPE_BOOMERANG | AT_TYPE_LEAF_WIND | AT_TYPE_LIGHT),
        /* SrcObjTg  SPrm    */ TG_SPRM_SET | TG_SPRM_UNK4,

/* 0000C2C4-0000C360       .text initialOnetimeEvent__10daNpc_Md_cFi */
void daNpc_Md_c::initialOnetimeEvent(int) {
    /* Nonmatching */
}

/* 0000C360-0000C3C4       .text actionOnetimeEvent__10daNpc_Md_cFi */
bool daNpc_Md_c::actionOnetimeEvent(int) {
    if (m312A != 0) {
        if (m3104 == 0x1A) {
            setAnm(0);
        } else {
            return true;
        }
    }
    setAttention(true);
    return false;
}

/* 0000C3C4-0000C48C       .text initialQuake__10daNpc_Md_cFi */
void daNpc_Md_c::initialQuake(int) {
    /* Nonmatching */
}

/* 0000C48C-0000C4DC       .text setHarpPlayNum__10daNpc_Md_cFi */
void daNpc_Md_c::setHarpPlayNum(int) {
    /* Nonmatching */
}

/* 0000C4DC-0000C500       .text initialHarpPlayEvent__10daNpc_Md_cFi */
void daNpc_Md_c::initialHarpPlayEvent(int) {
    setHarpPlayNum(0);
}

/* 0000C500-0000C554       .text actionHarpPlayEvent__10daNpc_Md_cFi */
bool daNpc_Md_c::actionHarpPlayEvent(int) {
    if (m312A != 0) {
        setHarpPlayNum(0);
    }
    if (daPy_getPlayerLinkActorClass()->checkEndTactMusic()) {
        return true;
    }
    return false;
}

/* 0000C554-0000C570       .text initialOffLinkEvent__10daNpc_Md_cFi */
void daNpc_Md_c::initialOffLinkEvent(int) {
    daPy_getPlayerLinkActorClass()->onPlayerNoDraw();
}

/* 0000C570-0000C58C       .text initialOnLinkEvent__10daNpc_Md_cFi */
void daNpc_Md_c::initialOnLinkEvent(int) {
    daPy_getPlayerLinkActorClass()->offPlayerNoDraw();
}

/* 0000C58C-0000C654       .text initialTurnEvent__10daNpc_Md_cFi */
void daNpc_Md_c::initialTurnEvent(int) {
    /* Nonmatching */
}

/* 0000C654-0000C7CC       .text actionTurnEvent__10daNpc_Md_cFi */
bool daNpc_Md_c::actionTurnEvent(int) {
    /* Nonmatching */
}

/* 0000C7CC-0000CA5C       .text initialSetAnmEvent__10daNpc_Md_cFi */
void daNpc_Md_c::initialSetAnmEvent(int) {
    /* Nonmatching */
}

/* 0000CA5C-0000CA80       .text initialLookDown__10daNpc_Md_cFi */
void daNpc_Md_c::initialLookDown(int) {
    setAnm(0x2F);
}

/* 0000CA80-0000CAA4       .text initialLookUp__10daNpc_Md_cFi */
void daNpc_Md_c::initialLookUp(int) {
    setAnm(5);
}

/* 0000CAA4-0000CB8C       .text actionLookDown__10daNpc_Md_cFi */
bool daNpc_Md_c::actionLookDown(int) {
    /* Nonmatching */
}

/* 0000CB8C-0000CC10       .text talk_init__10daNpc_Md_cFv */
bool daNpc_Md_c::talk_init() {
    if (l_msgId == fpcM_ERROR_PROCESS_ID_e) {
        if (mMsgId == 0x5AC) {
            l_msgId = fopMsgM_tactMessageSet();
        } else {
            l_msgId = fopMsgM_messageSet(mMsgId, this);
        }
    } else {
        l_msg = fopMsgM_SearchByID(l_msgId);
        if (l_msg) {
            return true;
        }
    }
    return false;
}

/* 0000CC10-0000CDCC       .text talk__10daNpc_Md_cFi */
BOOL daNpc_Md_c::talk(int) {
    /* Nonmatching */
}

/* 0000CDCC-0000CDF4       .text getAnmType__10daNpc_Md_cFUc */
void daNpc_Md_c::getAnmType(u8) {
    /* Nonmatching */
}

/* 0000CDF4-0000CF18       .text initTexPatternAnm__10daNpc_Md_cFUcb */
BOOL daNpc_Md_c::initTexPatternAnm(u8 btpIdx, bool param_2) {
    struct btp_anm_tbl {
        /* 0x00 */ char m00[0x20];
        /* 0x20 */ u8 m20;
    };
    static btp_anm_tbl btpAnmTbl[] = {
        {}, // TODO
    };
    
    J3DModelData* modelData = mpMorf->getModel()->getModelData();
    bool ret = false;
    J3DAnmTexPattern* eyeTexPtrn = (J3DAnmTexPattern*)dComIfG_getObjectRes(mModelArcName, btpAnmTbl[btpIdx].m00);
    JUT_ASSERT(7502, eyeTexPtrn != 0);
    if (m0520.init(modelData, eyeTexPtrn, 1, 1, 1.0f, 0, -1, param_2, 0)) {
        m3112 = eyeTexPtrn->getFrameMax();
        m3133 = 0;
        m3136 = btpAnmTbl[btpIdx].m20;
        m3137 = btpIdx;
        ret = true;
    }
    
    return ret;
}

/* 0000CF18-0000CFCC       .text playTexPatternAnm__10daNpc_Md_cFv */
void daNpc_Md_c::playTexPatternAnm() {
    /* Nonmatching */
}

/* 0000CFCC-0000D0B8       .text initLightBtkAnm__10daNpc_Md_cFb */
BOOL daNpc_Md_c::initLightBtkAnm(bool) {
    /* Nonmatching */
}

/* 0000D0B8-0000D0DC       .text playLightBtkAnm__10daNpc_Md_cFv */
void daNpc_Md_c::playLightBtkAnm() {
    mLightBtkAnm.play();
}

/* 0000D0DC-0000D4CC       .text setAnm__10daNpc_Md_cFi */
bool daNpc_Md_c::setAnm(int anmIdx) {
    struct anm_tbl {
        /* 0x00 */ char m00[0x20];
        /* 0x20 */ char m20[0x20];
    };
    struct anm_prm {
        /* 0x00 */ s8 m00;
        /* 0x01 */ u8 m01;
        /* 0x02 */ u8 m02;
        /* 0x04 */ int loopMode;
        /* 0x08 */ f32 morf;
        /* 0x0C */ f32 speed;
    };

    static anm_tbl l_anmTbl[0x27] = {
        // TODO
    };
    static anm_prm l_anmPrm[0x32] = {
        // TODO
    };
    static anm_tbl armAnmTbl[0x20] = {
        // TODO
    };
    static anm_tbl wingAnmTbl[8] = {
        // TODO
    };
    
    bool ret = false;
    
    m3104 = anmIdx;
    anm_prm* prm = &l_anmPrm[anmIdx];
    
    f32 speed = prm->speed;
    f32 morf = prm->morf;
    if (anmIdx == 6) {
        speed = l_HIO.m118;
    } else if (anmIdx == 9 || anmIdx == 0xA) {
        speed = l_HIO.m11C;
    } else if (anmIdx == 0x2E) {
        speed = l_HIO.m124;
    } else if (anmIdx == 0x28) {
        morf = l_HIO.m068.m4;
        speed = l_HIO.m068.m8;
    }
    if (anmIdx == 7 || anmIdx == 8) {
        morf = l_HIO.m1A8;
    }
    
    if (prm->m00 != m312D || mpMorf->getPlaySpeed() != prm->speed) {
        m312D = prm->m00;
        anm_tbl* bodyAnm = &l_anmTbl[m312D];
        m312A = 0;
