/**
 * d_a_npc_md.cpp
 * Player - Medli
 */

#include "d/actor/d_a_npc_md.h"
#include "d/d_procname.h"
#include "d/d_com_inf_game.h"
#include "d/d_item_data.h"
#include "m_Do/m_Do_controller_pad.h"
#include "m_Do/m_Do_mtx.h"
#include "d/actor/d_a_player_main.h"
#include "d/d_snap.h"
#include "d/actor/d_a_ship.h"
#include "d/d_kankyo_wether.h"
#include "d/d_camera.h"
#include "d/d_detect.h"

// Needed for the .data section to match.
static f32 dummy1[3] = {1.0f, 1.0f, 1.0f};
static f32 dummy2[3] = {1.0f, 1.0f, 1.0f};
static u8 dummy3[4] = {0x02, 0x00, 0x02, 0x01};
static f64 dummy4[2] = {3.0, 0.5};

static u8 temp[0x4C]; // TODO

static daNpc_Md_HIO_c l_HIO;

static cXyz l_ms_light_local_vec(0.0f, 0.0f, -10000.0f);
static cXyz l_ms_light_local_start(5.0f, 7.0f, 0.0f);

static char* l_arc_name = "Md";
static char* l_arc_name_ship = "Md_ship";
static char* l_staff_name = "Md1";

static char* event_name_tbl[] = {
    "Md_ItemGet",
    "Md_RopeGet",
    "MD_FLY",
    "md_cliff",
    "Md_Fly2",
    "Md_Tact",
    "Md_TactTrue",
    "Md_HarpTalk",
    "OPTION_CHAR_END",
    "DEFAULT_TALK_XY",
};

static dCcD_SrcCyl l_cyl_src = {
    // dCcD_SrcGObjInf
    {
        /* Flags             */ 0,
        /* SrcObjAt  Type    */ 0,
        /* SrcObjAt  Atp     */ 0,
        /* SrcObjAt  SPrm    */ 0,
        /* SrcObjTg  Type    */ ~(AT_TYPE_BOOMERANG | AT_TYPE_WIND | AT_TYPE_LIGHT),
        /* SrcObjTg  SPrm    */ TG_SPRM_SET | TG_SPRM_IS_PLAYER,

            l_msgId = fopMsgM_messageSet(mMsgNo, this);
        }
    } else {
        l_msg = fopMsgM_SearchByID(l_msgId);
        if (l_msg) {
            return TRUE;
        }
    }
    return FALSE;
}

/* 0000CC10-0000CDCC       .text talk__10daNpc_Md_cFi */
BOOL daNpc_Md_c::talk(int r4) {
    u16 msgStatus = l_msg->mStatus;
    u8 msgAnmAtr = dComIfGp_getMesgAnimeAttrInfo();
    if (msgStatus == fopMsgStts_MSG_DISPLAYED_e) {
        l_msg->mStatus = next_msgStatus(&mMsgNo);
        if (l_msg->mStatus == fopMsgStts_MSG_CONTINUES_e) {
            fopMsgM_messageSet(mMsgNo);
            m313A = 0;
        }
    } else if (msgStatus == fopMsgStts_UNK15_e) {
        if (r4 != 0) {
            if (dComIfGp_checkMesgCancelButton()) {
                l_msg->mStatus = fopMsgStts_MSG_ENDS_e;
                fopMsgM_messageSendOn();
                cLib_onBit(m30F0, 0x200UL);
            }
            if (cLib_checkBit(m30F0, 0x400UL)) {
                l_msg->mStatus = fopMsgStts_MSG_ENDS_e;
                fopMsgM_messageSendOn();
            }
        }
    } else if (msgStatus == fopMsgStts_MSG_TYPING_e) {
        if (m313A == 0 && !fopAcM_checkCarryNow(this) && !isShipRide() && mMsgNo != 0x05AC) {
            int anmType = getAnmType(msgAnmAtr);
            if (anmType >= 0) {
                setAnm(anmType);
            }
        }
    } else if (msgStatus == fopMsgStts_BOX_CLOSED_e) {
        l_msg->mStatus = fopMsgStts_MSG_DESTROYED_e;
        offXYTalk();
        return TRUE;
    }
    
    if (!fopAcM_checkCarryNow(this) && !isShipRide() && mMsgNo != 0x05AC) {
        if (m313A == 1 && msgAnmAtr == 0x14 && m312A != 0) {
            setAnm(0x1B);
            m313A = 1;
        }
    }
    
    return FALSE;
}

/* 0000CDCC-0000CDF4       .text getAnmType__10daNpc_Md_cFUc */
int daNpc_Md_c::getAnmType(u8 r4) {
    static const int anmTypeData_Talk[] = {
        0x00000000,
        0x00000002,
        0x00000002,
        0x00000003,
        0x00000004,
        0x00000005,
        0x00000006,
        0x0000000B,
        0x00000007,
        0x00000009,
        0x0000000C,
        0x0000000D,
        0x0000000E,
        0x0000000F,
        0x00000011,
        0x00000014,
        0x00000012,
        0x0000001B,
        0x0000001C,
        0x00000015,
        0x00000015,
        0x00000016,
        0x00000017,
        0x00000018,
        0x00000019,
        0x0000001D,
        0x0000001A,
        0x00000010,
        0x0000001F,
        0x00000020,
        0x00000022,
        0x0000001E,
        0x00000023,
        0x00000024,
        0x00000025,
        0x00000026,
        0x00000027,
        0x00000028,
        0x00000029,
        0x0000002A,
        0x0000002B,
        0x0000002C,
        0x0000002D,
        0x00000031,
    };
    
    if (r4 < ARRAY_SIZE(anmTypeData_Talk)) {
        return anmTypeData_Talk[r4];
    } else {
        return -1;
    }
}

/* 0000CDF4-0000CF18       .text initTexPatternAnm__10daNpc_Md_cFUcb */
BOOL daNpc_Md_c::initTexPatternAnm(u8 btpAnmTblIdx, bool param_2) {
    struct btp_anm_tbl {
        /* 0x00 */ char m00[0x20];
        /* 0x20 */ u8 m20;
    };
    static btp_anm_tbl btpAnmTbl[] = {
        {"maba.btp", 0},
        {"md_fall.btp", 0},
        {"md_fall02.btp", 0},
        {"md_fly02.btp", 0},
        {"md_kamae.btp", 1},
        {"md_kamaewait.btp", 0},
        {"md_land.btp", 1},
        {"md_land02.btp", 1},
        {"md_piyo2.btp", 1},
        {"md_harpplay.btp", 0},
        {"md_watasu.btp", 1},
        {"fuan.btp", 1},
        {"md_caught.btp", 0},
        {"md_komari.btp", 0},
        {"md_kyoro2.btp", 1},
        {"md_unazuki.btp", 1},
    };
    
    J3DModelData* modelData = mpMorf->getModel()->getModelData();
    bool ret = false;
    J3DAnmTexPattern* eyeTexPtrn = (J3DAnmTexPattern*)dComIfG_getObjectRes(mModelArcName, btpAnmTbl[btpAnmTblIdx].m00);
    JUT_ASSERT(7502, eyeTexPtrn != 0);
    if (m0520.init(modelData, eyeTexPtrn, 1, 1, 1.0f, 0, -1, param_2, 0)) {
        m3112 = eyeTexPtrn->getFrameMax();
        m3133 = 0;
        m3136 = btpAnmTbl[btpAnmTblIdx].m20;
        m3137 = btpAnmTblIdx;
        ret = true;
    }
    
    return ret;
}

/* 0000CF18-0000CFCC       .text playTexPatternAnm__10daNpc_Md_cFv */
void daNpc_Md_c::playTexPatternAnm() {
    if (m3136 == 1) {
        m0520.setFrame(m30D0);
        return;
    }
    if (m0520.play()) {
        if (cLib_calcTimer(&m3133) == 0) {
            m3133 = 30.0f + cM_rndF(60.0f);
            m0520.initPlay(m3112, J3DFrameCtrl::LOOP_ONCE_RESET_e, 1.0f, 0, -1, true);
        }
    }
}

/* 0000CFCC-0000D0B8       .text initLightBtkAnm__10daNpc_Md_cFb */
BOOL daNpc_Md_c::initLightBtkAnm(bool) {
    /* Nonmatching */
}

/* 0000D0B8-0000D0DC       .text playLightBtkAnm__10daNpc_Md_cFv */
void daNpc_Md_c::playLightBtkAnm() {
    mLightBtkAnm.play();
}

/* 0000D0DC-0000D4CC       .text setAnm__10daNpc_Md_cFi */
BOOL daNpc_Md_c::setAnm(int anmIdx) {
    struct anm_tbl {
        /* 0x00 */ char m00[0x20];
        /* 0x20 */ char m20[0x20];
    };
    struct anm_prm {
        /* 0x00 */ s8 anmTblIdx;
        /* 0x01 */ u8 armAnmTblIdx;
        /* 0x02 */ u8 btpAnmTblIdx;
        /* 0x04 */ int loopMode;
        /* 0x08 */ f32 morf;
        /* 0x0C */ f32 speed;
    };

    static anm_tbl l_anmTbl[] = {
        {"md_wait01.bck", ""},
        {"md_walk.bck", "md_run.bck"},
        {"md_squatdown.bck", ""},
        {"md_sqwait01.bck", ""},
        {"md_sqwait02.bck", ""},
        {"md_firing.bck", ""},
        {"md_fly01.bck", ""},
        {"md_fly02.bck", ""},
        {"md_gliding.bck", ""},
        {"md_fall.bck", ""},
        {"md_fall02.bck", ""},
        {"md_land.bck", ""},
        {"md_land02.bck", ""},
        {"md_land03.bck", ""},
        {"md_kamaewait.bck", ""},
        {"md_kamae.bck", ""},
        {"md_piyo2.bck", ""},
        {"md_ojigi.bck", ""},
        {"md_harpplay01.bck", ""},
        {"md_harpplay02.bck", ""},
        {"md_takeoff01.bck", ""},
        {"md_takeoff02.bck", ""},
        {"md_watasu.bck", ""},
        {"md_talk01.bck", ""},
        {"md_talk02.bck", ""},
        {"md_talk03.bck", ""},
        {"md_talk04.bck", ""},
        {"md_mkamae.bck", ""},
        {"md_mwait.bck", ""},
