/**
 * d_a_npc_p1.cpp
 * NPC - Gonzo, Senza, & Nudge
 */

#include "d/dolzel_rel.h" // IWYU pragma: keep
#include "d/actor/d_a_npc_p1.h"

#include "d/actor/d_a_kaji.h"
#include "d/actor/d_a_obj_pirateship.h"
#include "d/d_bg_s_func.h"
#include "d/d_camera.h"
#include "d/d_cc_d.h"
#include "d/d_s_play.h"
#include "res/Object/P1.h"


class daNpc_P1_childHIO_c{
public:
    daNpc_P1_childHIO_c();
    virtual ~daNpc_P1_childHIO_c(){};

public:
    /* Place member variables here */
    /* 0x04 */ s8 unk4;                             /* inferred */
               f32 mAttnYPosOffset;
               s16 mC;
               s16 mE;
               s16 m10;
               s16 m12;
    /* 0x14 */ s16 m14;                           /* inferred */
               s16 m16;
    /* 0x18 */ s16 m18;                           /* inferred */
    /* 0x1A */ s16 m1A;                           /* inferred */
    /* 0x1C */ s16 m1C;                           /* inferred */
    /* 0x1E */ s16 m1E;                           /* inferred */
    /* 0x20 */ s8 m20;                           /* inferred */
    /* 0x22 */ s16 m22;                           /* inferred */
               f32 m24;
               f32 mMorf;
               f32 m2C;

    //SIZE = 0x30
};



class daNpc_P1_HIO_c{
public:
    daNpc_P1_HIO_c();
    virtual ~daNpc_P1_HIO_c(){};
public:
    s8 m4;
    s32 m8;
    daNpc_P1_childHIO_c children[3];
};


static dCcD_SrcCyl l_cyl_src = {
    // dCcD_SrcGObjInf
    {
        /* Flags             */ 0,
        /* SrcObjAt  Type    */ 0,
        /* SrcObjAt  Atp     */ 0,
        /* SrcObjAt  SPrm    */ 0,
        /* SrcObjTg  Type    */ AT_TYPE_ALL,
        /* SrcObjTg  SPrm    */ cCcD_TgSPrm_Set_e | cCcD_TgSPrm_IsEnemy_e,
        /* SrcObjCo  SPrm    */ cCcD_CoSPrm_Set_e | cCcD_CoSPrm_IsPlayer_e | cCcD_CoSPrm_VsGrpAll_e,
        /* SrcGObjAt Se      */ 0,
        /* SrcGObjAt HitMark */ dCcG_AtHitMark_None_e,
        /* SrcGObjAt Spl     */ dCcG_At_Spl_UNK0,
        /* SrcGObjAt Mtrl    */ 0,
        /* SrcGObjAt SPrm    */ 0,
        /* SrcGObjTg Se      */ 0,
