/**
 * d_a_npc_photo.cpp
 * NPC - Lenzo
 */

#include "d/dolzel_rel.h" // IWYU pragma: keep
#include "d/actor/d_a_npc_photo.h"
#include "d/d_procname.h"
#include "d/d_priority.h"
#include "d/d_com_lib_game.h"
#include "d/d_com_inf_game.h"
#include "d/d_a_obj.h"
#include "d/d_path.h"
#include "d/actor/d_a_player_main.h"
#include "d/d_camera.h"
#include "d/res/res_po.h"
#include "d/d_snap.h"
#include "d/d_kankyo_rain.h"
#include "d/d_picture_box.h"
#include "d/actor/d_a_tag_photo.h"

extern dCcD_SrcCyl dNpc_cyl_src;

const char daNpcPhoto_c::m_arcname[] = "Auc";


static const char* l_arcname_tbl[] = {
    "Po"
};

static sPhotoAnmDat l_npc_anm_wait[] = {
    {
        0x00,
        0x08,
        0xFF,
    },
};

static sPhotoAnmDat l_npc_anm_talk[] = {
    {
        0x01,
        0x08,
        0xFF,
    },
};

static sPhotoAnmDat l_npc_anm_walk[] = {
    {
        0x03,
        0x08,
        0xFF,
    },
};

static sPhotoAnmDat l_npc_anm_spit[] = {
    {    
        0x04,
        0x08,
        0x01
    },
    {
        0x00,
        0x08,
        0xFF,
    },
};

static sPhotoAnmDat l_npc_anm_talk2[] = {
    {
        0x02,
        0x08,
        0x03,
    },
    {
        0x00,
        0x08,
        0xFF,
    },
};

static sPhotoAnmDat l_npc_anm_talk4[] = {
    {
        0x02,
        0x08,
        0x01,
    },
    {
        0x01,
        0x08,
        0xFF,
    },
};

struct NpcDatStruct {
    /* 0x00 */ f32 field_0x00;
    /* 0x04 */ s16 field_0x04;
    /* 0x06 */ s16 field_0x06;
    /* 0x08 */ s16 field_0x08;
    /* 0x0A */ s16 field_0x0A;
    /* 0x0C */ s16 field_0x0C;
    /* 0x0E */ s16 field_0x0E;
    /* 0x10 */ s16 field_0x10;
    /* 0x12 */ s16 field_0x12;
    /* 0x14 */ s16 field_0x14;
    /* 0x16 */ s16 field_0x16;
    /* 0x18 */ s16 field_0x18;
    /* 0x1C */ f32 field_0x1C;
    /* 0x20 */ f32 field_0x20;
    /* 0x24 */ f32 field_0x24;
    /* 0x28 */ s16 field_0x28;
    /* 0x2C */ f32 field_0x2C;
    /* 0x30 */ f32 field_0x30;
    /* 0x34 */ f32 field_0x34;
    /* 0x38 */ f32 field_0x38;
    /* 0x3C */ f32 field_0x3C;
    /* 0x40 */ f32 field_0x40;
    /* 0x44 */ s16 field_0x44;
    /* 0x46 */ s16 field_0x46;
    /* 0x48 */ s16 field_0x48;
    /* 0x4A */ s16 field_0x4A;
    /* 0x4C */ s16 field_0x4C;
    /* 0x4E */ s16 field_0x4E;
    /* 0x50 */ s16 field_0x50;
    /* 0x52 */ bool field_0x52;
    /* 0x53 */ bool field_0x53;
}; // Size: 0x54

static NpcDatStruct l_npc_dat = {
    0.0f,
    0x09C4,
    0x07D0,
    0x1388,
    0x1F40,
    0xFF6A,
    0xFE00,
    0xFC18,
    0xE0C0,
    0x01f4,
    0x0320,
    0x0708,
    0.0f,
    215.0f,
    30.0f,
    0x7FFF,
    200.0f,
    300.0f,
    -50.0f,
    0.3f,
    5.0f,
    1.3f,
    0x03E8,
    0x0006,
    0x0400,
    0x001E,
    0x001E,
    0x270F,
    0x270F,
    true,
    true,
};

static u32 l_msg_1st_talk[] = {
    0x2A31,
    0x2A32,
    0x2A33,
    0x0000
};

static u32 l_msg_2nd_talk[] = {
    0x2A34,
    0x0000
};

static u32 l_msg_1st_photo[] = {
    0x2A35,
    0x2A36,
    0x0000
};

static u32 l_msg_2nd_photo[] = {
    0x2A37,
    0x2A38,
    0x0000
};

static u32 l_msg_1st_order[] = {
    0x2A39,
    0x2A3A,
    0x2A3C,
    0x2A3D,
    0x2A3E,
    0x2A3F,
    0x2A40,
    0x2A41,
    0x2A42,
    0x2A43,
    0x0001,
};

static s16 l_msg_1st_order_c[] = {
    0xFFFF,
    0xFF00,
	0xFF01,
    0xFFFF,
	0x0002
};

static u32 l_msg_1st_order_not_end[] = {
    0x2A44,
    0x2A45,
    0x0000
};

static u16 l_msg_1st_order_not_end_c[] = {
    0xFF02
};

static u32 l_msg_2nd_order[] = {
    0x2A46,
    0x2A47,
    0x2A48,
    0x0003
};

static u8 l_msg_2nd_order_c[] = {
    0xFF,
    0x00,
    0xFF
};

static u32 l_msg_2nd_order_not_end[] = {
    0x2A49,
    0x2A4A,
    0x0000
};

static u16 l_msg_2nd_order_not_end_c[] = {
    0xFF02
};

static u32 l_msg_3rd_order[] = {
    0x2A4B,
    0x2A4C,
    0x2A4D,
    0x2A4E,
    0x0005,
};

static u32 l_msg_3rd_order_c[] = {
    0xFF00FF02
};

static u32 l_msg_3rd_order_not_end[] = {
    0x2A4F,
    0x2A50,
    0x0000,
};

static u16 l_msg_3rd_order_not_end_c[] = {
    0xFFFF
};

static u32 l_msg_3rd_order_end[] = {
    0x2A51,
    0x0000,
};

static u32 l_msg_not_color[] = {
    0x2A52,
    0x2A53,
    0x0000
};

static u16 l_msg_not_color_c[] = {
    0xFF00
};

static u32 l_msg_color[] = {
    0x2A54,
    0x2A55,
    0x0000
};

static u16 l_msg_color_c[] = {
    0xFF01
};

static u32 l_msg_week_1st[] = {
    0x3781,
    0x3782,
    0x3783,
    0x3784,
    0x3785,
    0x0000
};

static u32 l_msg_week0[] = {
    0x3779,
    0x377A,
    0x3785,
    0x0000
};

static u32 l_msg_week1[] = {
    0x3779,
    0x377B,
    0x3785,
    0x0000
};

static u32 l_msg_week2[] = {
    0x3779,
    0x377C,
    0x3785,
    0x0000
};

static u32 l_msg_week3[] = {
    0x3779,
    0x377D,
    0x3785,
    0x0000
};

static u32 l_msg_week4[] = {
    0x3779,
    0x377E,
    0x3785,
    0x0000
};

static u32 l_msg_week5[] = {
    0x3779,
    0x377F,
    0x3785,
    0x0000
};

static u32 l_msg_week6[] = {
    0x3779,
    0x3780,
    0x3785,
    0x0000
};

static u32* l_msg_week[] = {
    l_msg_week0, l_msg_week1, l_msg_week2, l_msg_week3,
    l_msg_week4, l_msg_week5, l_msg_week6,
};


static u32 l_msg_1st_talk_photo[] = {
    0x2A69,
    0x2A6A,
    0x2A6B,
    0x2A6C,
    0x0000
};


static u32 l_msg_talk_photo_0[] = {
    0x2A6E,
    0x2A6F,
    0x0000,
};

static u32 l_msg_talk_photo_1[] = {
    0x2A71,
    0x2A72,
    0x0000,
};

static u32 l_msg_talk_photo_2[] = {
    0x2A74,
    0x2A75,
    0x0000,
};

static u32 l_msg_talk_photo_3[] = {
    0x2A77,
    0x2A78,
    0x0000,
};

static u32 l_msg_talk_photo_4[] = {
    0x2A7A,
    0x2A7B,
    0x0000,
};

static u32 l_msg_talk_photo_5[] = {
    0x2A7D,
    0x2A7E,
    0x0000,
};

static u32 l_msg_talk_photo_6[] = {
    0x2A80,
    0x2A81,
    0x0000,
};

static u32* l_msg_talk_photo[] = {
    l_msg_talk_photo_0, l_msg_talk_photo_1, l_msg_talk_photo_2, l_msg_talk_photo_3,
    l_msg_talk_photo_4, l_msg_talk_photo_5, l_msg_talk_photo_6,
};

static u32 l_msg_buy_photo[] = {
    0x3786,
    0x0000
};

static u32 l_msg_get_photo[] = {
    0x3785,
    0x0000
};

static u32 l_msg_2F[] = {
    0x2A82,
    0x2A83,
    0x2A84
};

static u32 l_msg_down[] = {
    0x2A86,
    0x0000
};

static u32 l_msg_ub4[] = {
    0x2D62,
    0x0000,
};

static u32 l_msg_1st_order_xy[] = {
    0x2A5E,
    0x2A5F,
    0x2A60,
    0x0002
};

static u32 l_msg_2nd_order_xy[] = {
    0x2A61,
    0x2A62,
    0x2A60,
    0x0004
};

static u32 l_msg_3rd_order_xy[] = {
    0x2A64,
    0x2A60,
    0x0006
};

static u32 l_msg_color_xy[] = {
    0x2A58,
    0x2A59,
    0x2A5A,
    0x0007,
    0x2A85,
    0x0008,
    0x2A5B,
    0x0000
};

static u32 l_msg_xy_buy_photo[] = {
    0x3788,
    0x3789,
    0x0009,
    0x378C,
    0x000A,
    0x378D,
    0x000B,
    0x3786,
    0x0000
};

static dCcD_SrcCyl l_cyl_src2 = {
    // dCcD_SrcGObjInf
    {
        /* Flags             */ 0,
        /* SrcObjAt  Type    */ 0,
        /* SrcObjAt  Atp     */ 0,
        /* SrcObjAt  SPrm    */ 0,
        /* SrcObjTg  Type    */ 0,
        /* SrcObjTg  SPrm    */ 0,
        /* SrcObjCo  SPrm    */ cCcD_CoSPrm_NoCoHitInfSet_e | cCcD_CoSPrm_VsGrpAll_e | cCcD_CoSPrm_IsOther_e | cCcD_CoSPrm_Set_e,
        /* SrcGObjAt Se      */ 0,
        /* SrcGObjAt HitMark */ 0,
        /* SrcGObjAt Spl     */ 0,
        /* SrcGObjAt Mtrl    */ 0,
        /* SrcGObjAt SPrm    */ 0,
        /* SrcGObjTg Se      */ 0,
        /* SrcGObjTg HitMark */ 0,
        /* SrcGObjTg Spl     */ 0,
        /* SrcGObjTg Mtrl    */ 0,
        /* SrcGObjTg SPrm    */ dCcG_TgSPrm_NoHitMark_e,
        /* SrcGObjCo SPrm    */ 0,
    },
    // cM3dGCylS
    {{
        /* Center */ {0.0f, 0.0f, 0.0f},
        /* Radius */ 40.0f,
        /* Height */ 160.0f,
    }},
};

static char* l_npc_staff_id = {
    "Po"
};

static const int l_bck_ix_tbl[] = {
    PO_BCK_WAIT01,
    PO_BCK_TALK01,
    PO_BCK_TALK02,
    PO_BCK_WALK01,
    PO_BCK_SPIT,
};

static const int l_btp_ix_tbl[] = {
    PO_BTP_MABA01,
    PO_BTP_MABA02
};

struct SaveDatStruct {
    /* 0x00 */ u16 field_0x00;
    /* 0x02 */ u16 field_0x02;
    /* 0x04 */ u16 field_0x04;
    /* 0x06 */ u16 field_0x06;
}; // Size: 0x08

static const SaveDatStruct l_save_dat = {
    0x1208,
    0x1701,
    0x1601,
    0xC407,
};


struct PsoData {
    /* 0x00 */ f32 field_0x00;
    /* 0x04 */ f32 field_0x04;
    /* 0x08 */ f32 field_0x08;
    /* 0x0C */ f32 field_0x0C;
    /* 0x10 */ f32 field_0x10;
    /* 0x14 */ s16 field_0x14;
    /* 0x16 */ u8 field_0x16;
    /* 0x17 */ u8 field_0x17;
};  // Size: 0x18

static PsoData l_pso_photo = {
    0.0f,
    100.0f,
    -30.0f,
    40.0f,
    90.0f,
    0x0000,
    0xFF,
    0x04
};

static cXyz l_counter_pos[] = {
    cXyz(-490.0f, 0.0f, -10.0f), 
    cXyz(-260.0f, 0.0f, -250.0f)
};

static cXyz l_gallery_pos(-260.0f, 500.0f, 400.0f);

/* 000000EC-000002D0       .text __ct__12daNpcPhoto_cFv */
daNpcPhoto_c::daNpcPhoto_c() {
    field_0x9C3 = 0;
    field_0x9C2 = false;
    field_0x9C0 = 0;
    field_0x9C1 = 0;
    field_0x984 = 0.0f;
    field_0x9A8 = 0;
    field_0x988 = 60.0f;
    field_0x958.x = 0.0f;
    field_0x958.y = 0.0f;
    field_0x958.z = 0.0f;
    field_0x9CD = false;
    field_0x9D6 = 0;
    field_0x994 = true;
    field_0x9AE = home.angle.y;
    field_0x9C8 = false;
    field_0x9C7 = true;
    field_0x98C = -1.0f;
}

/* 00000740-00000858       .text daNpc_Photo_nodeCallBack__FP7J3DNodei */
static BOOL daNpc_Photo_nodeCallBack(J3DNode* node, int calcTiming) {
