/**
 * d_a_bgn3.cpp
 * Boss - Puppet Ganon (Phase 3) / Ｇ（ハヤムシ）(G (Fast worm))
 */

#include "d/dolzel_rel.h" // IWYU pragma: keep
#include "d/actor/d_a_bgn3.h"
#include "d/actor/d_a_bgn.h"
#include "d/actor/d_a_esa.h"
#include "d/d_procname.h"
#include "d/d_priority.h"
#include "d/d_cc_d.h"
#include "d/d_s_play.h"
#include "d/res/res_bgn.h"

class daBgn3_HIO_c : public JORReflexible {
public:
    daBgn3_HIO_c();
    virtual ~daBgn3_HIO_c() {};
    void genMessage(JORMContext*) {}

public:
    /* 0x04 */ s8 mNo;
    /* 0x05 */ u8 m05;
    /* 0x06 */ u8 m06;
    /* 0x07 */ u8 m07[0x08 - 0x07];
    /* 0x08 */ f32 m08;
    /* 0x0C */ s16 m0C;
    /* 0x0E */ s16 m0E;
    /* 0x10 */ f32 m10;
    /* 0x14 */ s16 m14;
    /* 0x16 */ s16 m16;
    /* 0x18 */ f32 m18;
    /* 0x1C */ s16 m1C;
    /* 0x1E */ s16 m1E;
    /* 0x20 */ s16 m20;
    /* 0x22 */ s16 m22;
    /* 0x24 */ s16 m24;
    /* 0x26 */ s16 m26;
    /* 0x28 */ s16 m28;
    /* 0x2A */ s16 m2A;
    /* 0x2C */ s16 m2C;
    /* 0x2E */ s16 m2E;
    /* 0x30 */ s16 m30;
    /* 0x32 */ u8 m32[0x34 - 0x32];
    /* 0x34 */ f32 m34;
    /* 0x38 */ f32 m38;
    /* 0x3C */ s16 m3C;
    /* 0x3E */ u8 m3E;
    /* 0x3F */ u8 m3F[0x40 - 0x3F];
    /* 0x40 */ f32 m40;
    /* 0x44 */ f32 m44;
    /* 0x48 */ f32 m48;
    /* 0x4C */ f32 m4C;
    /* 0x50 */ s16 m50;
    /* 0x52 */ s16 m52;
    /* 0x54 */ s16 m54;
};

static bgn_class* bgn;
static esa_class* esa;
static cXyz zero(0.0f, 0.0f, 0.0f);
static bool hio_set;
static daBgn3_HIO_c l_HIO;
static GXColor ke_color;
static s32 ki_all_count;

static u16 ke_max[] = {0x0028, 0x0023, 0x001E, 0x0019, 0x0014, 0x000F, 0x000F};

static f32 size_d[] = {1.0f, 0.9f, 0.8f, 0.7f, 0.6f, 0.5f, 0.4f, 0.3f, 0.6f};

/* 000000EC-000001F4       .text __ct__12daBgn3_HIO_cFv */
daBgn3_HIO_c::daBgn3_HIO_c() {
    mNo = -1;
    m05 = 0;
    m06 = 0;
    m08 = 50.0f;
    m0C = 800;
    m0E = 3;
    m20 = 0x3c;
    m10 = 60.0f;
    m14 = 1000;
    m16 = 3;
    m22 = 0x28;
    m18 = 80.0f;
    m1C = 0x4b0;
    m1E = 3;
    m24 = 0x1e;
    m26 = 10;
    m28 = 0x14;
    m2A = 0x2d;
    m2C = 0x78;
    m2E = 200;
    m30 = 0xfa;
    m34 = 5.0f;
    m38 = 0.5f;
    m3C = 3;
    m3E = 1;
    m40 = 150.0f;
    m44 = 45.0f;
    m48 = 8.0f;
    m4C = -8.0f;
    m50 = 0xbc;
    m52 = 0x98;
    m54 = 0x42;
}

