/**
 * d_a_gnd.cpp
 * Boss - Ganondorf / ガノンＤ (Ganon D)
 */

#include "d/dolzel_rel.h" // IWYU pragma: keep
#include "d/actor/d_a_gnd.h"
#include "d/actor/d_a_arrow.h"
#include "d/actor/d_a_player.h"
#include "d/actor/d_a_player_main.h"
#include "d/actor/d_a_pz.h"
#include "d/d_meter.h"
#include "d/d_procname.h"
#include "d/d_priority.h"
#include "d/d_cc_d.h"
#include "d/d_s_play.h"
#include "d/d_snap.h"
#include "d/res/res_gnd.h"
#include "f_op/f_op_camera.h"
#if VERSION == VERSION_DEMO
#include "m_Do/m_Do_controller_pad.h"
#endif
#include "m_Do/m_Do_graphic.h"
#include "JSystem/JUtility/JUTReport.h"

enum Action {
    ACTION_MOVE0_e = 0,
    ACTION_ATTACK0_e = 1,
    ACTION_ATTACK1_e = 2,
    ACTION_ATTACK2_e = 3,
    ACTION_ATTACKPZ_e = 4,
    ACTION_ATTACK_LAST_e = 5,
    ACTION_DEFENCE0_e = 10,
    ACTION_DAMAGE_e = 11,
    ACTION_DEMOWAIT_e = 20,
    ACTION_YAWAIT_e = 21,
    ACTION_FINISH_e = 30,
};

class daGnd_HIO_c : public JORReflexible {
public:
    daGnd_HIO_c();
    virtual ~daGnd_HIO_c() {};
    void genMessage(JORMContext*) {}

public:
    /* 0x04 */ s8 mNo;
    /* 0x05 */ u8 m05;
    /* 0x06 */ u8 m06;
    /* 0x07 */ u8 m07;
    /* 0x08 */ f32 m08;
    /* 0x0C */ f32 m0C;
    /* 0x10 */ u8 m10;
    /* 0x11 */ u8 m11;
    /* 0x12 */ u8 m12;
    /* 0x13 */ u8 m13[0x14 - 0x13];
    /* 0x14 */ f32 m14;
    /* 0x18 */ f32 m18;
    /* 0x1C */ f32 m1C;
    /* 0x20 */ f32 m20;
    /* 0x24 */ f32 m24;
    /* 0x28 */ f32 m28;
    /* 0x2C */ f32 m2C;
    /* 0x30 */ f32 m30;
    /* 0x34 */ f32 m34;
    /* 0x38 */ f32 m38;
    /* 0x3C */ f32 m3C;
    /* 0x40 */ f32 m40;
    /* 0x44 */ u8 m44;
    /* 0x45 */ u8 m45;
    /* 0x46 */ u8 m46;
    /* 0x47 */ u8 m47[0x48 - 0x47];
    /* 0x48 */ f32 m48;
    /* 0x4C */ f32 m4C;
    /* 0x50 */ f32 m50;
    /* 0x54 */ f32 m54;
    /* 0x58 */ f32 m58;
    /* 0x5C */ f32 m5C;
    /* 0x60 */ f32 m60;
    /* 0x64 */ f32 m64;
    /* 0x68 */ s16 m68;
    /* 0x6A */ s16 m6A;
    /* 0x6C */ s16 m6C;
    /* 0x6E */ s16 m6E;
    /* 0x70 */ s16 m70;
    /* 0x72 */ s16 m72;
    /* 0x74 */ s16 m74;
    /* 0x76 */ s16 m76;
    /* 0x78 */ f32 m78;
    /* 0x7C */ s16 m7C;
    /* 0x7E */ s16 m7E;
    /* 0x80 */ s16 m80;
    /* 0x82 */ s16 m82;
    /* 0x84 */ s16 m84;
    /* 0x86 */ s16 m86;
    /* 0x88 */ u8 m88;
    /* 0x89 */ u8 m89;
};

/* 000000EC-0000023C       .text __ct__11daGnd_HIO_cFv */
daGnd_HIO_c::daGnd_HIO_c() {
    mNo = -1;
    m05 = 0;
    m06 = 0;
    m07 = 1;
    m08 = 45.0f;
    m0C = 1.0f;
    m10 = 0;
    m11 = 0;
    m12 = 1;
    m14 = 5.0f;
    m18 = 629.0f;
    m1C = 1200.0f;
    m20 = 25.0f;
    m24 = 11.0f;
    m28 = -0.5f;
    m2C = 100.0f;
    m30 = -30.0f;
    m34 = 20.0f;
    m38 = -2.0f;
    m3C = 630.0f;
    m40 = 400.0f;
    m44 = 0;
    m45 = 1;
    m46 = 1;
    m48 = 35.0f;
    m4C = 0.0f;
    m50 = 5.0f;
    m54 = 15.0f;
    m58 = 0.0f;
    m5C = 30.0f;
    m60 = -2.0f;
    m64 = 8.0f;
    m68 = 0x1e;
    m6A = 0x1e;
    m6C = 0;
    m6E = 0xF;
    m70 = 10;
    m72 = 0;
    m74 = 10;
    m76 = 10;
    m78 = 600.0f;
    m7C = 10;
    m7E = 1;
    m80 = 0x1e;
    m82 = 3;
    m84 = 6;
    m86 = 0x46;
    m88 = 0;
    m89 = 0;
}

static cXyz non_pos(-20000.0f, -20000.0f, -20000.0f);
static bool hio_set;
static daGnd_HIO_c l_HIO;

#if VERSION == VERSION_DEMO
