/**
 * d_a_npc_tc.cpp
 * NPC - Tingle, Ankle, David Jr. & Knuckle
 */

#include "d/dolzel_rel.h" // IWYU pragma: keep
#include "d/actor/d_a_npc_tc.h"
#include "m_Do/m_Do_ext.h"
#include "d/d_procname.h"
#include "d/d_priority.h"
#include "d/res/res_tc.h"
#include "d/d_s_play.h"
#include "d/d_snap.h"
#include "d/actor/d_a_obj_smplbg.h"
#include "d/d_lib.h"


#if VERSION == VERSION_DEMO
static f32 lbl_285_data_1C[] = {
	0.0f,
    2.125f,
    0.0f,
    1.75f,
    0.0f
};
#endif

class daNpc_Tc_HIO_c : public mDoHIO_entry_c{
public:
    daNpc_Tc_HIO_c();
    virtual ~daNpc_Tc_HIO_c() {}

    void genMessage(JORMContext* ctx) {}

public:
    /* 0x04 */ dNpc_HIO_c mNpc;
    /* 0x2C */ f32 field_0x2C;
    /* 0x30 */ f32 field_0x30;
    /* 0x34 */ u8 field_0x34;
    /* 0x35 */ u8 field_0x35[0x38 - 0x35];
    /* 0x38 */ f32 field_0x38;
    /* 0x3C */ f32 field_0x3C;
    /* 0x40 */ f32 field_0x40;
    /* 0x44 */ bool field_0x44;
    /* 0x45 */ u8 field_0x45[0x48 - 0x45];
    /* 0x48 */ f32 field_0x48;
    /* 0x4C */ f32 field_0x4C;
    /* 0x50 */ f32 field_0x50;
    /* 0x54 */ f32 field_0x54;
    /* 0x58 */ f32 field_0x58;
    /* 0x5C */ f32 field_0x5C;
    /* 0x60 */ cXyz field_0x60;
    /* 0x6C */ cXyz field_0x6C;
    /* 0x78 */ s16 field_0x78;
    /* 0x7A */ s16 field_0x7A;
    /* 0x7C */ u8 field_0x7C;
    /* 0x7D */ u8 field_0x7D;
    /* 0x7E */ u8 field_0x7E;
    /* 0x7F */ u8 field_0x7F[8];
    /* 0x87 */ u8 field_0x87[8];
    /* 0x8F */ u8 field_0x8F;
    /* 0x90 */ u8 field_0x90;
    /* 0x91 */ u8 field_0x91;
    /* 0x92 */ u8 field_0x92;
    /* 0x93 */ u8 field_0x93;
    /* 0x94 */ f32 field_0x94[24];
};  // Size: 0xF4

static daNpc_Tc_HIO_c l_HIO;

#include "d/actor/d_a_npc_tc_msg_normal2.inc"

#include "d/actor/d_a_npc_tc_msg_white.inc"

#include "d/actor/d_a_npc_tc_msg_red.inc"

/* 000000EC-00000394       .text __ct__14daNpc_Tc_HIO_cFv */
daNpc_Tc_HIO_c::daNpc_Tc_HIO_c() {
    field_0x60.set(-100.0f, 1700.0f, -50.0f);
    field_0x6C.set(100.0f, 1700.0f, 50.0f);

    field_0x7A = 0;
    field_0x78 = -0x8000;
    field_0x7C = dComIfGs_isEventBit(dSv_event_flag_c::UNK_0B80);
    field_0x7D = dComIfGs_isEventBit(dSv_event_flag_c::UNK_1A20);
    field_0x7E = dComIfGs_isEventBit(dSv_event_flag_c::UNK_1708);

    for (int i = 0; i < 8; i++) {
        field_0x87[i] = dComIfGs_isGetCollectMap(i+1);
    }

    for (int i = 0; i < 8; i++) {
        field_0x7F[i] = dComIfGs_isCollectMapTriforce(i+1);
    }

    field_0x8F = dComIfGs_isStageTbox(dSv_save_c::STAGE_DRC, 0xf);
    field_0x90 = dComIfGs_isStageTbox(dSv_save_c::STAGE_FW, 0xf);
