/**
 * d_a_himo2.cpp
 * Item - Grappling Hook / ロープ (Rope)
 */

#include "d/dolzel.h" // IWYU pragma: keep
#include "d/actor/d_a_bk.h"
#include "d/actor/d_a_player_main.h"
#include "d/actor/d_a_ykgr.h"
#include "d/actor/d_a_himo2.h"
#include "d/actor/d_a_btd.h"
#include "d/actor/d_a_dr2.h"
#include "d/actor/d_a_player.h"
#include "d/d_com_inf_game.h"
#include "d/d_procname.h"
#include "d/d_priority.h"
#include "d/d_cc_d.h"
#include "d/d_s_play.h"
#include "d/res/res_link.h"
#include "f_op/f_op_camera.h"
#include "m_Do/m_Do_controller_pad.h"
#include "m_Do/m_Do_graphic.h"
#include "m_Do/m_Do_hostIO.h"

class himo2HIO_c : public JORReflexible {
public:
    himo2HIO_c() {
        m06 = 0;
        m08 = 15000;
        m0A = 1000;
        m0C = 600;
        m0E = 400;
        m10 = 60.0f;
        m14 = 1500.0f;
        m18 = 1000.0f;
        m1C = 2.3f;
        m20 = 1.9f;
    }
    virtual ~himo2HIO_c() {}
    void genMessage(JORMContext*) {}

public:
    /* 0x04 */ s8 mNo;
    /* 0x06 */ s16 m06;
    /* 0x08 */ s16 m08;
    /* 0x0A */ s16 m0A;
    /* 0x0C */ s16 m0C;
    /* 0x0E */ s16 m0E;
    /* 0x10 */ f32 m10;
    /* 0x14 */ f32 m14;
    /* 0x18 */ f32 m18;
    /* 0x1C */ f32 m1C;
    /* 0x20 */ f32 m20;
};

himo2HIO_c l_himo2HIO;
f32 rope_scale;
#if VERSION > VERSION_DEMO
static btd_class* btd;
dr2_class* dr;
#endif

/* 800EB60C-800EBABC       .text spin_draw__FP11himo2_class */
void spin_draw(himo2_class* i_this) {
    fopAc_ac_c* actor = &i_this->actor;
    int r27;
    s16 r22;
    s16 r23;
    s16 r26;
    f32 f4;
    s16 r24;
    f32 f5;
    s16 r30;
    cXyz* r29;
    cXyz local_504;
    cXyz local_510;
    cXyz local_51c;
    cXyz local_528;

    r26 = 0;
    r23 = i_this->m2510;
    f4 = (i_this->m217C->scale.y - 1.0f) * 8.0f;
    f5 = (i_this->m217C->scale.y - 1.0f) *  -7.0f;
#if VERSION > VERSION_DEMO
    if ((fopAcM_GetParam(i_this->m217C) & 0x0F) == 3) {
        f4 += REG8_F(8) + -3.0f;
        f5 += REG8_F(9) + 1.5f;
    }
#endif
    if (i_this->m217C->scale.y < 0.7f) {
        f4 += 3.0f;
    }
    if (i_this->m251C != 0) {
        r24 = 700;
        local_504.x = REG0_F(0) * 10.0f - 15.0f;
    } else {
        r24 = -700;
