/**
 * d_a_bgn2.cpp
 * Boss - Puppet Ganon (Phase 2) / Ｇ（タラバ） (G (King crab))
 */

#include "d/dolzel_rel.h" // IWYU pragma: keep
#include "d/actor/d_a_bgn2.h"
#include "d/actor/d_a_bgn.h"
#include "d/actor/d_a_bgn3.h"
#include "d/d_procname.h"
#include "d/d_priority.h"
#include "d/d_cc_d.h"
#include "d/d_s_play.h"
#include "d/res/res_bgn.h"

class daBgn2_HIO_c : public JORReflexible {
public:
    daBgn2_HIO_c();
    virtual ~daBgn2_HIO_c() {};
    void genMessage(JORMContext*) {}

public:
    /* 0x04 */ s8 mNo;
    /* 0x05 */ u8 m05;
    /* 0x06 */ u8 m06;
    /* 0x07 */ u8 m07[0x08 - 0x07];
    /* 0x08 */ f32 m08;
    /* 0x0C */ f32 m0C;
    /* 0x10 */ f32 m10;
    /* 0x14 */ f32 m14;
    /* 0x18 */ s16 m18;
    /* 0x1A */ s16 m1A;
    /* 0x1C */ s16 m1C;
    /* 0x1E */ s16 m1E;
    /* 0x20 */ s16 m20;
    /* 0x22 */ s16 m22;
    /* 0x24 */ s16 m24;
    /* 0x26 */ s16 m26;
    /* 0x28 */ s16 m28;
    /* 0x2A */ s16 m2A;
    /* 0x2C */ s16 m2C;
    /* 0x2E */ s16 m2E;
    /* 0x30 */ s16 m30;
};

/* 000000EC-00000194       .text __ct__12daBgn2_HIO_cFv */
daBgn2_HIO_c::daBgn2_HIO_c() {
    mNo = -1;
    m05 = 0;
    m06 = 0;
    m08 = 280.0f;
    m0C = 3000.0f;
    m10 = 15.0f;
    m14 = -2.0f;
    m18 = 0x5dc;
    m1A = 0xa28;
    m1C = 0xed8;
    m1E = 0x3c;
    m20 = 0x32;
    m22 = 0x28;
    m24 = 100;
    m26 = 100;
    m28 = 100;
    m2A = 600;
    m2C = 100;
    m2E = 3;
    m30 = 10;
}

static bgn_class* bgn;
static bgn3_class* bgn3;
static cXyz zero(0.0f, 0.0f, 0.0f);
static bool hio_set;
static daBgn2_HIO_c l_HIO;
static dKy_tevstr_c bg_tevstr;
static s32 ki_all_count;

/* 00000194-000002BC       .text anm_init__FP10bgn2_classifUcfi */
void anm_init(bgn2_class* i_this, int bckFileIdx, f32 morf, u8 loopMode, f32 speed, int soundFileIdx) {
    if (soundFileIdx >= 0) {
        i_this->m02CC->setAnm(
