//
// Generated by dtk
// Translation Unit: d_a_obj_figure.cpp
//

#include "d/actor/d_a_obj_figure.h"
#include "d/res/res_figure.h"
#include "d/res/res_figure2.h"
#include "f_op/f_op_actor_mng.h"
#include "d/d_com_inf_game.h"
#include "d/d_com_lib_game.h"
#include "d/d_snap.h"
#include "d/d_camera.h"
#include "d/d_a_obj.h"
#include "d/d_procname.h"
#include "d/d_priority.h"
#include "d/actor/d_a_player_main.h"
#include "m_Do/m_Do_controller_pad.h"

#include "weak_bss_936_to_1036.h" // IWYU pragma: keep

#define TOTAL_FIGURE_COUNT 0x86

static const char* l_arcname_tbl[] = {
    "Figure",
    "Figure2",
    "Figure1",
    "Figure0",
    "Figure6",
    "Figure5",
    "Figure3",
    "Figure4",
    "Figure2a",
    "Figure2b",
    "Figure6a",
    "Figure6b",
    "Figure6c",
};

static u16 l_figure_comp[] = {
    0x95FF,
    0x94FF,
    0x93FF,
    0x92FF,
    0x91FF,
    0x90FF,
    0x8FFF,
    0x8EFF,
    0x8DFF,
    0x8CFF,
    0xB1FF,
    0x9CFF,
    0x84FF,
    0x83FF,
    0x82FF,
    0x81FF,
    0x80FF,
};

static dCcD_SrcCyl l_cyl_src = {
    // dCcD_SrcGObjInf
    {
        /* Flags             */ 0,
        /* SrcObjAt  Type    */ 0,
        /* SrcObjAt  Atp     */ 0,
        /* SrcObjAt  SPrm    */ 0,
        /* SrcObjTg  Type    */ AT_TYPE_ALL,
        /* SrcObjTg  SPrm    */ cCcD_TgSPrm_Set_e | cCcD_TgSPrm_IsEnemy_e,
        /* SrcObjCo  SPrm    */ cCcD_CoSPrm_Set_e | cCcD_CoSPrm_IsOther_e | cCcD_CoSPrm_VsGrpAll_e,
        /* SrcGObjAt Se      */ 0,
        /* SrcGObjAt HitMark */ 0,
        /* SrcGObjAt Spl     */ 0,
        /* SrcGObjAt Mtrl    */ 0,
        /* SrcGObjAt SPrm    */ 0,
        /* SrcGObjTg Se      */ 0,
        /* SrcGObjTg HitMark */ 0,
        /* SrcGObjTg Spl     */ 0,
        /* SrcGObjTg Mtrl    */ 0,
        /* SrcGObjTg SPrm    */ dCcG_TgSPrm_NoHitMark_e,
        /* SrcGObjCo SPrm    */ 0,
    },
    // cM3dGCylS
    {
        /* Center */ 0.0f, 0.0f, 0.0f,
        /* Radius */ 60.0f,
        /* Height */ 150.0f,
    },
};

struct FigureData {
    /* 0x00 */ int mBmdId;
    /* 0x04 */ int mModelAttr;
    /* 0x08 */ int mRoomId;
}; // Size: 0x0C

static const FigureData l_figure_dat_tbl[TOTAL_FIGURE_COUNT] = {
    {
        0,
        0x37441422,
        -1
    },
    {
        1,
        0x37441422,
        -1
    },
    {
        2,
        0x37441422,
        -1
    },
    {
        3,
        0x37441422,
        -1
    },
    {
        0xA,
        0x37441422,
        -1
    },
    {
        4,
        0x37441422,
        -1
    },
    {
        5,
        0x37441422,
        -1
    },
    {
        6,
        0x37441422,
        -1
    },
    {
        7,
        0x37441422,
        -1
    },
    {
        8,
        0x37441422,
        -1
    },
    {
        9,
        0x11001222,
        -1
    },
    {
        0xB,
        0x37441422,
        -1
    },
    {
        0xC,
        0x37441422,
        -1
    },
    {
        0xD,
        0x37441422,
        -1
    },
    {
        0,
        0x37441422,
        -1
    },
    {
        1,
        0x37441422,
        -1
    },
    {
        2,
        0x37441422,
        -1
    },
    {
        4,
        0x37441422,
        -1
    },
    {
        5,
        0x37441422,
        -1
    },
    {
        7,
        0x37441422,
        -1
    },
    {
        8,
        0x37441422,
        -1
    },
    {
        9,
        0x37441422,
        -1
    },
    {
        0xA,
        0x37441422,
        -1
    },
    {
        0xB,
        0x37441422,
        -1
    },
    {
        0xC,
        0x37441422,
        -1
    },
    {
        0xD,
        0x37441422,
        -1
    },
    {
        0xE,
        0x37441422,
        -1
    },
    {
        0xF,
        0x37441422,
        -1
    },
    {
        0x10,
        0x37441422,
        -1
    },
    {
        0x11,
        0x37441422,
        -1
    },
    {
        0x12,
        0x37441422,
        -1
    },
    {
        0x13,
        0x37441422,
        -1
    },
    {
        0x14,
        0x37441422,
        -1
    },
    {
        0x15,
        0x37441422,
        -1
    },
    {
        0x16,
        0x37441422,
        -1
    },
    {
        0x17,
        0x37441422,
        -1
    },
    {
        0x18,
        0x37441422,
        -1
    },
    {
        0x19,
        0x37441422,
        -1
    },
    {
        0x1A,
        0x37441422,
        -1
    },
    {
        0x1B,
        0x37441422,
        -1
    },
    {
        0x1C,
        0x37441422,
        -1
    },
    {
        0,
        0x37441422,
        8
    },
    {
        1,
        0x37441422,
        8
    },
    {
        2,
        0x37441422,
        8
    },
    {
        3,
        0x37441422,
        8
    },
    {
        4,
        0x37441422,
        8
    },
    {
        5,
        0x37441422,
        8
    },
    {
        6,
        0x37441422,
        8
    },
    {
        7,
        0x37441422,
        8
    },
    {
        8,
        0x37441422,
        8
    },
    {
        9,
        0x37441422,
        8
    },
    {
        0xA,
        0x37441422,
        8
    },
    {
        0xB,
        0x37441422,
        8
    },
    {
        0xC,
        0x37441422,
        8
    },
    {
        0xD,
        0x37441422,
        8
    },
    {
        0xE,
        0x37441422,
        8
    },
    {
        0xF,
        0x37441422,
        8
    },
    {
        0x10,
        0x37441422,
        8
    },
    {
        0x11,
        0x37441422,
        8
    },
    {
        0x12,
        0x37441422,
        8
    },
    {
        0x13,
        0x37441422,
        8
    },
    {
        6,
        0x37441422,
        9
    },
    {
        1,
        0x37441422,
        9
    },
    {
        2,
        0x37441422,
        9
    },
    {
        5,
        0x37441422,
        9
    },
    {
        0,
        0x11001222,
        -1
    },
    {
        1,
        0x37441422,
        -1
    },
    {
        2,
        0x37441422,
        -1
    },
    {
        3,
        0x37441422,
        -1
    },
    {
        4,
        0x37441422,
        -1
    },
    {
        5,
        0x37441422,
        -1
    },
    {
        6,
        0x37441422,
        -1
    },
    {
        7,
        0x37441422,
        -1
    },
    {
        8,
        0x37441422,
        -1
    },
    {
        9,
        0x37441422,
        -1
    },
    {
        0xA,
        0x37441422,
        -1
    },
    {
        0xB,
        0x37441422,
        -1
    },
    {
        0xC,
        0x37441422,
        -1
    },
    {
        0xD,
        0x37441422,
        -1
    },
    {
        0xE,
        0x37441422,
        -1
    },
    {
        0xF,
        0x37441422,
        -1
    },
    {
        0x10,
        0x37441422,
        -1
    },
    {
        0x11,
        0x11001222,
        -1
    },
    {
        0,
        0x37441422,
        -1
    },
    {
        5,
        0x37441422,
        -1
    },
    {
        6,
        0x37441422,
        -1
    },
    {
        7,
        0x37441422,
        -1
    },
    {
        8,
        0x37441422,
        -1
    },
    {
        9,
        0x37441422,
        -1
    },
    {
        0xA,
        0x37441422,
        -1
    },
    {
        0xB,
        0x37441422,
        -1
    },
    {
        0xC,
        0x37441422,
        -1
    },
    {
        0xD,
        0x37441422,
        -1
    },
    {
        1,
        0x37441422,
        -1
    },
    {
        2,
        0x37441422,
        -1
    },
    {
        3,
        0x37441422,
        -1
    },
    {
        4,
        0x37441422,
        -1
    },
    {
        0,
        0x37441422,
        -1
    },
    {
        1,
        0x37441422,
        -1
    },
    {
        2,
        0x37441422,
        -1
    },
    {
        3,
        0x37441422,
        -1
    },
    {
        4,
        0x37441422,
        -1
    },
    {
        5,
        0x37441422,
        -1
    },
    {
        6,
        0x37441422,
        -1
    },
    {
        7,
        0x37441422,
        -1
    },
    {
        8,
        0x37441422,
        -1
    },
    {
        9,
        0x37441422,
        -1
    },
    {
        0x12,
        0x37441422,
        -1
    },
    {
        0xA,
        0x11001222,
        -1
    },
    {
        0xB,
        0x11001222,
        -1
    },
    {
        0xC,
        0x11001222,
        -1
    },
    {
        0xD,
        0x37441422,
        -1
    },
    {
        0xE,
        0x37441422,
        -1
    },
    {
        0xF,
        0x37441422,
        -1
    },
    {
        0x10,
        0x37441422,
        -1
    },
    {
        0x11,
        0x37441422,
        -1
    },
    {
        0,
        0x37441422,
        0xA
    },
    {
        1,
        0x37441422,
        0xA
    },
    {
        2,
        0x11001222,
        0xA
    },
    {
        3,
        0x11001222,
        0xA
    },
    {
        4,
        0x11001222,
        0xA
    },
    {
        5,
        0x37441422,
        0xA
    },
    {
        6,
        0x37441422,
        0xA
    },
    {
        7,
        0x37441422,
        0xA
    },
    {
        0,
        0x37441422,
        0xB
    },
    {
        1,
        0x11001222,
        0xB
    },
    {
        2,
        0x11001222,
        0xB
    },
    {
        3,
        0x37441422,
        0xB
    },
    {
        4,
        0x37441422,
        0xB
    },
    {
        0,
        0x11001222,
        0xC
    },
    {
        1,
        0x37441422,
        0xC
    },
    {
        2,
        0x11001222,
        0xC
    },
    {
        3,
        0x11001222,
        0xC
    },
    {
        4,
        0x37441422,
        0xC
    },
};

struct FigureCheckTbl {
    /* 0x00 */ f32 field_0x00;
    /* 0x04 */ f32 field_0x04;
    /* 0x08 */ f32 field_0x08;
    /* 0x0C */ f32 field_0x0C;
    /* 0x10 */ f32 field_0x10;
    /* 0x14 */ f32 field_0x14;
    /* 0x18 */ f32 field_0x18;
    /* 0x1C */ f32 field_0x1C;
    /* 0x20 */ f32 field_0x20;
    /* 0x24 */ f32 field_0x24;
    /* 0x28 */ s16 field_0x28;
    /* 0x2A */ s16 field_0x2A;
    /* 0x2C */ s16 field_0x2C;
    /* 0x2E */ s16 field_0x2E;
    /* 0x30 */ s16 field_0x30;
    /* 0x32 */ s16 field_0x32;
}; // Size: 0x34

static const FigureCheckTbl l_figure_check_tbl[] = {
    {
        200.0f,
        5.0f,
        118.0f,
        80.0f,
        150.0f,
        30.0f,
        50.0f,
        2.0f,
        20.0f,
        60.0f,
        0x0000,
        0x0200,
        0x0200,
        0xE3E0,
        0x0FA0,
        0x0000,
    },
    {
        200.0f,
        5.0f,
        118.0f,
        80.0f,
        150.0f,
        30.0f,
        50.0f,
        2.0f,
        20.0f,
        60.0f,
        0x0000,
        0x0200,
        0x0200,
        0xE3E0,
        0x0FA0,
        0x0000,
    },
    {
        200.0f,
        5.0f,
        150.0f,
        80.0f,
        200.0f,
        30.0f,
        50.0f,
        2.0f,
        20.0f,
        60.0f,
        0x0000,
        0x0200,
        0x0200,
        0xE3E0,
        0x0FA0,
        0x0000,
    },
    {
        200.0f,
        5.0f,
        150.0f,
        80.0f,
        200.0f,
        30.0f,
        50.0f,
