/**
 * d_a_btd.cpp
 * Boss - Gohma / ボスゴーマ (Boss Goma)
 */

#include "d/dolzel_rel.h" // IWYU pragma: keep
#include "d/d_lib.h"
#include "d/d_camera.h"
#include "d/actor/d_a_player.h"
#include "d/d_snap.h"
#include "d/d_s_play.h"
#include "d/actor/d_a_dr2.h"
#include "d/actor/d_a_kui.h"
#include "d/actor/d_a_btd.h"
#include "d/actor/d_a_ykgr.h"
#include "d/res/res_btd.h"
#include "m_Do/m_Do_ext.h"
#include "m_Do/m_Do_graphic.h"
#include "d/d_procname.h"
#include "d/d_priority.h"
#include "d/d_cc_d.h"
#include "f_op/f_op_camera.h"
#include "JSystem/JUtility/JUTReport.h"

/* 000000EC-000001C8       .text __ct__11daBtd_HIO_cFv */
class daBtd_HIO_c : public JORReflexible {
public:
    daBtd_HIO_c();
    virtual ~daBtd_HIO_c() {};
    void genMessage(JORMContext*) {}

public:
    /* 0x04 */ s8 mNo;
    /* 0x05 */ u8 m05;
    /* 0x06 */ u8 m06;
    /* 0x07 */ u8 m07;
    /* 0x08 */ f32 m08;
    /* 0x0C */ s16 m0C;
    /* 0x0E */ s16 m0E;
    /* 0x10 */ u8 m10;
    /* 0x11 */ s8 m11;
    /* 0x12 */ s8 m12;
    /* 0x13 */ s8 m13;
    /* 0x14 */ f32 m14;
    /* 0x18 */ f32 m18;
    /* 0x1C */ f32 m1C;
    /* 0x20 */ f32 m20;
    /* 0x24 */ f32 m24;
    /* 0x28 */ f32 m28;
    /* 0x2C */ s16 m2C;
    /* 0x2E */ s16 m2E;
    /* 0x30 */ f32 m30;
    /* 0x34 */ f32 m34;
    /* 0x38 */ f32 m38;
    /* 0x3C */ s16 m3C;
    /* 0x3E */ s16 m3E;
    /* 0x40 */ s16 m40;
    /* 0x42 */ s16 m42;
    /* 0x44 */ s16 m44;
    /* 0x46 */ s16 m46;
    /* 0x48 */ f32 m48;
    /* 0x4C */ f32 m4C;
    /* 0x50 */ f32 m50;
    /* 0x54 */ u8 m54;
}; // Size: 0x54

daBtd_HIO_c::daBtd_HIO_c() {
    mNo = 0xFF;
    m05 = 0;
    m06 = 0;
    m07 = 0;
    m08 = 1.0f;
    m0C = 0x96;
    m0E = 5;
    m10 = 0;
    m14 = 100.0f;
    m18 = 0.5f;
    m1C = 0.5f;
    m20 = 0.2f;
    m24 = 0.2f;
    m2C = 10;
    m28 = 150.0f;
    m30 = 4.0f;
    m34 = 20.0f;
    m38 = 6.0f;
    m3C = 0xb6;
    m3E = 0x9c;
    m40 = 0x56;
    m42 = 0xff;
    m44 = 0x8e;
    m46 = 0x24;
    m48 = 12.0f;
    m4C = 35.0f;
    m50 = 1.0f;
    m54 = 0;
}

static kui_class* kui;
static dr2_class* dr2;
static cXyz static_center_pos;
static daBtd_HIO_c l_HIO;

static s8 joint_check[] = {-1,   0x05, -1,   -1,   0x11, -1,   -1,   -1,   -1, -1, 0x12, -1,   -1, -1,   0x06, -1,  -1,   -1,   -1,
                           -1,   -1,   -1,   -1,   -1,   -1,   -1,   -1,   -1, -1, -1,   -1,   -1, 0x04, -1,   -1,  0x0D, -1,   -1,
