/**
 * d_a_npc_tc.cpp
 * NPC - Tingle, Ankle, David Jr. & Knuckle
 */

#include "d/dolzel_rel.h" // IWYU pragma: keep
#include "d/actor/d_a_npc_tc.h"
#include "m_Do/m_Do_ext.h"
#include "d/d_procname.h"
#include "d/d_priority.h"
#include "d/res/res_tc.h"
#include "d/d_s_play.h"
#include "d/d_snap.h"
#include "d/actor/d_a_obj_smplbg.h"
#include "d/d_lib.h"

class daNpc_Tc_HIO_c : public mDoHIO_entry_c{
public:
    daNpc_Tc_HIO_c();
    virtual ~daNpc_Tc_HIO_c() {}

    void genMessage(JORMContext* ctx) {}

public:
    /* 0x04 */ dNpc_HIO_c mNpc;
    /* 0x2C */ f32 field_0x2C;
    /* 0x30 */ f32 field_0x30;
    /* 0x34 */ u8 field_0x34;
    /* 0x35 */ u8 field_0x35[0x38 - 0x35];
    /* 0x38 */ f32 field_0x38;
    /* 0x3C */ f32 field_0x3C;
    /* 0x40 */ f32 field_0x40;
    /* 0x44 */ bool field_0x44;
    /* 0x45 */ u8 field_0x45[0x48 - 0x45];
    /* 0x48 */ f32 field_0x48;
    /* 0x4C */ f32 field_0x4C;
    /* 0x50 */ f32 field_0x50;
    /* 0x54 */ f32 field_0x54;
    /* 0x58 */ f32 field_0x58;
    /* 0x5C */ f32 field_0x5C;
    /* 0x60 */ cXyz field_0x60;
    /* 0x6C */ cXyz field_0x6C;
    /* 0x78 */ s16 field_0x78;
    /* 0x7A */ s16 field_0x7A;
    /* 0x7C */ u8 field_0x7C;
    /* 0x7D */ u8 field_0x7D;
    /* 0x7E */ u8 field_0x7E;
    /* 0x7F */ u8 field_0x7F[8];
    /* 0x87 */ u8 field_0x87[8];
    /* 0x8F */ u8 field_0x8F;
    /* 0x90 */ u8 field_0x90;
    /* 0x91 */ u8 field_0x91;
    /* 0x92 */ u8 field_0x92;
    /* 0x93 */ u8 field_0x93;
    /* 0x94 */ f32 field_0x94;
    /* 0x98 */ f32 field_0x98;
    /* 0x9C */ f32 field_0x9C;
    /* 0xA0 */ f32 field_0xA0;
    /* 0xA4 */ f32 field_0xA4;
    /* 0xA8 */ f32 field_0xA8;
    /* 0xAC */ f32 field_0xAC;
    /* 0xB0 */ f32 field_0xB0;
    /* 0xB4 */ f32 field_0xB4;
    /* 0xB8 */ f32 field_0xB8;
    /* 0xBC */ f32 field_0xBC;
    /* 0xC0 */ f32 field_0xC0;
    /* 0xC4 */ f32 field_0xC4;
    /* 0xC8 */ f32 field_0xC8;
    /* 0xCC */ f32 field_0xCC;
    /* 0xD0 */ f32 field_0xD0;
    /* 0xD4 */ f32 field_0xD4;
    /* 0xD8 */ f32 field_0xD8;
    /* 0xDC */ f32 field_0xDC;
    /* 0xE0 */ f32 field_0xE0;
    /* 0xE4 */ f32 field_0xE4;
    /* 0xE8 */ f32 field_0xE8;
    /* 0xEC */ f32 field_0xEC;
    /* 0xF0 */ f32 field_0xF0;
};  // Size: 0xF4

static daNpc_Tc_HIO_c l_HIO;

/* 000000EC-00000394       .text __ct__14daNpc_Tc_HIO_cFv */
daNpc_Tc_HIO_c::daNpc_Tc_HIO_c() {
    field_0x60.set(-100.0f, 1700.0f, -50.0f);
    field_0x6C.set(100.0f, 1700.0f, 50.0f);

    field_0x7A = 0;
    field_0x78 = -0x8000;

    field_0x7C = dComIfGs_isEventBit(dSv_event_flag_c::UNK_0B80);
    field_0x7D = dComIfGs_isEventBit(dSv_event_flag_c::UNK_1A20);
    field_0x7E = dComIfGs_isEventBit(dSv_event_flag_c::UNK_1708);

    for (int i = 0; i < 8; i++) {
        field_0x87[i] = dComIfGs_isGetCollectMap(i+1);
    }

    for (int i = 0; i < 8; i++) {
        field_0x7F[i] = dComIfGs_isCollectMapTriforce(i+1);
    }

    field_0x8F = dComIfGs_isStageTbox(3, 0xf);
    field_0x90 = dComIfGs_isStageTbox(4, 0xf);
    field_0x91 = dComIfGs_isStageTbox(5, 0xf);
    field_0x92 = dComIfGs_isStageTbox(7, 0xf);
    field_0x93 = dComIfGs_isStageTbox(6, 0xf);// weird?


    mNpc.m04 = -20.0;
