/**
 * d_a_obj_figure.cpp
 * Object - Nintendo Gallery figurines + stand
 */

#include "d/dolzel_rel.h" // IWYU pragma: keep
#include "d/actor/d_a_obj_figure.h"
#include "d/res/res_figure.h"
#include "d/res/res_figure2.h"
#include "f_op/f_op_actor_mng.h"
#include "d/d_com_inf_game.h"
#include "d/d_com_lib_game.h"
#include "d/d_snap.h"
#include "d/d_camera.h"
#include "d/d_a_obj.h"
#include "d/d_procname.h"
#include "d/d_priority.h"
#include "d/actor/d_a_player_main.h"
#include "m_Do/m_Do_controller_pad.h"

#define TOTAL_FIGURE_COUNT 0x86

static const char* l_arcname_tbl[] = {
    "Figure",
    "Figure2",
    "Figure1",
    "Figure0",
    "Figure6",
    "Figure5",
    "Figure3",
    "Figure4",
#if VERSION > VERSION_DEMO
    "Figure2a",
    "Figure2b",
    "Figure6a",
    "Figure6b",
    "Figure6c",
#endif
};

static u16 l_figure_comp[] = {
    0x95FF,
    0x94FF,
    0x93FF,
    0x92FF,
    0x91FF,
    0x90FF,
    0x8FFF,
    0x8EFF,
    0x8DFF,
    0x8CFF,
    0xB1FF,
    0x9CFF,
    0x84FF,
    0x83FF,
    0x82FF,
    0x81FF,
    0x80FF,
};

static dCcD_SrcCyl l_cyl_src = {
    // dCcD_SrcGObjInf
    {
        /* Flags             */ 0,
        /* SrcObjAt  Type    */ 0,
        /* SrcObjAt  Atp     */ 0,
        /* SrcObjAt  SPrm    */ 0,
        /* SrcObjTg  Type    */ AT_TYPE_ALL,
        /* SrcObjTg  SPrm    */ cCcD_TgSPrm_Set_e | cCcD_TgSPrm_IsEnemy_e,
        /* SrcObjCo  SPrm    */ cCcD_CoSPrm_Set_e | cCcD_CoSPrm_IsOther_e | cCcD_CoSPrm_VsGrpAll_e,
        /* SrcGObjAt Se      */ 0,
        /* SrcGObjAt HitMark */ 0,
        /* SrcGObjAt Spl     */ 0,
        /* SrcGObjAt Mtrl    */ 0,
        /* SrcGObjAt SPrm    */ 0,
        /* SrcGObjTg Se      */ 0,
        /* SrcGObjTg HitMark */ 0,
        /* SrcGObjTg Spl     */ 0,
        /* SrcGObjTg Mtrl    */ 0,
        /* SrcGObjTg SPrm    */ dCcG_TgSPrm_NoHitMark_e,
        /* SrcGObjCo SPrm    */ 0,
    },
    // cM3dGCylS
    {{
        /* Center */ {0.0f, 0.0f, 0.0f},
        /* Radius */ 60.0f,
        /* Height */ 150.0f,
    }},
};

struct FigureData {
    /* 0x00 */ int mBmdId;
    /* 0x04 */ int mModelAttr;
#if VERSION > VERSION_DEMO
    /* 0x08 */ int mRoomId;
#endif
}; // Size: 0x0C

#if VERSION == VERSION_DEMO
#define FIGUREDAT(bmdId, dlistFlags, roomId)                                                       \
    {                                                                                              \
        bmdId, dlistFlags                                                                          \
    }
#else
#define FIGUREDAT(bmdId, dlistFlags, roomId)                                                       \
    {                                                                                              \
        bmdId, dlistFlags, roomId                                                                  \
    }
#endif

static const FigureData l_figure_dat_tbl[TOTAL_FIGURE_COUNT] = {
    FIGUREDAT(0x00, 0x37441422, -1),
    FIGUREDAT(0x01, 0x37441422, -1),
    FIGUREDAT(0x02, 0x37441422, -1),
    FIGUREDAT(0x03, 0x37441422, -1),
    FIGUREDAT(0x0A, 0x37441422, -1),
    FIGUREDAT(0x04, 0x37441422, -1),
    FIGUREDAT(0x05, 0x37441422, -1),
    FIGUREDAT(0x06, 0x37441422, -1),
    FIGUREDAT(0x07, 0x37441422, -1),
    FIGUREDAT(0x08, 0x37441422, -1),
    FIGUREDAT(0x09, 0x11001222, -1),
    FIGUREDAT(0x0B, 0x37441422, -1),
    FIGUREDAT(0x0C, 0x37441422, -1),
    FIGUREDAT(0x0D, 0x37441422, -1),
    FIGUREDAT(0x00, 0x37441422, -1),
    FIGUREDAT(0x01, 0x37441422, -1),
    FIGUREDAT(0x02, 0x37441422, -1),
    FIGUREDAT(0x04, 0x37441422, -1),
    FIGUREDAT(0x05, 0x37441422, -1),
    FIGUREDAT(0x07, 0x37441422, -1),
    FIGUREDAT(0x08, 0x37441422, -1),
    FIGUREDAT(0x09, 0x37441422, -1),
    FIGUREDAT(0x0A, 0x37441422, -1),
    FIGUREDAT(0x0B, 0x37441422, -1),
    FIGUREDAT(0x0C, 0x37441422, -1),
    FIGUREDAT(0x0D, 0x37441422, -1),
    FIGUREDAT(0x0E, 0x37441422, -1),
    FIGUREDAT(0x0F, 0x37441422, -1),
    FIGUREDAT(0x10, 0x37441422, -1),
    FIGUREDAT(0x11, 0x37441422, -1),
    FIGUREDAT(0x12, 0x37441422, -1),
    FIGUREDAT(0x13, 0x37441422, -1),
    FIGUREDAT(0x14, 0x37441422, -1),
    FIGUREDAT(0x15, 0x37441422, -1),
    FIGUREDAT(0x16, 0x37441422, -1),
    FIGUREDAT(0x17, 0x37441422, -1),
    FIGUREDAT(0x18, 0x37441422, -1),
    FIGUREDAT(0x19, 0x37441422, -1),
    FIGUREDAT(0x1A, 0x37441422, -1),
    FIGUREDAT(0x1B, 0x37441422, -1),
    FIGUREDAT(0x1C, 0x37441422, -1),
#if VERSION > VERSION_DEMO
    FIGUREDAT(0x00, 0x37441422, 8),
#endif
    FIGUREDAT(0x01, 0x37441422, 8),
    FIGUREDAT(0x02, 0x37441422, 8),
    FIGUREDAT(0x03, 0x37441422, 8),
    FIGUREDAT(0x04, 0x37441422, 8),
    FIGUREDAT(0x05, 0x37441422, 8),
    FIGUREDAT(0x06, 0x37441422, 8),
    FIGUREDAT(0x07, 0x37441422, 8),
    FIGUREDAT(0x08, 0x37441422, 8),
    FIGUREDAT(0x09, 0x37441422, 8),
    FIGUREDAT(0x0A, 0x37441422, 8),
    FIGUREDAT(0x0B, 0x37441422, 8),
    FIGUREDAT(0x0C, 0x37441422, 8),
#if VERSION == VERSION_DEMO
    FIGUREDAT(0x17, 0x37441422, -1),
#endif
    FIGUREDAT(0x0D, 0x37441422, 8),
    FIGUREDAT(0x0E, 0x37441422, 8),
#if VERSION == VERSION_DEMO
    FIGUREDAT(0x18, 0x37441422, 8),
    FIGUREDAT(0x0F, 0x37441422, 8),
    FIGUREDAT(0x10, 0x37441422, 8),
    FIGUREDAT(0x11, 0x37441422, 8),
    FIGUREDAT(0x12, 0x37441422, 8),
    FIGUREDAT(0x19, 0x37441422, 9),
    FIGUREDAT(0x13, 0x37441422, 9),
    FIGUREDAT(0x14, 0x37441422, 9),
    FIGUREDAT(0x16, 0x37441422, 9),
#else
    FIGUREDAT(0x0F, 0x37441422, 8),
    FIGUREDAT(0x10, 0x37441422, 8),
    FIGUREDAT(0x11, 0x37441422, 8),
    FIGUREDAT(0x12, 0x37441422, 8),
    FIGUREDAT(0x13, 0x37441422, 8),
    FIGUREDAT(0x06, 0x37441422, 9),
    FIGUREDAT(0x01, 0x37441422, 9),
    FIGUREDAT(0x02, 0x37441422, 9),
    FIGUREDAT(0x05, 0x37441422, 9),
#endif
    FIGUREDAT(0x00, 0x11001222, -1),
    FIGUREDAT(0x01, 0x37441422, -1),
    FIGUREDAT(0x02, 0x37441422, -1),
    FIGUREDAT(0x03, 0x37441422, -1),
    FIGUREDAT(0x04, 0x37441422, -1),
    FIGUREDAT(0x05, 0x37441422, -1),
    FIGUREDAT(0x06, 0x37441422, -1),
    FIGUREDAT(0x07, 0x37441422, -1),
    FIGUREDAT(0x08, 0x37441422, -1),
    FIGUREDAT(0x09, 0x37441422, -1),
    FIGUREDAT(0x0A, 0x37441422, -1),
    FIGUREDAT(0x0B, 0x37441422, -1),
    FIGUREDAT(0x0C, 0x37441422, -1),
    FIGUREDAT(0x0D, 0x37441422, -1),
    FIGUREDAT(0x0E, 0x37441422, -1),
    FIGUREDAT(0x0F, 0x37441422, -1),
    FIGUREDAT(0x10, 0x37441422, -1),
    FIGUREDAT(0x11, 0x11001222, -1),
    FIGUREDAT(0x00, 0x37441422, -1),
    FIGUREDAT(0x05, 0x37441422, -1),
    FIGUREDAT(0x06, 0x37441422, -1),
    FIGUREDAT(0x07, 0x37441422, -1),
    FIGUREDAT(0x08, 0x37441422, -1),
    FIGUREDAT(0x09, 0x37441422, -1),
    FIGUREDAT(0x0A, 0x37441422, -1),
    FIGUREDAT(0x0B, 0x37441422, -1),
    FIGUREDAT(0x0C, 0x37441422, -1),
    FIGUREDAT(0x0D, 0x37441422, -1),
    FIGUREDAT(0x01, 0x37441422, -1),
    FIGUREDAT(0x02, 0x37441422, -1),
    FIGUREDAT(0x03, 0x37441422, -1),
    FIGUREDAT(0x04, 0x37441422, -1),
    FIGUREDAT(0x00, 0x37441422, -1),
    FIGUREDAT(0x01, 0x37441422, -1),
    FIGUREDAT(0x02, 0x37441422, -1),
    FIGUREDAT(0x03, 0x37441422, -1),
    FIGUREDAT(0x04, 0x37441422, -1),
    FIGUREDAT(0x05, 0x37441422, -1),
    FIGUREDAT(0x06, 0x37441422, -1),
    FIGUREDAT(0x07, 0x37441422, -1),
    FIGUREDAT(0x08, 0x37441422, -1),
    FIGUREDAT(0x09, 0x37441422, -1),
    FIGUREDAT(0x12, 0x37441422, -1),
    FIGUREDAT(0x0A, 0x11001222, -1),
    FIGUREDAT(0x0B, 0x11001222, -1),
    FIGUREDAT(0x0C, 0x11001222, -1),
    FIGUREDAT(0x0D, 0x37441422, -1),
    FIGUREDAT(0x0E, 0x37441422, -1),
    FIGUREDAT(0x0F, 0x37441422, -1),
    FIGUREDAT(0x10, 0x37441422, -1),
    FIGUREDAT(0x11, 0x37441422, -1),
    FIGUREDAT(0x00, 0x37441422, 0xA),
#if VERSION == VERSION_DEMO
    FIGUREDAT(0x10, 0x37441422, 0xA),
#else
    FIGUREDAT(0x01, 0x37441422, 0xA),
#endif
    FIGUREDAT(0x02, 0x11001222, 0xA),
    FIGUREDAT(0x03, 0x11001222, 0xA),
    FIGUREDAT(0x04, 0x11001222, 0xA),
    FIGUREDAT(0x05, 0x37441422, 0xA),
    FIGUREDAT(0x06, 0x37441422, 0xA),
    FIGUREDAT(0x07, 0x37441422, 0xA),
#if VERSION == VERSION_DEMO
    FIGUREDAT(0x08, 0x37441422, 0xB),
    FIGUREDAT(0x09, 0x11001222, 0xB),
    FIGUREDAT(0x01, 0x11001222, 0xB),
    FIGUREDAT(0x0A, 0x37441422, 0xB),
    FIGUREDAT(0x0B, 0x37441422, 0xB),
    FIGUREDAT(0x0C, 0x11001222, 0xC),
    FIGUREDAT(0x0D, 0x37441422, 0xC),
    FIGUREDAT(0x0E, 0x11001222, 0xC),
    FIGUREDAT(0x11, 0x11001222, 0xC),
    FIGUREDAT(0x0F, 0x37441422, 0xC),
#else
    FIGUREDAT(0x00, 0x37441422, 0xB),
    FIGUREDAT(0x01, 0x11001222, 0xB),
    FIGUREDAT(0x02, 0x11001222, 0xB),
    FIGUREDAT(0x03, 0x37441422, 0xB),
    FIGUREDAT(0x04, 0x37441422, 0xB),
    FIGUREDAT(0x00, 0x11001222, 0xC),
    FIGUREDAT(0x01, 0x37441422, 0xC),
    FIGUREDAT(0x02, 0x11001222, 0xC),
    FIGUREDAT(0x03, 0x11001222, 0xC),
    FIGUREDAT(0x04, 0x37441422, 0xC),
#endif
};

struct FigureCheckTbl {
    /* 0x00 */ f32 field_0x00;
    /* 0x04 */ f32 field_0x04;
    /* 0x08 */ f32 field_0x08;
    /* 0x0C */ f32 field_0x0C;
    /* 0x10 */ f32 field_0x10;
    /* 0x14 */ f32 field_0x14;
    /* 0x18 */ f32 field_0x18;
    /* 0x1C */ f32 field_0x1C;
    /* 0x20 */ f32 field_0x20;
    /* 0x24 */ f32 field_0x24;
    /* 0x28 */ s16 field_0x28;
    /* 0x2A */ s16 field_0x2A;
    /* 0x2C */ s16 field_0x2C;
    /* 0x2E */ s16 field_0x2E;
    /* 0x30 */ s16 field_0x30;
    /* 0x32 */ s16 field_0x32;
}; // Size: 0x34

static const FigureCheckTbl l_figure_check_tbl[] = {
    {
        200.0f,
        5.0f,
        118.0f,
        80.0f,
        150.0f,
        30.0f,
        50.0f,
        2.0f,
        20.0f,
        60.0f,
        0x0000,
        0x0200,
        0x0200,
        0xE3E0,
        0x0FA0,
        0x0000,
    },
    {
        200.0f,
        5.0f,
        118.0f,
        80.0f,
        150.0f,
        30.0f,
        50.0f,
        2.0f,
        20.0f,
        60.0f,
        0x0000,
        0x0200,
        0x0200,
        0xE3E0,
        0x0FA0,
        0x0000,
    },
    {
        200.0f,
        5.0f,
        150.0f,
        80.0f,
        200.0f,
        30.0f,
        50.0f,
        2.0f,
        20.0f,
        60.0f,
        0x0000,
        0x0200,
        0x0200,
        0xE3E0,
        0x0FA0,
        0x0000,
    },
    {
        200.0f,
        5.0f,
        150.0f,
        80.0f,
        200.0f,
        30.0f,
        50.0f,
